tsugli/stm32/common/rtos/portable/GCC/AT91SAM7A3/ioat91sam7a3.h
#define AT91C_CAN0_MB6_MFID ((AT91_REG *) 	0xFFF802CC) // (CAN0_MB6) MailBox Family ID Register
#define AT91C_CAN0_MB6_MSR ((AT91_REG *) 	0xFFF802D0) // (CAN0_MB6) MailBox Status Register
// ========== Register definition for CAN0_MB7 peripheral ========== 
#define AT91C_CAN0_MB7_MSR ((AT91_REG *) 	0xFFF802F0) // (CAN0_MB7) MailBox Status Register
#define AT91C_CAN0_MB7_MMR ((AT91_REG *) 	0xFFF802E0) // (CAN0_MB7) MailBox Mode Register
#define AT91C_CAN0_MB7_MCR ((AT91_REG *) 	0xFFF802FC) // (CAN0_MB7) MailBox Control Register
#define AT91C_CAN0_MB7_MDL ((AT91_REG *) 	0xFFF802F4) // (CAN0_MB7) MailBox Data Low Register
#define AT91C_CAN0_MB7_MID ((AT91_REG *) 	0xFFF802E8) // (CAN0_MB7) MailBox ID Register
#define AT91C_CAN0_MB7_MDH ((AT91_REG *) 	0xFFF802F8) // (CAN0_MB7) MailBox Data High Register
#define AT91C_CAN0_MB7_MFID ((AT91_REG *) 	0xFFF802EC) // (CAN0_MB7) MailBox Family ID Register
#define AT91C_CAN0_MB7_MAM ((AT91_REG *) 	0xFFF802E4) // (CAN0_MB7) MailBox Acceptance Mask Register
// ========== Register definition for CAN0_MB8 peripheral ========== 
#define AT91C_CAN0_MB8_MAM ((AT91_REG *) 	0xFFF80304) // (CAN0_MB8) MailBox Acceptance Mask Register
#define AT91C_CAN0_MB8_MCR ((AT91_REG *) 	0xFFF8031C) // (CAN0_MB8) MailBox Control Register
#define AT91C_CAN0_MB8_MSR ((AT91_REG *) 	0xFFF80310) // (CAN0_MB8) MailBox Status Register
#define AT91C_CAN0_MB8_MID ((AT91_REG *) 	0xFFF80308) // (CAN0_MB8) MailBox ID Register
#define AT91C_CAN0_MB8_MDH ((AT91_REG *) 	0xFFF80318) // (CAN0_MB8) MailBox Data High Register
#define AT91C_CAN0_MB8_MFID ((AT91_REG *) 	0xFFF8030C) // (CAN0_MB8) MailBox Family ID Register
#define AT91C_CAN0_MB8_MMR ((AT91_REG *) 	0xFFF80300) // (CAN0_MB8) MailBox Mode Register
#define AT91C_CAN0_MB8_MDL ((AT91_REG *) 	0xFFF80314) // (CAN0_MB8) MailBox Data Low Register
// ========== Register definition for CAN0_MB9 peripheral ========== 
#define AT91C_CAN0_MB9_MMR ((AT91_REG *) 	0xFFF80320) // (CAN0_MB9) MailBox Mode Register
#define AT91C_CAN0_MB9_MDH ((AT91_REG *) 	0xFFF80338) // (CAN0_MB9) MailBox Data High Register
#define AT91C_CAN0_MB9_MSR ((AT91_REG *) 	0xFFF80330) // (CAN0_MB9) MailBox Status Register
#define AT91C_CAN0_MB9_MDL ((AT91_REG *) 	0xFFF80334) // (CAN0_MB9) MailBox Data Low Register
#define AT91C_CAN0_MB9_MID ((AT91_REG *) 	0xFFF80328) // (CAN0_MB9) MailBox ID Register
#define AT91C_CAN0_MB9_MFID ((AT91_REG *) 	0xFFF8032C) // (CAN0_MB9) MailBox Family ID Register
#define AT91C_CAN0_MB9_MCR ((AT91_REG *) 	0xFFF8033C) // (CAN0_MB9) MailBox Control Register
#define AT91C_CAN0_MB9_MAM ((AT91_REG *) 	0xFFF80324) // (CAN0_MB9) MailBox Acceptance Mask Register
// ========== Register definition for CAN0_MB10 peripheral ========== 
#define AT91C_CAN0_MB10_MCR ((AT91_REG *) 	0xFFF8035C) // (CAN0_MB10) MailBox Control Register
#define AT91C_CAN0_MB10_MID ((AT91_REG *) 	0xFFF80348) // (CAN0_MB10) MailBox ID Register
#define AT91C_CAN0_MB10_MAM ((AT91_REG *) 	0xFFF80344) // (CAN0_MB10) MailBox Acceptance Mask Register
#define AT91C_CAN0_MB10_MFID ((AT91_REG *) 	0xFFF8034C) // (CAN0_MB10) MailBox Family ID Register
#define AT91C_CAN0_MB10_MDL ((AT91_REG *) 	0xFFF80354) // (CAN0_MB10) MailBox Data Low Register
#define AT91C_CAN0_MB10_MMR ((AT91_REG *) 	0xFFF80340) // (CAN0_MB10) MailBox Mode Register
#define AT91C_CAN0_MB10_MDH ((AT91_REG *) 	0xFFF80358) // (CAN0_MB10) MailBox Data High Register
#define AT91C_CAN0_MB10_MSR ((AT91_REG *) 	0xFFF80350) // (CAN0_MB10) MailBox Status Register
// ========== Register definition for CAN0_MB11 peripheral ========== 
#define AT91C_CAN0_MB11_MCR ((AT91_REG *) 	0xFFF8037C) // (CAN0_MB11) MailBox Control Register
#define AT91C_CAN0_MB11_MFID ((AT91_REG *) 	0xFFF8036C) // (CAN0_MB11) MailBox Family ID Register
#define AT91C_CAN0_MB11_MDH ((AT91_REG *) 	0xFFF80378) // (CAN0_MB11) MailBox Data High Register
#define AT91C_CAN0_MB11_MAM ((AT91_REG *) 	0xFFF80364) // (CAN0_MB11) MailBox Acceptance Mask Register
#define AT91C_CAN0_MB11_MID ((AT91_REG *) 	0xFFF80368) // (CAN0_MB11) MailBox ID Register
#define AT91C_CAN0_MB11_MMR ((AT91_REG *) 	0xFFF80360) // (CAN0_MB11) MailBox Mode Register
#define AT91C_CAN0_MB11_MSR ((AT91_REG *) 	0xFFF80370) // (CAN0_MB11) MailBox Status Register
#define AT91C_CAN0_MB11_MDL ((AT91_REG *) 	0xFFF80374) // (CAN0_MB11) MailBox Data Low Register
// ========== Register definition for CAN0_MB12 peripheral ========== 
#define AT91C_CAN0_MB12_MCR ((AT91_REG *) 	0xFFF8039C) // (CAN0_MB12) MailBox Control Register
#define AT91C_CAN0_MB12_MID ((AT91_REG *) 	0xFFF80388) // (CAN0_MB12) MailBox ID Register
#define AT91C_CAN0_MB12_MDH ((AT91_REG *) 	0xFFF80398) // (CAN0_MB12) MailBox Data High Register
#define AT91C_CAN0_MB12_MAM ((AT91_REG *) 	0xFFF80384) // (CAN0_MB12) MailBox Acceptance Mask Register
#define AT91C_CAN0_MB12_MFID ((AT91_REG *) 	0xFFF8038C) // (CAN0_MB12) MailBox Family ID Register
#define AT91C_CAN0_MB12_MDL ((AT91_REG *) 	0xFFF80394) // (CAN0_MB12) MailBox Data Low Register
#define AT91C_CAN0_MB12_MMR ((AT91_REG *) 	0xFFF80380) // (CAN0_MB12) MailBox Mode Register
#define AT91C_CAN0_MB12_MSR ((AT91_REG *) 	0xFFF80390) // (CAN0_MB12) MailBox Status Register
// ========== Register definition for CAN0_MB13 peripheral ========== 
#define AT91C_CAN0_MB13_MCR ((AT91_REG *) 	0xFFF803BC) // (CAN0_MB13) MailBox Control Register
#define AT91C_CAN0_MB13_MDL ((AT91_REG *) 	0xFFF803B4) // (CAN0_MB13) MailBox Data Low Register
#define AT91C_CAN0_MB13_MAM ((AT91_REG *) 	0xFFF803A4) // (CAN0_MB13) MailBox Acceptance Mask Register
#define AT91C_CAN0_MB13_MFID ((AT91_REG *) 	0xFFF803AC) // (CAN0_MB13) MailBox Family ID Register
#define AT91C_CAN0_MB13_MDH ((AT91_REG *) 	0xFFF803B8) // (CAN0_MB13) MailBox Data High Register
#define AT91C_CAN0_MB13_MID ((AT91_REG *) 	0xFFF803A8) // (CAN0_MB13) MailBox ID Register
#define AT91C_CAN0_MB13_MSR ((AT91_REG *) 	0xFFF803B0) // (CAN0_MB13) MailBox Status Register
#define AT91C_CAN0_MB13_MMR ((AT91_REG *) 	0xFFF803A0) // (CAN0_MB13) MailBox Mode Register
// ========== Register definition for CAN0_MB14 peripheral ========== 
#define AT91C_CAN0_MB14_MSR ((AT91_REG *) 	0xFFF803D0) // (CAN0_MB14) MailBox Status Register
#define AT91C_CAN0_MB14_MMR ((AT91_REG *) 	0xFFF803C0) // (CAN0_MB14) MailBox Mode Register
#define AT91C_CAN0_MB14_MDL ((AT91_REG *) 	0xFFF803D4) // (CAN0_MB14) MailBox Data Low Register
#define AT91C_CAN0_MB14_MDH ((AT91_REG *) 	0xFFF803D8) // (CAN0_MB14) MailBox Data High Register
#define AT91C_CAN0_MB14_MID ((AT91_REG *) 	0xFFF803C8) // (CAN0_MB14) MailBox ID Register
#define AT91C_CAN0_MB14_MCR ((AT91_REG *) 	0xFFF803DC) // (CAN0_MB14) MailBox Control Register
#define AT91C_CAN0_MB14_MFID ((AT91_REG *) 	0xFFF803CC) // (CAN0_MB14) MailBox Family ID Register
#define AT91C_CAN0_MB14_MAM ((AT91_REG *) 	0xFFF803C4) // (CAN0_MB14) MailBox Acceptance Mask Register
// ========== Register definition for CAN0_MB15 peripheral ========== 
#define AT91C_CAN0_MB15_MDH ((AT91_REG *) 	0xFFF803F8) // (CAN0_MB15) MailBox Data High Register
#define AT91C_CAN0_MB15_MMR ((AT91_REG *) 	0xFFF803E0) // (CAN0_MB15) MailBox Mode Register
#define AT91C_CAN0_MB15_MCR ((AT91_REG *) 	0xFFF803FC) // (CAN0_MB15) MailBox Control Register
#define AT91C_CAN0_MB15_MAM ((AT91_REG *) 	0xFFF803E4) // (CAN0_MB15) MailBox Acceptance Mask Register
#define AT91C_CAN0_MB15_MID ((AT91_REG *) 	0xFFF803E8) // (CAN0_MB15) MailBox ID Register
#define AT91C_CAN0_MB15_MFID ((AT91_REG *) 	0xFFF803EC) // (CAN0_MB15) MailBox Family ID Register
#define AT91C_CAN0_MB15_MSR ((AT91_REG *) 	0xFFF803F0) // (CAN0_MB15) MailBox Status Register
#define AT91C_CAN0_MB15_MDL ((AT91_REG *) 	0xFFF803F4) // (CAN0_MB15) MailBox Data Low Register
// ========== Register definition for CAN0 peripheral ========== 
#define AT91C_CAN0_BR   ((AT91_REG *) 	0xFFF80014) // (CAN0) Baudrate Register
#define AT91C_CAN0_TIMESTP ((AT91_REG *) 	0xFFF8001C) // (CAN0) Time Stamp Register
#define AT91C_CAN0_IER  ((AT91_REG *) 	0xFFF80004) // (CAN0) Interrupt Enable Register
#define AT91C_CAN0_MR   ((AT91_REG *) 	0xFFF80000) // (CAN0) Mode Register
#define AT91C_CAN0_TCR  ((AT91_REG *) 	0xFFF80024) // (CAN0) Transfer Command Register
#define AT91C_CAN0_ACR  ((AT91_REG *) 	0xFFF80028) // (CAN0) Abort Command Register
#define AT91C_CAN0_IDR  ((AT91_REG *) 	0xFFF80008) // (CAN0) Interrupt Disable Register
#define AT91C_CAN0_IMR  ((AT91_REG *) 	0xFFF8000C) // (CAN0) Interrupt Mask Register
#define AT91C_CAN0_TIM  ((AT91_REG *) 	0xFFF80018) // (CAN0) Timer Register
#define AT91C_CAN0_VR   ((AT91_REG *) 	0xFFF800FC) // (CAN0) Version Register
#define AT91C_CAN0_ECR  ((AT91_REG *) 	0xFFF80020) // (CAN0) Error Counter Register
#define AT91C_CAN0_SR   ((AT91_REG *) 	0xFFF80010) // (CAN0) Status Register
// ========== Register definition for CAN1_MB0 peripheral ========== 
#define AT91C_CAN1_MB0_MFID ((AT91_REG *) 	0xFFF8420C) // (CAN1_MB0) MailBox Family ID Register
#define AT91C_CAN1_MB0_MDL ((AT91_REG *) 	0xFFF84214) // (CAN1_MB0) MailBox Data Low Register
#define AT91C_CAN1_MB0_MID ((AT91_REG *) 	0xFFF84208) // (CAN1_MB0) MailBox ID Register
#define AT91C_CAN1_MB0_MMR ((AT91_REG *) 	0xFFF84200) // (CAN1_MB0) MailBox Mode Register
#define AT91C_CAN1_MB0_MAM ((AT91_REG *) 	0xFFF84204) // (CAN1_MB0) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB0_MSR ((AT91_REG *) 	0xFFF84210) // (CAN1_MB0) MailBox Status Register
#define AT91C_CAN1_MB0_MDH ((AT91_REG *) 	0xFFF84218) // (CAN1_MB0) MailBox Data High Register
#define AT91C_CAN1_MB0_MCR ((AT91_REG *) 	0xFFF8421C) // (CAN1_MB0) MailBox Control Register
// ========== Register definition for CAN1_MB1 peripheral ========== 
#define AT91C_CAN1_MB1_MFID ((AT91_REG *) 	0xFFF8422C) // (CAN1_MB1) MailBox Family ID Register
#define AT91C_CAN1_MB1_MSR ((AT91_REG *) 	0xFFF84230) // (CAN1_MB1) MailBox Status Register
#define AT91C_CAN1_MB1_MMR ((AT91_REG *) 	0xFFF84220) // (CAN1_MB1) MailBox Mode Register
#define AT91C_CAN1_MB1_MDH ((AT91_REG *) 	0xFFF84238) // (CAN1_MB1) MailBox Data High Register
#define AT91C_CAN1_MB1_MID ((AT91_REG *) 	0xFFF84228) // (CAN1_MB1) MailBox ID Register
#define AT91C_CAN1_MB1_MDL ((AT91_REG *) 	0xFFF84234) // (CAN1_MB1) MailBox Data Low Register
#define AT91C_CAN1_MB1_MCR ((AT91_REG *) 	0xFFF8423C) // (CAN1_MB1) MailBox Control Register
#define AT91C_CAN1_MB1_MAM ((AT91_REG *) 	0xFFF84224) // (CAN1_MB1) MailBox Acceptance Mask Register
// ========== Register definition for CAN1_MB2 peripheral ========== 
#define AT91C_CAN1_MB2_MSR ((AT91_REG *) 	0xFFF84250) // (CAN1_MB2) MailBox Status Register
#define AT91C_CAN1_MB2_MMR ((AT91_REG *) 	0xFFF84240) // (CAN1_MB2) MailBox Mode Register
#define AT91C_CAN1_MB2_MAM ((AT91_REG *) 	0xFFF84244) // (CAN1_MB2) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB2_MID ((AT91_REG *) 	0xFFF84248) // (CAN1_MB2) MailBox ID Register
#define AT91C_CAN1_MB2_MFID ((AT91_REG *) 	0xFFF8424C) // (CAN1_MB2) MailBox Family ID Register
#define AT91C_CAN1_MB2_MDL ((AT91_REG *) 	0xFFF84254) // (CAN1_MB2) MailBox Data Low Register
#define AT91C_CAN1_MB2_MDH ((AT91_REG *) 	0xFFF84258) // (CAN1_MB2) MailBox Data High Register
#define AT91C_CAN1_MB2_MCR ((AT91_REG *) 	0xFFF8425C) // (CAN1_MB2) MailBox Control Register
// ========== Register definition for CAN1_MB3 peripheral ========== 
#define AT91C_CAN1_MB3_MCR ((AT91_REG *) 	0xFFF8427C) // (CAN1_MB3) MailBox Control Register
#define AT91C_CAN1_MB3_MDH ((AT91_REG *) 	0xFFF84278) // (CAN1_MB3) MailBox Data High Register
#define AT91C_CAN1_MB3_MAM ((AT91_REG *) 	0xFFF84264) // (CAN1_MB3) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB3_MDL ((AT91_REG *) 	0xFFF84274) // (CAN1_MB3) MailBox Data Low Register
#define AT91C_CAN1_MB3_MMR ((AT91_REG *) 	0xFFF84260) // (CAN1_MB3) MailBox Mode Register
#define AT91C_CAN1_MB3_MSR ((AT91_REG *) 	0xFFF84270) // (CAN1_MB3) MailBox Status Register
#define AT91C_CAN1_MB3_MFID ((AT91_REG *) 	0xFFF8426C) // (CAN1_MB3) MailBox Family ID Register
#define AT91C_CAN1_MB3_MID ((AT91_REG *) 	0xFFF84268) // (CAN1_MB3) MailBox ID Register
// ========== Register definition for CAN1_MB4 peripheral ========== 
#define AT91C_CAN1_MB4_MCR ((AT91_REG *) 	0xFFF8429C) // (CAN1_MB4) MailBox Control Register
#define AT91C_CAN1_MB4_MDH ((AT91_REG *) 	0xFFF84298) // (CAN1_MB4) MailBox Data High Register
#define AT91C_CAN1_MB4_MID ((AT91_REG *) 	0xFFF84288) // (CAN1_MB4) MailBox ID Register
#define AT91C_CAN1_MB4_MDL ((AT91_REG *) 	0xFFF84294) // (CAN1_MB4) MailBox Data Low Register
#define AT91C_CAN1_MB4_MFID ((AT91_REG *) 	0xFFF8428C) // (CAN1_MB4) MailBox Family ID Register
#define AT91C_CAN1_MB4_MAM ((AT91_REG *) 	0xFFF84284) // (CAN1_MB4) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB4_MSR ((AT91_REG *) 	0xFFF84290) // (CAN1_MB4) MailBox Status Register
#define AT91C_CAN1_MB4_MMR ((AT91_REG *) 	0xFFF84280) // (CAN1_MB4) MailBox Mode Register
// ========== Register definition for CAN1_MB5 peripheral ========== 
#define AT91C_CAN1_MB5_MCR ((AT91_REG *) 	0xFFF842BC) // (CAN1_MB5) MailBox Control Register
#define AT91C_CAN1_MB5_MSR ((AT91_REG *) 	0xFFF842B0) // (CAN1_MB5) MailBox Status Register
#define AT91C_CAN1_MB5_MMR ((AT91_REG *) 	0xFFF842A0) // (CAN1_MB5) MailBox Mode Register
#define AT91C_CAN1_MB5_MDL ((AT91_REG *) 	0xFFF842B4) // (CAN1_MB5) MailBox Data Low Register
#define AT91C_CAN1_MB5_MAM ((AT91_REG *) 	0xFFF842A4) // (CAN1_MB5) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB5_MID ((AT91_REG *) 	0xFFF842A8) // (CAN1_MB5) MailBox ID Register
#define AT91C_CAN1_MB5_MDH ((AT91_REG *) 	0xFFF842B8) // (CAN1_MB5) MailBox Data High Register
#define AT91C_CAN1_MB5_MFID ((AT91_REG *) 	0xFFF842AC) // (CAN1_MB5) MailBox Family ID Register
// ========== Register definition for CAN1_MB6 peripheral ========== 
#define AT91C_CAN1_MB6_MDH ((AT91_REG *) 	0xFFF842D8) // (CAN1_MB6) MailBox Data High Register
#define AT91C_CAN1_MB6_MDL ((AT91_REG *) 	0xFFF842D4) // (CAN1_MB6) MailBox Data Low Register
#define AT91C_CAN1_MB6_MAM ((AT91_REG *) 	0xFFF842C4) // (CAN1_MB6) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB6_MCR ((AT91_REG *) 	0xFFF842DC) // (CAN1_MB6) MailBox Control Register
#define AT91C_CAN1_MB6_MMR ((AT91_REG *) 	0xFFF842C0) // (CAN1_MB6) MailBox Mode Register
#define AT91C_CAN1_MB6_MID ((AT91_REG *) 	0xFFF842C8) // (CAN1_MB6) MailBox ID Register
#define AT91C_CAN1_MB6_MSR ((AT91_REG *) 	0xFFF842D0) // (CAN1_MB6) MailBox Status Register
#define AT91C_CAN1_MB6_MFID ((AT91_REG *) 	0xFFF842CC) // (CAN1_MB6) MailBox Family ID Register
// ========== Register definition for CAN1_MB7 peripheral ========== 
#define AT91C_CAN1_MB7_MDH ((AT91_REG *) 	0xFFF842F8) // (CAN1_MB7) MailBox Data High Register
#define AT91C_CAN1_MB7_MDL ((AT91_REG *) 	0xFFF842F4) // (CAN1_MB7) MailBox Data Low Register
#define AT91C_CAN1_MB7_MID ((AT91_REG *) 	0xFFF842E8) // (CAN1_MB7) MailBox ID Register
#define AT91C_CAN1_MB7_MSR ((AT91_REG *) 	0xFFF842F0) // (CAN1_MB7) MailBox Status Register
#define AT91C_CAN1_MB7_MFID ((AT91_REG *) 	0xFFF842EC) // (CAN1_MB7) MailBox Family ID Register
#define AT91C_CAN1_MB7_MAM ((AT91_REG *) 	0xFFF842E4) // (CAN1_MB7) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB7_MMR ((AT91_REG *) 	0xFFF842E0) // (CAN1_MB7) MailBox Mode Register
#define AT91C_CAN1_MB7_MCR ((AT91_REG *) 	0xFFF842FC) // (CAN1_MB7) MailBox Control Register
// ========== Register definition for CAN1_MB8 peripheral ========== 
#define AT91C_CAN1_MB8_MCR ((AT91_REG *) 	0xFFF8431C) // (CAN1_MB8) MailBox Control Register
#define AT91C_CAN1_MB8_MFID ((AT91_REG *) 	0xFFF8430C) // (CAN1_MB8) MailBox Family ID Register
#define AT91C_CAN1_MB8_MSR ((AT91_REG *) 	0xFFF84310) // (CAN1_MB8) MailBox Status Register
#define AT91C_CAN1_MB8_MAM ((AT91_REG *) 	0xFFF84304) // (CAN1_MB8) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB8_MDL ((AT91_REG *) 	0xFFF84314) // (CAN1_MB8) MailBox Data Low Register
#define AT91C_CAN1_MB8_MID ((AT91_REG *) 	0xFFF84308) // (CAN1_MB8) MailBox ID Register
#define AT91C_CAN1_MB8_MDH ((AT91_REG *) 	0xFFF84318) // (CAN1_MB8) MailBox Data High Register
#define AT91C_CAN1_MB8_MMR ((AT91_REG *) 	0xFFF84300) // (CAN1_MB8) MailBox Mode Register
// ========== Register definition for CAN1_MB9 peripheral ========== 
#define AT91C_CAN1_MB9_MDH ((AT91_REG *) 	0xFFF84338) // (CAN1_MB9) MailBox Data High Register
#define AT91C_CAN1_MB9_MDL ((AT91_REG *) 	0xFFF84334) // (CAN1_MB9) MailBox Data Low Register
#define AT91C_CAN1_MB9_MFID ((AT91_REG *) 	0xFFF8432C) // (CAN1_MB9) MailBox Family ID Register
#define AT91C_CAN1_MB9_MMR ((AT91_REG *) 	0xFFF84320) // (CAN1_MB9) MailBox Mode Register
#define AT91C_CAN1_MB9_MAM ((AT91_REG *) 	0xFFF84324) // (CAN1_MB9) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB9_MID ((AT91_REG *) 	0xFFF84328) // (CAN1_MB9) MailBox ID Register
#define AT91C_CAN1_MB9_MCR ((AT91_REG *) 	0xFFF8433C) // (CAN1_MB9) MailBox Control Register
#define AT91C_CAN1_MB9_MSR ((AT91_REG *) 	0xFFF84330) // (CAN1_MB9) MailBox Status Register
// ========== Register definition for CAN1_MB10 peripheral ========== 
#define AT91C_CAN1_MB10_MFID ((AT91_REG *) 	0xFFF8434C) // (CAN1_MB10) MailBox Family ID Register
#define AT91C_CAN1_MB10_MSR ((AT91_REG *) 	0xFFF84350) // (CAN1_MB10) MailBox Status Register
#define AT91C_CAN1_MB10_MDL ((AT91_REG *) 	0xFFF84354) // (CAN1_MB10) MailBox Data Low Register
#define AT91C_CAN1_MB10_MMR ((AT91_REG *) 	0xFFF84340) // (CAN1_MB10) MailBox Mode Register
#define AT91C_CAN1_MB10_MCR ((AT91_REG *) 	0xFFF8435C) // (CAN1_MB10) MailBox Control Register
#define AT91C_CAN1_MB10_MAM ((AT91_REG *) 	0xFFF84344) // (CAN1_MB10) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB10_MID ((AT91_REG *) 	0xFFF84348) // (CAN1_MB10) MailBox ID Register
#define AT91C_CAN1_MB10_MDH ((AT91_REG *) 	0xFFF84358) // (CAN1_MB10) MailBox Data High Register
// ========== Register definition for CAN1_MB11 peripheral ========== 
#define AT91C_CAN1_MB11_MMR ((AT91_REG *) 	0xFFF84360) // (CAN1_MB11) MailBox Mode Register
#define AT91C_CAN1_MB11_MDL ((AT91_REG *) 	0xFFF84374) // (CAN1_MB11) MailBox Data Low Register
#define AT91C_CAN1_MB11_MAM ((AT91_REG *) 	0xFFF84364) // (CAN1_MB11) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB11_MID ((AT91_REG *) 	0xFFF84368) // (CAN1_MB11) MailBox ID Register
#define AT91C_CAN1_MB11_MCR ((AT91_REG *) 	0xFFF8437C) // (CAN1_MB11) MailBox Control Register
#define AT91C_CAN1_MB11_MDH ((AT91_REG *) 	0xFFF84378) // (CAN1_MB11) MailBox Data High Register
#define AT91C_CAN1_MB11_MSR ((AT91_REG *) 	0xFFF84370) // (CAN1_MB11) MailBox Status Register
#define AT91C_CAN1_MB11_MFID ((AT91_REG *) 	0xFFF8436C) // (CAN1_MB11) MailBox Family ID Register
// ========== Register definition for CAN1_MB12 peripheral ========== 
#define AT91C_CAN1_MB12_MFID ((AT91_REG *) 	0xFFF8438C) // (CAN1_MB12) MailBox Family ID Register
#define AT91C_CAN1_MB12_MAM ((AT91_REG *) 	0xFFF84384) // (CAN1_MB12) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB12_MDH ((AT91_REG *) 	0xFFF84398) // (CAN1_MB12) MailBox Data High Register
#define AT91C_CAN1_MB12_MMR ((AT91_REG *) 	0xFFF84380) // (CAN1_MB12) MailBox Mode Register
#define AT91C_CAN1_MB12_MID ((AT91_REG *) 	0xFFF84388) // (CAN1_MB12) MailBox ID Register
#define AT91C_CAN1_MB12_MCR ((AT91_REG *) 	0xFFF8439C) // (CAN1_MB12) MailBox Control Register
#define AT91C_CAN1_MB12_MDL ((AT91_REG *) 	0xFFF84394) // (CAN1_MB12) MailBox Data Low Register
#define AT91C_CAN1_MB12_MSR ((AT91_REG *) 	0xFFF84390) // (CAN1_MB12) MailBox Status Register
// ========== Register definition for CAN1_MB13 peripheral ========== 
#define AT91C_CAN1_MB13_MDL ((AT91_REG *) 	0xFFF843B4) // (CAN1_MB13) MailBox Data Low Register
#define AT91C_CAN1_MB13_MSR ((AT91_REG *) 	0xFFF843B0) // (CAN1_MB13) MailBox Status Register
#define AT91C_CAN1_MB13_MFID ((AT91_REG *) 	0xFFF843AC) // (CAN1_MB13) MailBox Family ID Register
#define AT91C_CAN1_MB13_MAM ((AT91_REG *) 	0xFFF843A4) // (CAN1_MB13) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB13_MMR ((AT91_REG *) 	0xFFF843A0) // (CAN1_MB13) MailBox Mode Register
#define AT91C_CAN1_MB13_MCR ((AT91_REG *) 	0xFFF843BC) // (CAN1_MB13) MailBox Control Register
#define AT91C_CAN1_MB13_MDH ((AT91_REG *) 	0xFFF843B8) // (CAN1_MB13) MailBox Data High Register
#define AT91C_CAN1_MB13_MID ((AT91_REG *) 	0xFFF843A8) // (CAN1_MB13) MailBox ID Register
// ========== Register definition for CAN1_MB14 peripheral ========== 
#define AT91C_CAN1_MB14_MCR ((AT91_REG *) 	0xFFF843DC) // (CAN1_MB14) MailBox Control Register
#define AT91C_CAN1_MB14_MID ((AT91_REG *) 	0xFFF843C8) // (CAN1_MB14) MailBox ID Register
#define AT91C_CAN1_MB14_MMR ((AT91_REG *) 	0xFFF843C0) // (CAN1_MB14) MailBox Mode Register
#define AT91C_CAN1_MB14_MDH ((AT91_REG *) 	0xFFF843D8) // (CAN1_MB14) MailBox Data High Register
#define AT91C_CAN1_MB14_MSR ((AT91_REG *) 	0xFFF843D0) // (CAN1_MB14) MailBox Status Register
#define AT91C_CAN1_MB14_MFID ((AT91_REG *) 	0xFFF843CC) // (CAN1_MB14) MailBox Family ID Register
#define AT91C_CAN1_MB14_MDL ((AT91_REG *) 	0xFFF843D4) // (CAN1_MB14) MailBox Data Low Register
#define AT91C_CAN1_MB14_MAM ((AT91_REG *) 	0xFFF843C4) // (CAN1_MB14) MailBox Acceptance Mask Register
// ========== Register definition for CAN1_MB15 peripheral ========== 
#define AT91C_CAN1_MB15_MSR ((AT91_REG *) 	0xFFF843F0) // (CAN1_MB15) MailBox Status Register
#define AT91C_CAN1_MB15_MDL ((AT91_REG *) 	0xFFF843F4) // (CAN1_MB15) MailBox Data Low Register
#define AT91C_CAN1_MB15_MDH ((AT91_REG *) 	0xFFF843F8) // (CAN1_MB15) MailBox Data High Register
#define AT91C_CAN1_MB15_MMR ((AT91_REG *) 	0xFFF843E0) // (CAN1_MB15) MailBox Mode Register
#define AT91C_CAN1_MB15_MAM ((AT91_REG *) 	0xFFF843E4) // (CAN1_MB15) MailBox Acceptance Mask Register
#define AT91C_CAN1_MB15_MFID ((AT91_REG *) 	0xFFF843EC) // (CAN1_MB15) MailBox Family ID Register
#define AT91C_CAN1_MB15_MCR ((AT91_REG *) 	0xFFF843FC) // (CAN1_MB15) MailBox Control Register
#define AT91C_CAN1_MB15_MID ((AT91_REG *) 	0xFFF843E8) // (CAN1_MB15) MailBox ID Register
// ========== Register definition for CAN1 peripheral ========== 
#define AT91C_CAN1_ECR  ((AT91_REG *) 	0xFFF84020) // (CAN1) Error Counter Register
#define AT91C_CAN1_BR   ((AT91_REG *) 	0xFFF84014) // (CAN1) Baudrate Register
#define AT91C_CAN1_IDR  ((AT91_REG *) 	0xFFF84008) // (CAN1) Interrupt Disable Register
#define AT91C_CAN1_ACR  ((AT91_REG *) 	0xFFF84028) // (CAN1) Abort Command Register
#define AT91C_CAN1_IMR  ((AT91_REG *) 	0xFFF8400C) // (CAN1) Interrupt Mask Register
#define AT91C_CAN1_TCR  ((AT91_REG *) 	0xFFF84024) // (CAN1) Transfer Command Register
#define AT91C_CAN1_SR   ((AT91_REG *) 	0xFFF84010) // (CAN1) Status Register
#define AT91C_CAN1_TIM  ((AT91_REG *) 	0xFFF84018) // (CAN1) Timer Register
#define AT91C_CAN1_VR   ((AT91_REG *) 	0xFFF840FC) // (CAN1) Version Register
#define AT91C_CAN1_MR   ((AT91_REG *) 	0xFFF84000) // (CAN1) Mode Register
#define AT91C_CAN1_IER  ((AT91_REG *) 	0xFFF84004) // (CAN1) Interrupt Enable Register
#define AT91C_CAN1_TIMESTP ((AT91_REG *) 	0xFFF8401C) // (CAN1) Time Stamp Register
// ========== Register definition for TC0 peripheral ========== 
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFFA0020) // (TC0) Status Register
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFFA001C) // (TC0) Register C
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFFA0018) // (TC0) Register B
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFFA0000) // (TC0) Channel Control Register
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFFA0004) // (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFFA0024) // (TC0) Interrupt Enable Register
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFFA0014) // (TC0) Register A
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFFA0028) // (TC0) Interrupt Disable Register
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFFA0010) // (TC0) Counter Value
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFFA002C) // (TC0) Interrupt Mask Register
// ========== Register definition for TC1 peripheral ========== 
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFFA0058) // (TC1) Register B
