tsugli/stm32/common/rtos/portable/GCC/AT91SAM7A3/ioat91sam7a3.h
#define AT91C_PWMC_SR   ((AT91_REG *) 	0xFFFCC00C) // (PWMC) PWMC Status Register
#define AT91C_PWMC_IMR  ((AT91_REG *) 	0xFFFCC018) // (PWMC) PWMC Interrupt Mask Register
#define AT91C_PWMC_MR   ((AT91_REG *) 	0xFFFCC000) // (PWMC) PWMC Mode Register
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0xFFFCC004) // (PWMC) PWMC Enable Register
// ========== Register definition for PDC_SSC0 peripheral ========== 
#define AT91C_SSC0_RNPR ((AT91_REG *) 	0xFFFD0110) // (PDC_SSC0) Receive Next Pointer Register
#define AT91C_SSC0_RNCR ((AT91_REG *) 	0xFFFD0114) // (PDC_SSC0) Receive Next Counter Register
#define AT91C_SSC0_PTSR ((AT91_REG *) 	0xFFFD0124) // (PDC_SSC0) PDC Transfer Status Register
#define AT91C_SSC0_PTCR ((AT91_REG *) 	0xFFFD0120) // (PDC_SSC0) PDC Transfer Control Register
#define AT91C_SSC0_TCR  ((AT91_REG *) 	0xFFFD010C) // (PDC_SSC0) Transmit Counter Register
#define AT91C_SSC0_TNPR ((AT91_REG *) 	0xFFFD0118) // (PDC_SSC0) Transmit Next Pointer Register
#define AT91C_SSC0_RCR  ((AT91_REG *) 	0xFFFD0104) // (PDC_SSC0) Receive Counter Register
#define AT91C_SSC0_TPR  ((AT91_REG *) 	0xFFFD0108) // (PDC_SSC0) Transmit Pointer Register
#define AT91C_SSC0_TNCR ((AT91_REG *) 	0xFFFD011C) // (PDC_SSC0) Transmit Next Counter Register
#define AT91C_SSC0_RPR  ((AT91_REG *) 	0xFFFD0100) // (PDC_SSC0) Receive Pointer Register
// ========== Register definition for SSC0 peripheral ========== 
#define AT91C_SSC0_IER  ((AT91_REG *) 	0xFFFD0044) // (SSC0) Interrupt Enable Register
#define AT91C_SSC0_THR  ((AT91_REG *) 	0xFFFD0024) // (SSC0) Transmit Holding Register
#define AT91C_SSC0_IDR  ((AT91_REG *) 	0xFFFD0048) // (SSC0) Interrupt Disable Register
#define AT91C_SSC0_CMR  ((AT91_REG *) 	0xFFFD0004) // (SSC0) Clock Mode Register
#define AT91C_SSC0_SR   ((AT91_REG *) 	0xFFFD0040) // (SSC0) Status Register
#define AT91C_SSC0_RHR  ((AT91_REG *) 	0xFFFD0020) // (SSC0) Receive Holding Register
#define AT91C_SSC0_TFMR ((AT91_REG *) 	0xFFFD001C) // (SSC0) Transmit Frame Mode Register
#define AT91C_SSC0_CR   ((AT91_REG *) 	0xFFFD0000) // (SSC0) Control Register
#define AT91C_SSC0_IMR  ((AT91_REG *) 	0xFFFD004C) // (SSC0) Interrupt Mask Register
#define AT91C_SSC0_TCMR ((AT91_REG *) 	0xFFFD0018) // (SSC0) Transmit Clock Mode Register
#define AT91C_SSC0_RCMR ((AT91_REG *) 	0xFFFD0010) // (SSC0) Receive Clock ModeRegister
#define AT91C_SSC0_RSHR ((AT91_REG *) 	0xFFFD0030) // (SSC0) Receive Sync Holding Register
#define AT91C_SSC0_TSHR ((AT91_REG *) 	0xFFFD0034) // (SSC0) Transmit Sync Holding Register
#define AT91C_SSC0_RFMR ((AT91_REG *) 	0xFFFD0014) // (SSC0) Receive Frame Mode Register
// ========== Register definition for PDC_SSC1 peripheral ========== 
#define AT91C_SSC1_TNCR ((AT91_REG *) 	0xFFFD411C) // (PDC_SSC1) Transmit Next Counter Register
#define AT91C_SSC1_RPR  ((AT91_REG *) 	0xFFFD4100) // (PDC_SSC1) Receive Pointer Register
#define AT91C_SSC1_RNCR ((AT91_REG *) 	0xFFFD4114) // (PDC_SSC1) Receive Next Counter Register
#define AT91C_SSC1_TPR  ((AT91_REG *) 	0xFFFD4108) // (PDC_SSC1) Transmit Pointer Register
#define AT91C_SSC1_PTCR ((AT91_REG *) 	0xFFFD4120) // (PDC_SSC1) PDC Transfer Control Register
#define AT91C_SSC1_TCR  ((AT91_REG *) 	0xFFFD410C) // (PDC_SSC1) Transmit Counter Register
#define AT91C_SSC1_RCR  ((AT91_REG *) 	0xFFFD4104) // (PDC_SSC1) Receive Counter Register
#define AT91C_SSC1_RNPR ((AT91_REG *) 	0xFFFD4110) // (PDC_SSC1) Receive Next Pointer Register
#define AT91C_SSC1_TNPR ((AT91_REG *) 	0xFFFD4118) // (PDC_SSC1) Transmit Next Pointer Register
#define AT91C_SSC1_PTSR ((AT91_REG *) 	0xFFFD4124) // (PDC_SSC1) PDC Transfer Status Register
// ========== Register definition for SSC1 peripheral ========== 
#define AT91C_SSC1_RHR  ((AT91_REG *) 	0xFFFD4020) // (SSC1) Receive Holding Register
#define AT91C_SSC1_RSHR ((AT91_REG *) 	0xFFFD4030) // (SSC1) Receive Sync Holding Register
#define AT91C_SSC1_TFMR ((AT91_REG *) 	0xFFFD401C) // (SSC1) Transmit Frame Mode Register
#define AT91C_SSC1_IDR  ((AT91_REG *) 	0xFFFD4048) // (SSC1) Interrupt Disable Register
#define AT91C_SSC1_THR  ((AT91_REG *) 	0xFFFD4024) // (SSC1) Transmit Holding Register
#define AT91C_SSC1_RCMR ((AT91_REG *) 	0xFFFD4010) // (SSC1) Receive Clock ModeRegister
#define AT91C_SSC1_IER  ((AT91_REG *) 	0xFFFD4044) // (SSC1) Interrupt Enable Register
#define AT91C_SSC1_TSHR ((AT91_REG *) 	0xFFFD4034) // (SSC1) Transmit Sync Holding Register
#define AT91C_SSC1_SR   ((AT91_REG *) 	0xFFFD4040) // (SSC1) Status Register
#define AT91C_SSC1_CMR  ((AT91_REG *) 	0xFFFD4004) // (SSC1) Clock Mode Register
#define AT91C_SSC1_TCMR ((AT91_REG *) 	0xFFFD4018) // (SSC1) Transmit Clock Mode Register
#define AT91C_SSC1_CR   ((AT91_REG *) 	0xFFFD4000) // (SSC1) Control Register
#define AT91C_SSC1_IMR  ((AT91_REG *) 	0xFFFD404C) // (SSC1) Interrupt Mask Register
#define AT91C_SSC1_RFMR ((AT91_REG *) 	0xFFFD4014) // (SSC1) Receive Frame Mode Register
// ========== Register definition for PDC_ADC0 peripheral ========== 
#define AT91C_ADC0_PTSR ((AT91_REG *) 	0xFFFD8124) // (PDC_ADC0) PDC Transfer Status Register
#define AT91C_ADC0_PTCR ((AT91_REG *) 	0xFFFD8120) // (PDC_ADC0) PDC Transfer Control Register
#define AT91C_ADC0_TNPR ((AT91_REG *) 	0xFFFD8118) // (PDC_ADC0) Transmit Next Pointer Register
#define AT91C_ADC0_TNCR ((AT91_REG *) 	0xFFFD811C) // (PDC_ADC0) Transmit Next Counter Register
#define AT91C_ADC0_RNPR ((AT91_REG *) 	0xFFFD8110) // (PDC_ADC0) Receive Next Pointer Register
#define AT91C_ADC0_RNCR ((AT91_REG *) 	0xFFFD8114) // (PDC_ADC0) Receive Next Counter Register
#define AT91C_ADC0_RPR  ((AT91_REG *) 	0xFFFD8100) // (PDC_ADC0) Receive Pointer Register
#define AT91C_ADC0_TCR  ((AT91_REG *) 	0xFFFD810C) // (PDC_ADC0) Transmit Counter Register
#define AT91C_ADC0_TPR  ((AT91_REG *) 	0xFFFD8108) // (PDC_ADC0) Transmit Pointer Register
#define AT91C_ADC0_RCR  ((AT91_REG *) 	0xFFFD8104) // (PDC_ADC0) Receive Counter Register
// ========== Register definition for ADC0 peripheral ========== 
#define AT91C_ADC0_CDR2 ((AT91_REG *) 	0xFFFD8038) // (ADC0) ADC Channel Data Register 2
#define AT91C_ADC0_CDR3 ((AT91_REG *) 	0xFFFD803C) // (ADC0) ADC Channel Data Register 3
#define AT91C_ADC0_CDR0 ((AT91_REG *) 	0xFFFD8030) // (ADC0) ADC Channel Data Register 0
#define AT91C_ADC0_CDR5 ((AT91_REG *) 	0xFFFD8044) // (ADC0) ADC Channel Data Register 5
#define AT91C_ADC0_CHDR ((AT91_REG *) 	0xFFFD8014) // (ADC0) ADC Channel Disable Register
#define AT91C_ADC0_SR   ((AT91_REG *) 	0xFFFD801C) // (ADC0) ADC Status Register
#define AT91C_ADC0_CDR4 ((AT91_REG *) 	0xFFFD8040) // (ADC0) ADC Channel Data Register 4
#define AT91C_ADC0_CDR1 ((AT91_REG *) 	0xFFFD8034) // (ADC0) ADC Channel Data Register 1
#define AT91C_ADC0_LCDR ((AT91_REG *) 	0xFFFD8020) // (ADC0) ADC Last Converted Data Register
#define AT91C_ADC0_IDR  ((AT91_REG *) 	0xFFFD8028) // (ADC0) ADC Interrupt Disable Register
#define AT91C_ADC0_CR   ((AT91_REG *) 	0xFFFD8000) // (ADC0) ADC Control Register
#define AT91C_ADC0_CDR7 ((AT91_REG *) 	0xFFFD804C) // (ADC0) ADC Channel Data Register 7
#define AT91C_ADC0_CDR6 ((AT91_REG *) 	0xFFFD8048) // (ADC0) ADC Channel Data Register 6
#define AT91C_ADC0_IER  ((AT91_REG *) 	0xFFFD8024) // (ADC0) ADC Interrupt Enable Register
#define AT91C_ADC0_CHER ((AT91_REG *) 	0xFFFD8010) // (ADC0) ADC Channel Enable Register
#define AT91C_ADC0_CHSR ((AT91_REG *) 	0xFFFD8018) // (ADC0) ADC Channel Status Register
#define AT91C_ADC0_MR   ((AT91_REG *) 	0xFFFD8004) // (ADC0) ADC Mode Register
#define AT91C_ADC0_IMR  ((AT91_REG *) 	0xFFFD802C) // (ADC0) ADC Interrupt Mask Register
// ========== Register definition for PDC_ADC1 peripheral ========== 
#define AT91C_ADC1_RCR  ((AT91_REG *) 	0xFFFDC104) // (PDC_ADC1) Receive Counter Register
#define AT91C_ADC1_TPR  ((AT91_REG *) 	0xFFFDC108) // (PDC_ADC1) Transmit Pointer Register
#define AT91C_ADC1_TNPR ((AT91_REG *) 	0xFFFDC118) // (PDC_ADC1) Transmit Next Pointer Register
#define AT91C_ADC1_RNCR ((AT91_REG *) 	0xFFFDC114) // (PDC_ADC1) Receive Next Counter Register
#define AT91C_ADC1_PTSR ((AT91_REG *) 	0xFFFDC124) // (PDC_ADC1) PDC Transfer Status Register
#define AT91C_ADC1_PTCR ((AT91_REG *) 	0xFFFDC120) // (PDC_ADC1) PDC Transfer Control Register
#define AT91C_ADC1_RNPR ((AT91_REG *) 	0xFFFDC110) // (PDC_ADC1) Receive Next Pointer Register
#define AT91C_ADC1_TNCR ((AT91_REG *) 	0xFFFDC11C) // (PDC_ADC1) Transmit Next Counter Register
#define AT91C_ADC1_TCR  ((AT91_REG *) 	0xFFFDC10C) // (PDC_ADC1) Transmit Counter Register
#define AT91C_ADC1_RPR  ((AT91_REG *) 	0xFFFDC100) // (PDC_ADC1) Receive Pointer Register
// ========== Register definition for ADC1 peripheral ========== 
#define AT91C_ADC1_IER  ((AT91_REG *) 	0xFFFDC024) // (ADC1) ADC Interrupt Enable Register
#define AT91C_ADC1_CHSR ((AT91_REG *) 	0xFFFDC018) // (ADC1) ADC Channel Status Register
#define AT91C_ADC1_MR   ((AT91_REG *) 	0xFFFDC004) // (ADC1) ADC Mode Register
#define AT91C_ADC1_CR   ((AT91_REG *) 	0xFFFDC000) // (ADC1) ADC Control Register
#define AT91C_ADC1_LCDR ((AT91_REG *) 	0xFFFDC020) // (ADC1) ADC Last Converted Data Register
#define AT91C_ADC1_CHER ((AT91_REG *) 	0xFFFDC010) // (ADC1) ADC Channel Enable Register
#define AT91C_ADC1_CHDR ((AT91_REG *) 	0xFFFDC014) // (ADC1) ADC Channel Disable Register
#define AT91C_ADC1_IMR  ((AT91_REG *) 	0xFFFDC02C) // (ADC1) ADC Interrupt Mask Register
#define AT91C_ADC1_CDR1 ((AT91_REG *) 	0xFFFDC034) // (ADC1) ADC Channel Data Register 1
#define AT91C_ADC1_CDR4 ((AT91_REG *) 	0xFFFDC040) // (ADC1) ADC Channel Data Register 4
#define AT91C_ADC1_CDR0 ((AT91_REG *) 	0xFFFDC030) // (ADC1) ADC Channel Data Register 0
#define AT91C_ADC1_CDR5 ((AT91_REG *) 	0xFFFDC044) // (ADC1) ADC Channel Data Register 5
#define AT91C_ADC1_CDR3 ((AT91_REG *) 	0xFFFDC03C) // (ADC1) ADC Channel Data Register 3
#define AT91C_ADC1_CDR6 ((AT91_REG *) 	0xFFFDC048) // (ADC1) ADC Channel Data Register 6
#define AT91C_ADC1_SR   ((AT91_REG *) 	0xFFFDC01C) // (ADC1) ADC Status Register
#define AT91C_ADC1_CDR2 ((AT91_REG *) 	0xFFFDC038) // (ADC1) ADC Channel Data Register 2
#define AT91C_ADC1_CDR7 ((AT91_REG *) 	0xFFFDC04C) // (ADC1) ADC Channel Data Register 7
#define AT91C_ADC1_IDR  ((AT91_REG *) 	0xFFFDC028) // (ADC1) ADC Interrupt Disable Register
// ========== Register definition for PDC_SPI0 peripheral ========== 
#define AT91C_SPI0_PTCR ((AT91_REG *) 	0xFFFE0120) // (PDC_SPI0) PDC Transfer Control Register
#define AT91C_SPI0_TPR  ((AT91_REG *) 	0xFFFE0108) // (PDC_SPI0) Transmit Pointer Register
#define AT91C_SPI0_TCR  ((AT91_REG *) 	0xFFFE010C) // (PDC_SPI0) Transmit Counter Register
#define AT91C_SPI0_RCR  ((AT91_REG *) 	0xFFFE0104) // (PDC_SPI0) Receive Counter Register
#define AT91C_SPI0_PTSR ((AT91_REG *) 	0xFFFE0124) // (PDC_SPI0) PDC Transfer Status Register
#define AT91C_SPI0_RNPR ((AT91_REG *) 	0xFFFE0110) // (PDC_SPI0) Receive Next Pointer Register
#define AT91C_SPI0_RPR  ((AT91_REG *) 	0xFFFE0100) // (PDC_SPI0) Receive Pointer Register
#define AT91C_SPI0_TNCR ((AT91_REG *) 	0xFFFE011C) // (PDC_SPI0) Transmit Next Counter Register
#define AT91C_SPI0_RNCR ((AT91_REG *) 	0xFFFE0114) // (PDC_SPI0) Receive Next Counter Register
#define AT91C_SPI0_TNPR ((AT91_REG *) 	0xFFFE0118) // (PDC_SPI0) Transmit Next Pointer Register
// ========== Register definition for SPI0 peripheral ========== 
#define AT91C_SPI0_IER  ((AT91_REG *) 	0xFFFE0014) // (SPI0) Interrupt Enable Register
#define AT91C_SPI0_SR   ((AT91_REG *) 	0xFFFE0010) // (SPI0) Status Register
#define AT91C_SPI0_IDR  ((AT91_REG *) 	0xFFFE0018) // (SPI0) Interrupt Disable Register
#define AT91C_SPI0_CR   ((AT91_REG *) 	0xFFFE0000) // (SPI0) Control Register
#define AT91C_SPI0_MR   ((AT91_REG *) 	0xFFFE0004) // (SPI0) Mode Register
#define AT91C_SPI0_IMR  ((AT91_REG *) 	0xFFFE001C) // (SPI0) Interrupt Mask Register
#define AT91C_SPI0_TDR  ((AT91_REG *) 	0xFFFE000C) // (SPI0) Transmit Data Register
#define AT91C_SPI0_RDR  ((AT91_REG *) 	0xFFFE0008) // (SPI0) Receive Data Register
#define AT91C_SPI0_CSR  ((AT91_REG *) 	0xFFFE0030) // (SPI0) Chip Select Register
// ========== Register definition for PDC_SPI1 peripheral ========== 
#define AT91C_SPI1_PTCR ((AT91_REG *) 	0xFFFE4120) // (PDC_SPI1) PDC Transfer Control Register
#define AT91C_SPI1_RPR  ((AT91_REG *) 	0xFFFE4100) // (PDC_SPI1) Receive Pointer Register
#define AT91C_SPI1_TNCR ((AT91_REG *) 	0xFFFE411C) // (PDC_SPI1) Transmit Next Counter Register
#define AT91C_SPI1_TPR  ((AT91_REG *) 	0xFFFE4108) // (PDC_SPI1) Transmit Pointer Register
#define AT91C_SPI1_TNPR ((AT91_REG *) 	0xFFFE4118) // (PDC_SPI1) Transmit Next Pointer Register
#define AT91C_SPI1_TCR  ((AT91_REG *) 	0xFFFE410C) // (PDC_SPI1) Transmit Counter Register
#define AT91C_SPI1_RCR  ((AT91_REG *) 	0xFFFE4104) // (PDC_SPI1) Receive Counter Register
#define AT91C_SPI1_RNPR ((AT91_REG *) 	0xFFFE4110) // (PDC_SPI1) Receive Next Pointer Register
#define AT91C_SPI1_RNCR ((AT91_REG *) 	0xFFFE4114) // (PDC_SPI1) Receive Next Counter Register
#define AT91C_SPI1_PTSR ((AT91_REG *) 	0xFFFE4124) // (PDC_SPI1) PDC Transfer Status Register
// ========== Register definition for SPI1 peripheral ========== 
#define AT91C_SPI1_IMR  ((AT91_REG *) 	0xFFFE401C) // (SPI1) Interrupt Mask Register
#define AT91C_SPI1_IER  ((AT91_REG *) 	0xFFFE4014) // (SPI1) Interrupt Enable Register
#define AT91C_SPI1_MR   ((AT91_REG *) 	0xFFFE4004) // (SPI1) Mode Register
#define AT91C_SPI1_RDR  ((AT91_REG *) 	0xFFFE4008) // (SPI1) Receive Data Register
#define AT91C_SPI1_IDR  ((AT91_REG *) 	0xFFFE4018) // (SPI1) Interrupt Disable Register
#define AT91C_SPI1_SR   ((AT91_REG *) 	0xFFFE4010) // (SPI1) Status Register
#define AT91C_SPI1_TDR  ((AT91_REG *) 	0xFFFE400C) // (SPI1) Transmit Data Register
#define AT91C_SPI1_CR   ((AT91_REG *) 	0xFFFE4000) // (SPI1) Control Register
#define AT91C_SPI1_CSR  ((AT91_REG *) 	0xFFFE4030) // (SPI1) Chip Select Register

