tsugli/stm32/common/rtos/portable/GCC/AT91SAM7A3/ioat91sam7a3.h
// *****************************************************************************
//               PIO DEFINITIONS FOR AT91SAM7A3
// *****************************************************************************
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) // Pin Controlled by PA0
#define AT91C_PA0_TWD      ((unsigned int) AT91C_PIO_PA0) //  TWI Two-wire Serial Data
#define AT91C_PA0_ADTRG0   ((unsigned int) AT91C_PIO_PA0) //  ADC0 External Trigger
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) // Pin Controlled by PA1
#define AT91C_PA1_TWCK     ((unsigned int) AT91C_PIO_PA1) //  TWI Two-wire Serial Clock
#define AT91C_PA1_ADTRG1   ((unsigned int) AT91C_PIO_PA1) //  ADC1 External Trigger
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) // Pin Controlled by PA10
#define AT91C_PA10_TXD2     ((unsigned int) AT91C_PIO_PA10) //  USART 2 Transmit Data
#define AT91C_PA10_SPCK1    ((unsigned int) AT91C_PIO_PA10) //  SPI1 Serial Clock
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) // Pin Controlled by PA11
#define AT91C_PA11_NPCS00   ((unsigned int) AT91C_PIO_PA11) //  SPI0 Peripheral Chip Select 0
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) // Pin Controlled by PA12
#define AT91C_PA12_NPCS01   ((unsigned int) AT91C_PIO_PA12) //  SPI0 Peripheral Chip Select 1
#define AT91C_PA12_MCDA1    ((unsigned int) AT91C_PIO_PA12) //  Multimedia Card A Data 1
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) // Pin Controlled by PA13
#define AT91C_PA13_NPCS02   ((unsigned int) AT91C_PIO_PA13) //  SPI0 Peripheral Chip Select 2
#define AT91C_PA13_MCDA2    ((unsigned int) AT91C_PIO_PA13) //  Multimedia Card A Data 2
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) // Pin Controlled by PA14
#define AT91C_PA14_NPCS03   ((unsigned int) AT91C_PIO_PA14) //  SPI0 Peripheral Chip Select 3
#define AT91C_PA14_MCDA3    ((unsigned int) AT91C_PIO_PA14) //  Multimedia Card A Data 3
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) // Pin Controlled by PA15
#define AT91C_PA15_MISO0    ((unsigned int) AT91C_PIO_PA15) //  SPI0 Master In Slave
#define AT91C_PA15_MCDA0    ((unsigned int) AT91C_PIO_PA15) //  Multimedia Card A Data 0
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) // Pin Controlled by PA16
#define AT91C_PA16_MOSI0    ((unsigned int) AT91C_PIO_PA16) //  SPI0 Master Out Slave
#define AT91C_PA16_MCCDA    ((unsigned int) AT91C_PIO_PA16) //  Multimedia Card A Command
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) // Pin Controlled by PA17
#define AT91C_PA17_SPCK0    ((unsigned int) AT91C_PIO_PA17) //  SPI0 Serial Clock
#define AT91C_PA17_MCCK     ((unsigned int) AT91C_PIO_PA17) //  Multimedia Card Clock
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) // Pin Controlled by PA18
#define AT91C_PA18_PWM0     ((unsigned int) AT91C_PIO_PA18) //  PWMC Channel 0
#define AT91C_PA18_PCK0     ((unsigned int) AT91C_PIO_PA18) //  PMC Programmable Clock Output 0
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) // Pin Controlled by PA19
#define AT91C_PA19_PWM1     ((unsigned int) AT91C_PIO_PA19) //  PWMC Channel 1
#define AT91C_PA19_PCK1     ((unsigned int) AT91C_PIO_PA19) //  PMC Programmable Clock Output 1
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) // Pin Controlled by PA2
#define AT91C_PA2_RXD0     ((unsigned int) AT91C_PIO_PA2) //  USART 0 Receive Data
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) // Pin Controlled by PA20
#define AT91C_PA20_PWM2     ((unsigned int) AT91C_PIO_PA20) //  PWMC Channel 2
#define AT91C_PA20_PCK2     ((unsigned int) AT91C_PIO_PA20) //  PMC Programmable Clock Output 2
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) // Pin Controlled by PA21
#define AT91C_PA21_PWM3     ((unsigned int) AT91C_PIO_PA21) //  PWMC Channel 3
#define AT91C_PA21_PCK3     ((unsigned int) AT91C_PIO_PA21) //  PMC Programmable Clock Output 3
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) // Pin Controlled by PA22
#define AT91C_PA22_PWM4     ((unsigned int) AT91C_PIO_PA22) //  PWMC Channel 4
#define AT91C_PA22_IRQ0     ((unsigned int) AT91C_PIO_PA22) //  Interrupt input 0
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) // Pin Controlled by PA23
#define AT91C_PA23_PWM5     ((unsigned int) AT91C_PIO_PA23) //  PWMC Channel 5
#define AT91C_PA23_IRQ1     ((unsigned int) AT91C_PIO_PA23) //  Interrupt input 1
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) // Pin Controlled by PA24
#define AT91C_PA24_PWM6     ((unsigned int) AT91C_PIO_PA24) //  PWMC Channel 6
#define AT91C_PA24_TCLK4    ((unsigned int) AT91C_PIO_PA24) //  Timer Counter 4 external Clock Input
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) // Pin Controlled by PA25
#define AT91C_PA25_PWM7     ((unsigned int) AT91C_PIO_PA25) //  PWMC Channel 7
#define AT91C_PA25_TCLK5    ((unsigned int) AT91C_PIO_PA25) //  Timer Counter 5 external Clock Input
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) // Pin Controlled by PA26
#define AT91C_PA26_CANRX0   ((unsigned int) AT91C_PIO_PA26) //  CAN Receive 0
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) // Pin Controlled by PA27
#define AT91C_PA27_CANTX0   ((unsigned int) AT91C_PIO_PA27) //  CAN Transmit 0
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) // Pin Controlled by PA28
#define AT91C_PA28_CANRX1   ((unsigned int) AT91C_PIO_PA28) //  CAN Receive 1
#define AT91C_PA28_TCLK3    ((unsigned int) AT91C_PIO_PA28) //  Timer Counter 3 external Clock Input
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) // Pin Controlled by PA29
#define AT91C_PA29_CANTX1   ((unsigned int) AT91C_PIO_PA29) //  CAN Transmit 1
#define AT91C_PA29_TCLK6    ((unsigned int) AT91C_PIO_PA29) //  Timer Counter 6 external clock input
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) // Pin Controlled by PA3
#define AT91C_PA3_TXD0     ((unsigned int) AT91C_PIO_PA3) //  USART 0 Transmit Data
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) // Pin Controlled by PA30
#define AT91C_PA30_DRXD     ((unsigned int) AT91C_PIO_PA30) //  DBGU Debug Receive Data
#define AT91C_PA30_TCLK7    ((unsigned int) AT91C_PIO_PA30) //  Timer Counter 7 external clock input
#define AT91C_PIO_PA31       ((unsigned int) 1 << 31) // Pin Controlled by PA31
#define AT91C_PA31_DTXD     ((unsigned int) AT91C_PIO_PA31) //  DBGU Debug Transmit Data
#define AT91C_PA31_TCLK8    ((unsigned int) AT91C_PIO_PA31) //  Timer Counter 8 external clock input
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) // Pin Controlled by PA4
#define AT91C_PA4_SCK0     ((unsigned int) AT91C_PIO_PA4) //  USART 0 Serial Clock
#define AT91C_PA4_NPCS10   ((unsigned int) AT91C_PIO_PA4) //  SPI1 Peripheral Chip Select 0
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) // Pin Controlled by PA5
#define AT91C_PA5_RTS0     ((unsigned int) AT91C_PIO_PA5) //  USART 0 Ready To Send
#define AT91C_PA5_NPCS11   ((unsigned int) AT91C_PIO_PA5) //  SPI1 Peripheral Chip Select 1
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) // Pin Controlled by PA6
#define AT91C_PA6_CTS0     ((unsigned int) AT91C_PIO_PA6) //  USART 0 Clear To Send
#define AT91C_PA6_NPCS12   ((unsigned int) AT91C_PIO_PA6) //  SPI1 Peripheral Chip Select 2
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) // Pin Controlled by PA7
#define AT91C_PA7_RXD1     ((unsigned int) AT91C_PIO_PA7) //  USART 1 Receive Data
#define AT91C_PA7_NPCS13   ((unsigned int) AT91C_PIO_PA7) //  SPI1 Peripheral Chip Select 3
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) // Pin Controlled by PA8
#define AT91C_PA8_TXD1     ((unsigned int) AT91C_PIO_PA8) //  USART 1 Transmit Data
#define AT91C_PA8_MISO1    ((unsigned int) AT91C_PIO_PA8) //  SPI1 Master In Slave
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) // Pin Controlled by PA9
#define AT91C_PA9_RXD2     ((unsigned int) AT91C_PIO_PA9) //  USART 2 Receive Data
#define AT91C_PA9_MOSI1    ((unsigned int) AT91C_PIO_PA9) //  SPI1 Master Out Slave
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) // Pin Controlled by PB0
#define AT91C_PB0_IRQ2     ((unsigned int) AT91C_PIO_PB0) //  Interrupt input 2
#define AT91C_PB0_PWM5     ((unsigned int) AT91C_PIO_PB0) //  PWMC Channel 5
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) // Pin Controlled by PB1
#define AT91C_PB1_IRQ3     ((unsigned int) AT91C_PIO_PB1) //  Interrupt input 3
#define AT91C_PB1_PWM6     ((unsigned int) AT91C_PIO_PB1) //  PWMC Channel 6
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) // Pin Controlled by PB10
#define AT91C_PB10_TCLK1    ((unsigned int) AT91C_PIO_PB10) //  Timer Counter 1 external clock input
#define AT91C_PB10_RK1      ((unsigned int) AT91C_PIO_PB10) //  SSC Receive Clock 1
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) // Pin Controlled by PB11
#define AT91C_PB11_TCLK2    ((unsigned int) AT91C_PIO_PB11) //  Timer Counter 2 external clock input
#define AT91C_PB11_RF1      ((unsigned int) AT91C_PIO_PB11) //  SSC Receive Frame Sync 1
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) // Pin Controlled by PB12
#define AT91C_PB12_TIOA0    ((unsigned int) AT91C_PIO_PB12) //  Timer Counter 0 Multipurpose Timer I/O Pin A
#define AT91C_PB12_TD1      ((unsigned int) AT91C_PIO_PB12) //  SSC Transmit Data 1
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) // Pin Controlled by PB13
#define AT91C_PB13_TIOB0    ((unsigned int) AT91C_PIO_PB13) //  Timer Counter 0 Multipurpose Timer I/O Pin B
#define AT91C_PB13_RD1      ((unsigned int) AT91C_PIO_PB13) //  SSC Receive Data 1
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) // Pin Controlled by PB14
#define AT91C_PB14_TIOA1    ((unsigned int) AT91C_PIO_PB14) //  Timer Counter 1 Multipurpose Timer I/O Pin A
#define AT91C_PB14_PWM0     ((unsigned int) AT91C_PIO_PB14) //  PWMC Channel 0
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) // Pin Controlled by PB15
#define AT91C_PB15_TIOB1    ((unsigned int) AT91C_PIO_PB15) //  Timer Counter 1 Multipurpose Timer I/O Pin B
#define AT91C_PB15_PWM1     ((unsigned int) AT91C_PIO_PB15) //  PWMC Channel 1
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) // Pin Controlled by PB16
#define AT91C_PB16_TIOA2    ((unsigned int) AT91C_PIO_PB16) //  Timer Counter 2 Multipurpose Timer I/O Pin A
#define AT91C_PB16_PWM2     ((unsigned int) AT91C_PIO_PB16) //  PWMC Channel 2
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) // Pin Controlled by PB17
#define AT91C_PB17_TIOB2    ((unsigned int) AT91C_PIO_PB17) //  Timer Counter 2 Multipurpose Timer I/O Pin B
#define AT91C_PB17_PWM3     ((unsigned int) AT91C_PIO_PB17) //  PWMC Channel 3
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) // Pin Controlled by PB18
#define AT91C_PB18_TIOA3    ((unsigned int) AT91C_PIO_PB18) //  Timer Counter 3 Multipurpose Timer I/O Pin A
#define AT91C_PB18_PWM4     ((unsigned int) AT91C_PIO_PB18) //  PWMC Channel 4
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) // Pin Controlled by PB19
#define AT91C_PB19_TIOB3    ((unsigned int) AT91C_PIO_PB19) //  Timer Counter 3 Multipurpose Timer I/O Pin B
#define AT91C_PB19_NPCS11   ((unsigned int) AT91C_PIO_PB19) //  SPI1 Peripheral Chip Select 1
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) // Pin Controlled by PB2
#define AT91C_PB2_TF0      ((unsigned int) AT91C_PIO_PB2) //  SSC Transmit Frame Sync 0
#define AT91C_PB2_PWM7     ((unsigned int) AT91C_PIO_PB2) //  PWMC Channel 7
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) // Pin Controlled by PB20
#define AT91C_PB20_TIOA4    ((unsigned int) AT91C_PIO_PB20) //  Timer Counter 4 Multipurpose Timer I/O Pin A
#define AT91C_PB20_NPCS12   ((unsigned int) AT91C_PIO_PB20) //  SPI1 Peripheral Chip Select 2
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) // Pin Controlled by PB21
#define AT91C_PB21_TIOB4    ((unsigned int) AT91C_PIO_PB21) //  Timer Counter 4 Multipurpose Timer I/O Pin B
#define AT91C_PB21_NPCS13   ((unsigned int) AT91C_PIO_PB21) //  SPI1 Peripheral Chip Select 3
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) // Pin Controlled by PB22
#define AT91C_PB22_TIOA5    ((unsigned int) AT91C_PIO_PB22) //  Timer Counter 5 Multipurpose Timer I/O Pin A
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) // Pin Controlled by PB23
#define AT91C_PB23_TIOB5    ((unsigned int) AT91C_PIO_PB23) //  Timer Counter 5 Multipurpose Timer I/O Pin B
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) // Pin Controlled by PB24
#define AT91C_PB24_TIOA6    ((unsigned int) AT91C_PIO_PB24) //  Timer Counter 6 Multipurpose Timer I/O Pin A
#define AT91C_PB24_RTS1     ((unsigned int) AT91C_PIO_PB24) //  USART 1 Ready To Send
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) // Pin Controlled by PB25
#define AT91C_PB25_TIOB6    ((unsigned int) AT91C_PIO_PB25) //  Timer Counter 6 Multipurpose Timer I/O Pin B
#define AT91C_PB25_CTS1     ((unsigned int) AT91C_PIO_PB25) //  USART 1 Clear To Send
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) // Pin Controlled by PB26
#define AT91C_PB26_TIOA7    ((unsigned int) AT91C_PIO_PB26) //  Timer Counter 7 Multipurpose Timer I/O Pin A
#define AT91C_PB26_SCK1     ((unsigned int) AT91C_PIO_PB26) //  USART 1 Serial Clock
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) // Pin Controlled by PB27
#define AT91C_PB27_TIOB7    ((unsigned int) AT91C_PIO_PB27) //  Timer Counter 7 Multipurpose Timer I/O Pin B
#define AT91C_PB27_RTS2     ((unsigned int) AT91C_PIO_PB27) //  USART 2 Ready To Send
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) // Pin Controlled by PB28
#define AT91C_PB28_TIOA8    ((unsigned int) AT91C_PIO_PB28) //  Timer Counter 8 Multipurpose Timer I/O Pin A
#define AT91C_PB28_CTS2     ((unsigned int) AT91C_PIO_PB28) //  USART 2 Clear To Send
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) // Pin Controlled by PB29
#define AT91C_PB29_TIOB8    ((unsigned int) AT91C_PIO_PB29) //  Timer Counter 8 Multipurpose Timer I/O Pin B
#define AT91C_PB29_SCK2     ((unsigned int) AT91C_PIO_PB29) //  USART 2 Serial Clock
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) // Pin Controlled by PB3
#define AT91C_PB3_TK0      ((unsigned int) AT91C_PIO_PB3) //  SSC Transmit Clock 0
#define AT91C_PB3_PCK0     ((unsigned int) AT91C_PIO_PB3) //  PMC Programmable Clock Output 0
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) // Pin Controlled by PB4
#define AT91C_PB4_TD0      ((unsigned int) AT91C_PIO_PB4) //  SSC Transmit data
#define AT91C_PB4_PCK1     ((unsigned int) AT91C_PIO_PB4) //  PMC Programmable Clock Output 1
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) // Pin Controlled by PB5
#define AT91C_PB5_RD0      ((unsigned int) AT91C_PIO_PB5) //  SSC Receive Data
#define AT91C_PB5_PCK2     ((unsigned int) AT91C_PIO_PB5) //  PMC Programmable Clock Output 2
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) // Pin Controlled by PB6
#define AT91C_PB6_RK0      ((unsigned int) AT91C_PIO_PB6) //  SSC Receive Clock
#define AT91C_PB6_PCK3     ((unsigned int) AT91C_PIO_PB6) //  PMC Programmable Clock Output 3
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) // Pin Controlled by PB7
#define AT91C_PB7_RF0      ((unsigned int) AT91C_PIO_PB7) //  SSC Receive Frame Sync 0
#define AT91C_PB7_CANTX1   ((unsigned int) AT91C_PIO_PB7) //  CAN Transmit 1
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) // Pin Controlled by PB8
#define AT91C_PB8_FIQ      ((unsigned int) AT91C_PIO_PB8) //  AIC Fast Interrupt Input
#define AT91C_PB8_TF1      ((unsigned int) AT91C_PIO_PB8) //  SSC Transmit Frame Sync 1
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) // Pin Controlled by PB9
#define AT91C_PB9_TCLK0    ((unsigned int) AT91C_PIO_PB9) //  Timer Counter 0 external clock input
#define AT91C_PB9_TK1      ((unsigned int) AT91C_PIO_PB9) //  SSC Transmit Clock 1

// *****************************************************************************
//               PERIPHERAL ID DEFINITIONS FOR AT91SAM7A3
// *****************************************************************************
#define AT91C_ID_FIQ    ((unsigned int)  0) // Advanced Interrupt Controller (FIQ)
#define AT91C_ID_SYS    ((unsigned int)  1) // System Peripheral
#define AT91C_ID_PIOA   ((unsigned int)  2) // Parallel IO Controller A 
#define AT91C_ID_PIOB   ((unsigned int)  3) // Parallel IO Controller B
#define AT91C_ID_CAN0   ((unsigned int)  4) // Control Area Network Controller 0
#define AT91C_ID_CAN1   ((unsigned int)  5) // Control Area Network Controller 1
#define AT91C_ID_US0    ((unsigned int)  6) // USART 0
#define AT91C_ID_US1    ((unsigned int)  7) // USART 1
#define AT91C_ID_US2    ((unsigned int)  8) // USART 2
#define AT91C_ID_MCI    ((unsigned int)  9) // Multimedia Card Interface
#define AT91C_ID_TWI    ((unsigned int) 10) // Two-Wire Interface
#define AT91C_ID_SPI0   ((unsigned int) 11) // Serial Peripheral Interface 0
#define AT91C_ID_SPI1   ((unsigned int) 12) // Serial Peripheral Interface 1
#define AT91C_ID_SSC0   ((unsigned int) 13) // Serial Synchronous Controller 0
#define AT91C_ID_SSC1   ((unsigned int) 14) // Serial Synchronous Controller 1
#define AT91C_ID_TC0    ((unsigned int) 15) // Timer Counter 0
#define AT91C_ID_TC1    ((unsigned int) 16) // Timer Counter 1
#define AT91C_ID_TC2    ((unsigned int) 17) // Timer Counter 2
#define AT91C_ID_TC3    ((unsigned int) 18) // Timer Counter 3
#define AT91C_ID_TC4    ((unsigned int) 19) // Timer Counter 4
#define AT91C_ID_TC5    ((unsigned int) 20) // Timer Counter 5
#define AT91C_ID_TC6    ((unsigned int) 21) // Timer Counter 6
#define AT91C_ID_TC7    ((unsigned int) 22) // Timer Counter 7
#define AT91C_ID_TC8    ((unsigned int) 23) // Timer Counter 8
#define AT91C_ID_ADC0   ((unsigned int) 24) // Analog To Digital Converter 0
#define AT91C_ID_ADC1   ((unsigned int) 25) // Analog To Digital Converter 1
#define AT91C_ID_PWMC   ((unsigned int) 26) // Pulse Width Modulation Controller
#define AT91C_ID_UDP    ((unsigned int) 27) // USB Device Port
#define AT91C_ID_IRQ0   ((unsigned int) 28) // Advanced Interrupt Controller (IRQ0)
#define AT91C_ID_IRQ1   ((unsigned int) 29) // Advanced Interrupt Controller (IRQ1)
#define AT91C_ID_IRQ2   ((unsigned int) 30) // Advanced Interrupt Controller (IRQ2)
#define AT91C_ID_IRQ3   ((unsigned int) 31) // Advanced Interrupt Controller (IRQ3)

