tsugli/stm32/common/rtos/portable/GCC/AT91SAM7A3/ioat91sam7a3.h
// *****************************************************************************
//               BASE ADDRESS DEFINITIONS FOR AT91SAM7A3
// *****************************************************************************
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFF000) // (SYS) Base Address
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) // (AIC) Base Address
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) // (PDC_DBGU) Base Address
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) // (DBGU) Base Address
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) // (PIOA) Base Address
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF600) // (PIOB) Base Address
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) // (CKGR) Base Address
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) // (PMC) Base Address
#define AT91C_BASE_RSTC      ((AT91PS_RSTC) 	0xFFFFFD00) // (RSTC) Base Address
#define AT91C_BASE_SHDWC     ((AT91PS_SHDWC) 	0xFFFFFD10) // (SHDWC) Base Address
#define AT91C_BASE_RTTC      ((AT91PS_RTTC) 	0xFFFFFD20) // (RTTC) Base Address
#define AT91C_BASE_PITC      ((AT91PS_PITC) 	0xFFFFFD30) // (PITC) Base Address
#define AT91C_BASE_WDTC      ((AT91PS_WDTC) 	0xFFFFFD40) // (WDTC) Base Address
#define AT91C_BASE_MC        ((AT91PS_MC) 	0xFFFFFF00) // (MC) Base Address
#define AT91C_BASE_CAN0_MB0  ((AT91PS_CAN_MB) 	0xFFF80200) // (CAN0_MB0) Base Address
#define AT91C_BASE_CAN0_MB1  ((AT91PS_CAN_MB) 	0xFFF80220) // (CAN0_MB1) Base Address
#define AT91C_BASE_CAN0_MB2  ((AT91PS_CAN_MB) 	0xFFF80240) // (CAN0_MB2) Base Address
#define AT91C_BASE_CAN0_MB3  ((AT91PS_CAN_MB) 	0xFFF80260) // (CAN0_MB3) Base Address
#define AT91C_BASE_CAN0_MB4  ((AT91PS_CAN_MB) 	0xFFF80280) // (CAN0_MB4) Base Address
#define AT91C_BASE_CAN0_MB5  ((AT91PS_CAN_MB) 	0xFFF802A0) // (CAN0_MB5) Base Address
#define AT91C_BASE_CAN0_MB6  ((AT91PS_CAN_MB) 	0xFFF802C0) // (CAN0_MB6) Base Address
#define AT91C_BASE_CAN0_MB7  ((AT91PS_CAN_MB) 	0xFFF802E0) // (CAN0_MB7) Base Address
#define AT91C_BASE_CAN0_MB8  ((AT91PS_CAN_MB) 	0xFFF80300) // (CAN0_MB8) Base Address
#define AT91C_BASE_CAN0_MB9  ((AT91PS_CAN_MB) 	0xFFF80320) // (CAN0_MB9) Base Address
#define AT91C_BASE_CAN0_MB10 ((AT91PS_CAN_MB) 	0xFFF80340) // (CAN0_MB10) Base Address
#define AT91C_BASE_CAN0_MB11 ((AT91PS_CAN_MB) 	0xFFF80360) // (CAN0_MB11) Base Address
#define AT91C_BASE_CAN0_MB12 ((AT91PS_CAN_MB) 	0xFFF80380) // (CAN0_MB12) Base Address
#define AT91C_BASE_CAN0_MB13 ((AT91PS_CAN_MB) 	0xFFF803A0) // (CAN0_MB13) Base Address
#define AT91C_BASE_CAN0_MB14 ((AT91PS_CAN_MB) 	0xFFF803C0) // (CAN0_MB14) Base Address
#define AT91C_BASE_CAN0_MB15 ((AT91PS_CAN_MB) 	0xFFF803E0) // (CAN0_MB15) Base Address
#define AT91C_BASE_CAN0      ((AT91PS_CAN) 	0xFFF80000) // (CAN0) Base Address
#define AT91C_BASE_CAN1_MB0  ((AT91PS_CAN_MB) 	0xFFF84200) // (CAN1_MB0) Base Address
#define AT91C_BASE_CAN1_MB1  ((AT91PS_CAN_MB) 	0xFFF84220) // (CAN1_MB1) Base Address
#define AT91C_BASE_CAN1_MB2  ((AT91PS_CAN_MB) 	0xFFF84240) // (CAN1_MB2) Base Address
#define AT91C_BASE_CAN1_MB3  ((AT91PS_CAN_MB) 	0xFFF84260) // (CAN1_MB3) Base Address
#define AT91C_BASE_CAN1_MB4  ((AT91PS_CAN_MB) 	0xFFF84280) // (CAN1_MB4) Base Address
#define AT91C_BASE_CAN1_MB5  ((AT91PS_CAN_MB) 	0xFFF842A0) // (CAN1_MB5) Base Address
#define AT91C_BASE_CAN1_MB6  ((AT91PS_CAN_MB) 	0xFFF842C0) // (CAN1_MB6) Base Address
#define AT91C_BASE_CAN1_MB7  ((AT91PS_CAN_MB) 	0xFFF842E0) // (CAN1_MB7) Base Address
#define AT91C_BASE_CAN1_MB8  ((AT91PS_CAN_MB) 	0xFFF84300) // (CAN1_MB8) Base Address
#define AT91C_BASE_CAN1_MB9  ((AT91PS_CAN_MB) 	0xFFF84320) // (CAN1_MB9) Base Address
#define AT91C_BASE_CAN1_MB10 ((AT91PS_CAN_MB) 	0xFFF84340) // (CAN1_MB10) Base Address
#define AT91C_BASE_CAN1_MB11 ((AT91PS_CAN_MB) 	0xFFF84360) // (CAN1_MB11) Base Address
#define AT91C_BASE_CAN1_MB12 ((AT91PS_CAN_MB) 	0xFFF84380) // (CAN1_MB12) Base Address
#define AT91C_BASE_CAN1_MB13 ((AT91PS_CAN_MB) 	0xFFF843A0) // (CAN1_MB13) Base Address
#define AT91C_BASE_CAN1_MB14 ((AT91PS_CAN_MB) 	0xFFF843C0) // (CAN1_MB14) Base Address
#define AT91C_BASE_CAN1_MB15 ((AT91PS_CAN_MB) 	0xFFF843E0) // (CAN1_MB15) Base Address
#define AT91C_BASE_CAN1      ((AT91PS_CAN) 	0xFFF84000) // (CAN1) Base Address
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) // (TC0) Base Address
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) // (TC1) Base Address
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) // (TC2) Base Address
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0xFFFA0000) // (TCB0) Base Address
#define AT91C_BASE_TC3       ((AT91PS_TC) 	0xFFFA4000) // (TC3) Base Address
#define AT91C_BASE_TC4       ((AT91PS_TC) 	0xFFFA4040) // (TC4) Base Address
#define AT91C_BASE_TC5       ((AT91PS_TC) 	0xFFFA4080) // (TC5) Base Address
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0xFFFA4000) // (TCB1) Base Address
#define AT91C_BASE_TC6       ((AT91PS_TC) 	0xFFFA8000) // (TC6) Base Address
#define AT91C_BASE_TC7       ((AT91PS_TC) 	0xFFFA8040) // (TC7) Base Address
#define AT91C_BASE_TC8       ((AT91PS_TC) 	0xFFFA8080) // (TC8) Base Address
#define AT91C_BASE_TCB2      ((AT91PS_TCB) 	0xFFFA8000) // (TCB2) Base Address
#define AT91C_BASE_PDC_MCI   ((AT91PS_PDC) 	0xFFFAC100) // (PDC_MCI) Base Address
#define AT91C_BASE_MCI       ((AT91PS_MCI) 	0xFFFAC000) // (MCI) Base Address
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFFB0000) // (UDP) Base Address
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFFB8000) // (TWI) Base Address
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFC0100) // (PDC_US0) Base Address
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFC0000) // (US0) Base Address
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFC4100) // (PDC_US1) Base Address
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFC4000) // (US1) Base Address
#define AT91C_BASE_PDC_US2   ((AT91PS_PDC) 	0xFFFC8100) // (PDC_US2) Base Address
#define AT91C_BASE_US2       ((AT91PS_USART) 	0xFFFC8000) // (US2) Base Address
#define AT91C_BASE_PWMC_CH0  ((AT91PS_PWMC_CH) 	0xFFFCC200) // (PWMC_CH0) Base Address
#define AT91C_BASE_PWMC_CH1  ((AT91PS_PWMC_CH) 	0xFFFCC220) // (PWMC_CH1) Base Address
#define AT91C_BASE_PWMC_CH2  ((AT91PS_PWMC_CH) 	0xFFFCC240) // (PWMC_CH2) Base Address
#define AT91C_BASE_PWMC_CH3  ((AT91PS_PWMC_CH) 	0xFFFCC260) // (PWMC_CH3) Base Address
#define AT91C_BASE_PWMC_CH4  ((AT91PS_PWMC_CH) 	0xFFFCC280) // (PWMC_CH4) Base Address
#define AT91C_BASE_PWMC_CH5  ((AT91PS_PWMC_CH) 	0xFFFCC2A0) // (PWMC_CH5) Base Address
#define AT91C_BASE_PWMC_CH6  ((AT91PS_PWMC_CH) 	0xFFFCC2C0) // (PWMC_CH6) Base Address
#define AT91C_BASE_PWMC_CH7  ((AT91PS_PWMC_CH) 	0xFFFCC2E0) // (PWMC_CH7) Base Address
#define AT91C_BASE_PWMC      ((AT91PS_PWMC) 	0xFFFCC000) // (PWMC) Base Address
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0xFFFD0100) // (PDC_SSC0) Base Address
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0xFFFD0000) // (SSC0) Base Address
#define AT91C_BASE_PDC_SSC1  ((AT91PS_PDC) 	0xFFFD4100) // (PDC_SSC1) Base Address
#define AT91C_BASE_SSC1      ((AT91PS_SSC) 	0xFFFD4000) // (SSC1) Base Address
#define AT91C_BASE_PDC_ADC0  ((AT91PS_PDC) 	0xFFFD8100) // (PDC_ADC0) Base Address
#define AT91C_BASE_ADC0      ((AT91PS_ADC) 	0xFFFD8000) // (ADC0) Base Address
#define AT91C_BASE_PDC_ADC1  ((AT91PS_PDC) 	0xFFFDC100) // (PDC_ADC1) Base Address
#define AT91C_BASE_ADC1      ((AT91PS_ADC) 	0xFFFDC000) // (ADC1) Base Address
#define AT91C_BASE_PDC_SPI0  ((AT91PS_PDC) 	0xFFFE0100) // (PDC_SPI0) Base Address
#define AT91C_BASE_SPI0      ((AT91PS_SPI) 	0xFFFE0000) // (SPI0) Base Address
#define AT91C_BASE_PDC_SPI1  ((AT91PS_PDC) 	0xFFFE4100) // (PDC_SPI1) Base Address
#define AT91C_BASE_SPI1      ((AT91PS_SPI) 	0xFFFE4000) // (SPI1) Base Address

// *****************************************************************************
//               MEMORY MAPPING DEFINITIONS FOR AT91SAM7A3
// *****************************************************************************
#define AT91C_ISRAM	 ((char *) 	0x00200000) // Internal SRAM base address
#define AT91C_ISRAM_SIZE	 ((unsigned int) 0x00008000) // Internal SRAM size in byte (32 Kbyte)
#define AT91C_IFLASH	 ((char *) 	0x00100000) // Internal Flash base address
#define AT91C_IFLASH_SIZE	 ((unsigned int) 0x00040000) // Internal Flash size in byte (256 Kbyte)
#endif /* __IAR_SYSTEMS_ICC__ */

