tsugli/stm32/common/rtos/portable/GCC/AT91SAM7A3/ioat91sam7a3.h
// - *****************************************************************************
// -               REGISTER ADDRESS DEFINITION FOR AT91SAM7A3
// - *****************************************************************************
// - ========== Register definition for SYS peripheral ========== 
AT91C_SYS_GPBR1           EQU (0xFFFFFD54) ;- (SYS) General Purpose Register 1
AT91C_SYS_GPBR0           EQU (0xFFFFFD50) ;- (SYS) General Purpose Register 0
// - ========== Register definition for AIC peripheral ========== 
AT91C_AIC_IVR             EQU (0xFFFFF100) ;- (AIC) IRQ Vector Register
AT91C_AIC_SMR             EQU (0xFFFFF000) ;- (AIC) Source Mode Register
AT91C_AIC_FVR             EQU (0xFFFFF104) ;- (AIC) FIQ Vector Register
AT91C_AIC_DCR             EQU (0xFFFFF138) ;- (AIC) Debug Control Register (Protect)
AT91C_AIC_EOICR           EQU (0xFFFFF130) ;- (AIC) End of Interrupt Command Register
AT91C_AIC_SVR             EQU (0xFFFFF080) ;- (AIC) Source Vector Register
AT91C_AIC_FFSR            EQU (0xFFFFF148) ;- (AIC) Fast Forcing Status Register
AT91C_AIC_ICCR            EQU (0xFFFFF128) ;- (AIC) Interrupt Clear Command Register
AT91C_AIC_ISR             EQU (0xFFFFF108) ;- (AIC) Interrupt Status Register
AT91C_AIC_IMR             EQU (0xFFFFF110) ;- (AIC) Interrupt Mask Register
AT91C_AIC_IPR             EQU (0xFFFFF10C) ;- (AIC) Interrupt Pending Register
AT91C_AIC_FFER            EQU (0xFFFFF140) ;- (AIC) Fast Forcing Enable Register
AT91C_AIC_IECR            EQU (0xFFFFF120) ;- (AIC) Interrupt Enable Command Register
AT91C_AIC_ISCR            EQU (0xFFFFF12C) ;- (AIC) Interrupt Set Command Register
AT91C_AIC_FFDR            EQU (0xFFFFF144) ;- (AIC) Fast Forcing Disable Register
AT91C_AIC_CISR            EQU (0xFFFFF114) ;- (AIC) Core Interrupt Status Register
AT91C_AIC_IDCR            EQU (0xFFFFF124) ;- (AIC) Interrupt Disable Command Register
AT91C_AIC_SPU             EQU (0xFFFFF134) ;- (AIC) Spurious Vector Register
// - ========== Register definition for PDC_DBGU peripheral ========== 
AT91C_DBGU_TCR            EQU (0xFFFFF30C) ;- (PDC_DBGU) Transmit Counter Register
AT91C_DBGU_RNPR           EQU (0xFFFFF310) ;- (PDC_DBGU) Receive Next Pointer Register
AT91C_DBGU_TNPR           EQU (0xFFFFF318) ;- (PDC_DBGU) Transmit Next Pointer Register
AT91C_DBGU_TPR            EQU (0xFFFFF308) ;- (PDC_DBGU) Transmit Pointer Register
AT91C_DBGU_RPR            EQU (0xFFFFF300) ;- (PDC_DBGU) Receive Pointer Register
AT91C_DBGU_RCR            EQU (0xFFFFF304) ;- (PDC_DBGU) Receive Counter Register
AT91C_DBGU_RNCR           EQU (0xFFFFF314) ;- (PDC_DBGU) Receive Next Counter Register
AT91C_DBGU_PTCR           EQU (0xFFFFF320) ;- (PDC_DBGU) PDC Transfer Control Register
AT91C_DBGU_PTSR           EQU (0xFFFFF324) ;- (PDC_DBGU) PDC Transfer Status Register
AT91C_DBGU_TNCR           EQU (0xFFFFF31C) ;- (PDC_DBGU) Transmit Next Counter Register
// - ========== Register definition for DBGU peripheral ========== 
AT91C_DBGU_EXID           EQU (0xFFFFF244) ;- (DBGU) Chip ID Extension Register
AT91C_DBGU_BRGR           EQU (0xFFFFF220) ;- (DBGU) Baud Rate Generator Register
AT91C_DBGU_IDR            EQU (0xFFFFF20C) ;- (DBGU) Interrupt Disable Register
AT91C_DBGU_CSR            EQU (0xFFFFF214) ;- (DBGU) Channel Status Register
AT91C_DBGU_CIDR           EQU (0xFFFFF240) ;- (DBGU) Chip ID Register
AT91C_DBGU_MR             EQU (0xFFFFF204) ;- (DBGU) Mode Register
AT91C_DBGU_IMR            EQU (0xFFFFF210) ;- (DBGU) Interrupt Mask Register
AT91C_DBGU_CR             EQU (0xFFFFF200) ;- (DBGU) Control Register
AT91C_DBGU_FNTR           EQU (0xFFFFF248) ;- (DBGU) Force NTRST Register
AT91C_DBGU_THR            EQU (0xFFFFF21C) ;- (DBGU) Transmitter Holding Register
AT91C_DBGU_RHR            EQU (0xFFFFF218) ;- (DBGU) Receiver Holding Register
AT91C_DBGU_IER            EQU (0xFFFFF208) ;- (DBGU) Interrupt Enable Register
// - ========== Register definition for PIOA peripheral ========== 
AT91C_PIOA_ODR            EQU (0xFFFFF414) ;- (PIOA) Output Disable Registerr
AT91C_PIOA_SODR           EQU (0xFFFFF430) ;- (PIOA) Set Output Data Register
AT91C_PIOA_ISR            EQU (0xFFFFF44C) ;- (PIOA) Interrupt Status Register
AT91C_PIOA_ABSR           EQU (0xFFFFF478) ;- (PIOA) AB Select Status Register
AT91C_PIOA_IER            EQU (0xFFFFF440) ;- (PIOA) Interrupt Enable Register
AT91C_PIOA_PPUDR          EQU (0xFFFFF460) ;- (PIOA) Pull-up Disable Register
AT91C_PIOA_IMR            EQU (0xFFFFF448) ;- (PIOA) Interrupt Mask Register
AT91C_PIOA_PER            EQU (0xFFFFF400) ;- (PIOA) PIO Enable Register
AT91C_PIOA_IFDR           EQU (0xFFFFF424) ;- (PIOA) Input Filter Disable Register
AT91C_PIOA_OWDR           EQU (0xFFFFF4A4) ;- (PIOA) Output Write Disable Register
AT91C_PIOA_MDSR           EQU (0xFFFFF458) ;- (PIOA) Multi-driver Status Register
AT91C_PIOA_IDR            EQU (0xFFFFF444) ;- (PIOA) Interrupt Disable Register
AT91C_PIOA_ODSR           EQU (0xFFFFF438) ;- (PIOA) Output Data Status Register
AT91C_PIOA_PPUSR          EQU (0xFFFFF468) ;- (PIOA) Pull-up Status Register
AT91C_PIOA_OWSR           EQU (0xFFFFF4A8) ;- (PIOA) Output Write Status Register
AT91C_PIOA_BSR            EQU (0xFFFFF474) ;- (PIOA) Select B Register
AT91C_PIOA_OWER           EQU (0xFFFFF4A0) ;- (PIOA) Output Write Enable Register
AT91C_PIOA_IFER           EQU (0xFFFFF420) ;- (PIOA) Input Filter Enable Register
AT91C_PIOA_PDSR           EQU (0xFFFFF43C) ;- (PIOA) Pin Data Status Register
AT91C_PIOA_PPUER          EQU (0xFFFFF464) ;- (PIOA) Pull-up Enable Register
AT91C_PIOA_OSR            EQU (0xFFFFF418) ;- (PIOA) Output Status Register
AT91C_PIOA_ASR            EQU (0xFFFFF470) ;- (PIOA) Select A Register
AT91C_PIOA_MDDR           EQU (0xFFFFF454) ;- (PIOA) Multi-driver Disable Register
AT91C_PIOA_CODR           EQU (0xFFFFF434) ;- (PIOA) Clear Output Data Register
AT91C_PIOA_MDER           EQU (0xFFFFF450) ;- (PIOA) Multi-driver Enable Register
AT91C_PIOA_PDR            EQU (0xFFFFF404) ;- (PIOA) PIO Disable Register
AT91C_PIOA_IFSR           EQU (0xFFFFF428) ;- (PIOA) Input Filter Status Register
AT91C_PIOA_OER            EQU (0xFFFFF410) ;- (PIOA) Output Enable Register
AT91C_PIOA_PSR            EQU (0xFFFFF408) ;- (PIOA) PIO Status Register
// - ========== Register definition for PIOB peripheral ========== 
AT91C_PIOB_OWDR           EQU (0xFFFFF6A4) ;- (PIOB) Output Write Disable Register
AT91C_PIOB_MDER           EQU (0xFFFFF650) ;- (PIOB) Multi-driver Enable Register
AT91C_PIOB_PPUSR          EQU (0xFFFFF668) ;- (PIOB) Pull-up Status Register
AT91C_PIOB_IMR            EQU (0xFFFFF648) ;- (PIOB) Interrupt Mask Register
AT91C_PIOB_ASR            EQU (0xFFFFF670) ;- (PIOB) Select A Register
AT91C_PIOB_PPUDR          EQU (0xFFFFF660) ;- (PIOB) Pull-up Disable Register
AT91C_PIOB_PSR            EQU (0xFFFFF608) ;- (PIOB) PIO Status Register
AT91C_PIOB_IER            EQU (0xFFFFF640) ;- (PIOB) Interrupt Enable Register
AT91C_PIOB_CODR           EQU (0xFFFFF634) ;- (PIOB) Clear Output Data Register
AT91C_PIOB_OWER           EQU (0xFFFFF6A0) ;- (PIOB) Output Write Enable Register
AT91C_PIOB_ABSR           EQU (0xFFFFF678) ;- (PIOB) AB Select Status Register
AT91C_PIOB_IFDR           EQU (0xFFFFF624) ;- (PIOB) Input Filter Disable Register
AT91C_PIOB_PDSR           EQU (0xFFFFF63C) ;- (PIOB) Pin Data Status Register
AT91C_PIOB_IDR            EQU (0xFFFFF644) ;- (PIOB) Interrupt Disable Register
AT91C_PIOB_OWSR           EQU (0xFFFFF6A8) ;- (PIOB) Output Write Status Register
AT91C_PIOB_PDR            EQU (0xFFFFF604) ;- (PIOB) PIO Disable Register
AT91C_PIOB_ODR            EQU (0xFFFFF614) ;- (PIOB) Output Disable Registerr
AT91C_PIOB_IFSR           EQU (0xFFFFF628) ;- (PIOB) Input Filter Status Register
AT91C_PIOB_PPUER          EQU (0xFFFFF664) ;- (PIOB) Pull-up Enable Register
AT91C_PIOB_SODR           EQU (0xFFFFF630) ;- (PIOB) Set Output Data Register
AT91C_PIOB_ISR            EQU (0xFFFFF64C) ;- (PIOB) Interrupt Status Register
AT91C_PIOB_ODSR           EQU (0xFFFFF638) ;- (PIOB) Output Data Status Register
AT91C_PIOB_OSR            EQU (0xFFFFF618) ;- (PIOB) Output Status Register
AT91C_PIOB_MDSR           EQU (0xFFFFF658) ;- (PIOB) Multi-driver Status Register
AT91C_PIOB_IFER           EQU (0xFFFFF620) ;- (PIOB) Input Filter Enable Register
AT91C_PIOB_BSR            EQU (0xFFFFF674) ;- (PIOB) Select B Register
AT91C_PIOB_MDDR           EQU (0xFFFFF654) ;- (PIOB) Multi-driver Disable Register
AT91C_PIOB_OER            EQU (0xFFFFF610) ;- (PIOB) Output Enable Register
AT91C_PIOB_PER            EQU (0xFFFFF600) ;- (PIOB) PIO Enable Register
// - ========== Register definition for CKGR peripheral ========== 
AT91C_CKGR_MOR            EQU (0xFFFFFC20) ;- (CKGR) Main Oscillator Register
AT91C_CKGR_PLLR           EQU (0xFFFFFC2C) ;- (CKGR) PLL Register
AT91C_CKGR_MCFR           EQU (0xFFFFFC24) ;- (CKGR) Main Clock  Frequency Register
// - ========== Register definition for PMC peripheral ========== 
AT91C_PMC_IDR             EQU (0xFFFFFC64) ;- (PMC) Interrupt Disable Register
AT91C_PMC_MOR             EQU (0xFFFFFC20) ;- (PMC) Main Oscillator Register
AT91C_PMC_PLLR            EQU (0xFFFFFC2C) ;- (PMC) PLL Register
AT91C_PMC_PCER            EQU (0xFFFFFC10) ;- (PMC) Peripheral Clock Enable Register
AT91C_PMC_PCKR            EQU (0xFFFFFC40) ;- (PMC) Programmable Clock Register
AT91C_PMC_MCKR            EQU (0xFFFFFC30) ;- (PMC) Master Clock Register
AT91C_PMC_SCDR            EQU (0xFFFFFC04) ;- (PMC) System Clock Disable Register
AT91C_PMC_PCDR            EQU (0xFFFFFC14) ;- (PMC) Peripheral Clock Disable Register
AT91C_PMC_SCSR            EQU (0xFFFFFC08) ;- (PMC) System Clock Status Register
AT91C_PMC_PCSR            EQU (0xFFFFFC18) ;- (PMC) Peripheral Clock Status Register
AT91C_PMC_MCFR            EQU (0xFFFFFC24) ;- (PMC) Main Clock  Frequency Register
AT91C_PMC_SCER            EQU (0xFFFFFC00) ;- (PMC) System Clock Enable Register
AT91C_PMC_IMR             EQU (0xFFFFFC6C) ;- (PMC) Interrupt Mask Register
AT91C_PMC_IER             EQU (0xFFFFFC60) ;- (PMC) Interrupt Enable Register
AT91C_PMC_SR              EQU (0xFFFFFC68) ;- (PMC) Status Register
// - ========== Register definition for RSTC peripheral ========== 
AT91C_RSTC_RCR            EQU (0xFFFFFD00) ;- (RSTC) Reset Control Register
AT91C_RSTC_RMR            EQU (0xFFFFFD08) ;- (RSTC) Reset Mode Register
AT91C_RSTC_RSR            EQU (0xFFFFFD04) ;- (RSTC) Reset Status Register
// - ========== Register definition for SHDWC peripheral ========== 
AT91C_SHDWC_SHSR          EQU (0xFFFFFD18) ;- (SHDWC) Shut Down Status Register
AT91C_SHDWC_SHMR          EQU (0xFFFFFD14) ;- (SHDWC) Shut Down Mode Register
AT91C_SHDWC_SHCR          EQU (0xFFFFFD10) ;- (SHDWC) Shut Down Control Register
// - ========== Register definition for RTTC peripheral ========== 
AT91C_RTTC_RTSR           EQU (0xFFFFFD2C) ;- (RTTC) Real-time Status Register
AT91C_RTTC_RTMR           EQU (0xFFFFFD20) ;- (RTTC) Real-time Mode Register
AT91C_RTTC_RTVR           EQU (0xFFFFFD28) ;- (RTTC) Real-time Value Register
AT91C_RTTC_RTAR           EQU (0xFFFFFD24) ;- (RTTC) Real-time Alarm Register
// - ========== Register definition for PITC peripheral ========== 
AT91C_PITC_PIVR           EQU (0xFFFFFD38) ;- (PITC) Period Interval Value Register
AT91C_PITC_PISR           EQU (0xFFFFFD34) ;- (PITC) Period Interval Status Register
AT91C_PITC_PIIR           EQU (0xFFFFFD3C) ;- (PITC) Period Interval Image Register
AT91C_PITC_PIMR           EQU (0xFFFFFD30) ;- (PITC) Period Interval Mode Register
// - ========== Register definition for WDTC peripheral ========== 
AT91C_WDTC_WDCR           EQU (0xFFFFFD40) ;- (WDTC) Watchdog Control Register
AT91C_WDTC_WDSR           EQU (0xFFFFFD48) ;- (WDTC) Watchdog Status Register
AT91C_WDTC_WDMR           EQU (0xFFFFFD44) ;- (WDTC) Watchdog Mode Register
// - ========== Register definition for MC peripheral ========== 
AT91C_MC_PUIA             EQU (0xFFFFFF10) ;- (MC) MC Protection Unit Area
AT91C_MC_FMR              EQU (0xFFFFFF60) ;- (MC) MC Flash Mode Register
AT91C_MC_RCR              EQU (0xFFFFFF00) ;- (MC) MC Remap Control Register
AT91C_MC_ASR              EQU (0xFFFFFF04) ;- (MC) MC Abort Status Register
AT91C_MC_PUP              EQU (0xFFFFFF50) ;- (MC) MC Protection Unit Peripherals
AT91C_MC_AASR             EQU (0xFFFFFF08) ;- (MC) MC Abort Address Status Register
AT91C_MC_FCR              EQU (0xFFFFFF64) ;- (MC) MC Flash Command Register
AT91C_MC_FSR              EQU (0xFFFFFF68) ;- (MC) MC Flash Status Register
AT91C_MC_PUER             EQU (0xFFFFFF54) ;- (MC) MC Protection Unit Enable Register
// - ========== Register definition for CAN0_MB0 peripheral ========== 
AT91C_CAN0_MB0_MDH        EQU (0xFFF80218) ;- (CAN0_MB0) MailBox Data High Register
AT91C_CAN0_MB0_MDL        EQU (0xFFF80214) ;- (CAN0_MB0) MailBox Data Low Register
AT91C_CAN0_MB0_MAM        EQU (0xFFF80204) ;- (CAN0_MB0) MailBox Acceptance Mask Register
AT91C_CAN0_MB0_MCR        EQU (0xFFF8021C) ;- (CAN0_MB0) MailBox Control Register
AT91C_CAN0_MB0_MMR        EQU (0xFFF80200) ;- (CAN0_MB0) MailBox Mode Register
AT91C_CAN0_MB0_MID        EQU (0xFFF80208) ;- (CAN0_MB0) MailBox ID Register
AT91C_CAN0_MB0_MFID       EQU (0xFFF8020C) ;- (CAN0_MB0) MailBox Family ID Register
AT91C_CAN0_MB0_MSR        EQU (0xFFF80210) ;- (CAN0_MB0) MailBox Status Register
// - ========== Register definition for CAN0_MB1 peripheral ========== 
AT91C_CAN0_MB1_MSR        EQU (0xFFF80230) ;- (CAN0_MB1) MailBox Status Register
AT91C_CAN0_MB1_MDH        EQU (0xFFF80238) ;- (CAN0_MB1) MailBox Data High Register
AT91C_CAN0_MB1_MFID       EQU (0xFFF8022C) ;- (CAN0_MB1) MailBox Family ID Register
AT91C_CAN0_MB1_MAM        EQU (0xFFF80224) ;- (CAN0_MB1) MailBox Acceptance Mask Register
AT91C_CAN0_MB1_MDL        EQU (0xFFF80234) ;- (CAN0_MB1) MailBox Data Low Register
AT91C_CAN0_MB1_MMR        EQU (0xFFF80220) ;- (CAN0_MB1) MailBox Mode Register
AT91C_CAN0_MB1_MID        EQU (0xFFF80228) ;- (CAN0_MB1) MailBox ID Register
AT91C_CAN0_MB1_MCR        EQU (0xFFF8023C) ;- (CAN0_MB1) MailBox Control Register
// - ========== Register definition for CAN0_MB2 peripheral ========== 
AT91C_CAN0_MB2_MCR        EQU (0xFFF8025C) ;- (CAN0_MB2) MailBox Control Register
AT91C_CAN0_MB2_MFID       EQU (0xFFF8024C) ;- (CAN0_MB2) MailBox Family ID Register
AT91C_CAN0_MB2_MID        EQU (0xFFF80248) ;- (CAN0_MB2) MailBox ID Register
AT91C_CAN0_MB2_MMR        EQU (0xFFF80240) ;- (CAN0_MB2) MailBox Mode Register
AT91C_CAN0_MB2_MAM        EQU (0xFFF80244) ;- (CAN0_MB2) MailBox Acceptance Mask Register
AT91C_CAN0_MB2_MDH        EQU (0xFFF80258) ;- (CAN0_MB2) MailBox Data High Register
AT91C_CAN0_MB2_MSR        EQU (0xFFF80250) ;- (CAN0_MB2) MailBox Status Register
AT91C_CAN0_MB2_MDL        EQU (0xFFF80254) ;- (CAN0_MB2) MailBox Data Low Register
// - ========== Register definition for CAN0_MB3 peripheral ========== 
AT91C_CAN0_MB3_MMR        EQU (0xFFF80260) ;- (CAN0_MB3) MailBox Mode Register
AT91C_CAN0_MB3_MCR        EQU (0xFFF8027C) ;- (CAN0_MB3) MailBox Control Register
AT91C_CAN0_MB3_MDH        EQU (0xFFF80278) ;- (CAN0_MB3) MailBox Data High Register
AT91C_CAN0_MB3_MDL        EQU (0xFFF80274) ;- (CAN0_MB3) MailBox Data Low Register
AT91C_CAN0_MB3_MAM        EQU (0xFFF80264) ;- (CAN0_MB3) MailBox Acceptance Mask Register
AT91C_CAN0_MB3_MSR        EQU (0xFFF80270) ;- (CAN0_MB3) MailBox Status Register
AT91C_CAN0_MB3_MFID       EQU (0xFFF8026C) ;- (CAN0_MB3) MailBox Family ID Register
AT91C_CAN0_MB3_MID        EQU (0xFFF80268) ;- (CAN0_MB3) MailBox ID Register
// - ========== Register definition for CAN0_MB4 peripheral ========== 
AT91C_CAN0_MB4_MFID       EQU (0xFFF8028C) ;- (CAN0_MB4) MailBox Family ID Register
AT91C_CAN0_MB4_MID        EQU (0xFFF80288) ;- (CAN0_MB4) MailBox ID Register
AT91C_CAN0_MB4_MDH        EQU (0xFFF80298) ;- (CAN0_MB4) MailBox Data High Register
AT91C_CAN0_MB4_MDL        EQU (0xFFF80294) ;- (CAN0_MB4) MailBox Data Low Register
AT91C_CAN0_MB4_MAM        EQU (0xFFF80284) ;- (CAN0_MB4) MailBox Acceptance Mask Register
AT91C_CAN0_MB4_MCR        EQU (0xFFF8029C) ;- (CAN0_MB4) MailBox Control Register
AT91C_CAN0_MB4_MSR        EQU (0xFFF80290) ;- (CAN0_MB4) MailBox Status Register
AT91C_CAN0_MB4_MMR        EQU (0xFFF80280) ;- (CAN0_MB4) MailBox Mode Register
// - ========== Register definition for CAN0_MB5 peripheral ========== 
AT91C_CAN0_MB5_MSR        EQU (0xFFF802B0) ;- (CAN0_MB5) MailBox Status Register
AT91C_CAN0_MB5_MFID       EQU (0xFFF802AC) ;- (CAN0_MB5) MailBox Family ID Register
AT91C_CAN0_MB5_MAM        EQU (0xFFF802A4) ;- (CAN0_MB5) MailBox Acceptance Mask Register
AT91C_CAN0_MB5_MDL        EQU (0xFFF802B4) ;- (CAN0_MB5) MailBox Data Low Register
AT91C_CAN0_MB5_MDH        EQU (0xFFF802B8) ;- (CAN0_MB5) MailBox Data High Register
AT91C_CAN0_MB5_MID        EQU (0xFFF802A8) ;- (CAN0_MB5) MailBox ID Register
AT91C_CAN0_MB5_MMR        EQU (0xFFF802A0) ;- (CAN0_MB5) MailBox Mode Register
AT91C_CAN0_MB5_MCR        EQU (0xFFF802BC) ;- (CAN0_MB5) MailBox Control Register
// - ========== Register definition for CAN0_MB6 peripheral ========== 
AT91C_CAN0_MB6_MAM        EQU (0xFFF802C4) ;- (CAN0_MB6) MailBox Acceptance Mask Register
AT91C_CAN0_MB6_MID        EQU (0xFFF802C8) ;- (CAN0_MB6) MailBox ID Register
AT91C_CAN0_MB6_MDL        EQU (0xFFF802D4) ;- (CAN0_MB6) MailBox Data Low Register
AT91C_CAN0_MB6_MDH        EQU (0xFFF802D8) ;- (CAN0_MB6) MailBox Data High Register
AT91C_CAN0_MB6_MCR        EQU (0xFFF802DC) ;- (CAN0_MB6) MailBox Control Register
AT91C_CAN0_MB6_MMR        EQU (0xFFF802C0) ;- (CAN0_MB6) MailBox Mode Register
AT91C_CAN0_MB6_MFID       EQU (0xFFF802CC) ;- (CAN0_MB6) MailBox Family ID Register
AT91C_CAN0_MB6_MSR        EQU (0xFFF802D0) ;- (CAN0_MB6) MailBox Status Register
// - ========== Register definition for CAN0_MB7 peripheral ========== 
AT91C_CAN0_MB7_MSR        EQU (0xFFF802F0) ;- (CAN0_MB7) MailBox Status Register
AT91C_CAN0_MB7_MMR        EQU (0xFFF802E0) ;- (CAN0_MB7) MailBox Mode Register
AT91C_CAN0_MB7_MCR        EQU (0xFFF802FC) ;- (CAN0_MB7) MailBox Control Register
AT91C_CAN0_MB7_MDL        EQU (0xFFF802F4) ;- (CAN0_MB7) MailBox Data Low Register
AT91C_CAN0_MB7_MID        EQU (0xFFF802E8) ;- (CAN0_MB7) MailBox ID Register
AT91C_CAN0_MB7_MDH        EQU (0xFFF802F8) ;- (CAN0_MB7) MailBox Data High Register
AT91C_CAN0_MB7_MFID       EQU (0xFFF802EC) ;- (CAN0_MB7) MailBox Family ID Register
AT91C_CAN0_MB7_MAM        EQU (0xFFF802E4) ;- (CAN0_MB7) MailBox Acceptance Mask Register
// - ========== Register definition for CAN0_MB8 peripheral ========== 
AT91C_CAN0_MB8_MAM        EQU (0xFFF80304) ;- (CAN0_MB8) MailBox Acceptance Mask Register
AT91C_CAN0_MB8_MCR        EQU (0xFFF8031C) ;- (CAN0_MB8) MailBox Control Register
AT91C_CAN0_MB8_MSR        EQU (0xFFF80310) ;- (CAN0_MB8) MailBox Status Register
AT91C_CAN0_MB8_MID        EQU (0xFFF80308) ;- (CAN0_MB8) MailBox ID Register
AT91C_CAN0_MB8_MDH        EQU (0xFFF80318) ;- (CAN0_MB8) MailBox Data High Register
AT91C_CAN0_MB8_MFID       EQU (0xFFF8030C) ;- (CAN0_MB8) MailBox Family ID Register
AT91C_CAN0_MB8_MMR        EQU (0xFFF80300) ;- (CAN0_MB8) MailBox Mode Register
AT91C_CAN0_MB8_MDL        EQU (0xFFF80314) ;- (CAN0_MB8) MailBox Data Low Register
// - ========== Register definition for CAN0_MB9 peripheral ========== 
AT91C_CAN0_MB9_MMR        EQU (0xFFF80320) ;- (CAN0_MB9) MailBox Mode Register
AT91C_CAN0_MB9_MDH        EQU (0xFFF80338) ;- (CAN0_MB9) MailBox Data High Register
AT91C_CAN0_MB9_MSR        EQU (0xFFF80330) ;- (CAN0_MB9) MailBox Status Register
AT91C_CAN0_MB9_MDL        EQU (0xFFF80334) ;- (CAN0_MB9) MailBox Data Low Register
AT91C_CAN0_MB9_MID        EQU (0xFFF80328) ;- (CAN0_MB9) MailBox ID Register
AT91C_CAN0_MB9_MFID       EQU (0xFFF8032C) ;- (CAN0_MB9) MailBox Family ID Register
AT91C_CAN0_MB9_MCR        EQU (0xFFF8033C) ;- (CAN0_MB9) MailBox Control Register
AT91C_CAN0_MB9_MAM        EQU (0xFFF80324) ;- (CAN0_MB9) MailBox Acceptance Mask Register
// - ========== Register definition for CAN0_MB10 peripheral ========== 
AT91C_CAN0_MB10_MCR       EQU (0xFFF8035C) ;- (CAN0_MB10) MailBox Control Register
AT91C_CAN0_MB10_MID       EQU (0xFFF80348) ;- (CAN0_MB10) MailBox ID Register
AT91C_CAN0_MB10_MAM       EQU (0xFFF80344) ;- (CAN0_MB10) MailBox Acceptance Mask Register
AT91C_CAN0_MB10_MFID      EQU (0xFFF8034C) ;- (CAN0_MB10) MailBox Family ID Register
AT91C_CAN0_MB10_MDL       EQU (0xFFF80354) ;- (CAN0_MB10) MailBox Data Low Register
AT91C_CAN0_MB10_MMR       EQU (0xFFF80340) ;- (CAN0_MB10) MailBox Mode Register
AT91C_CAN0_MB10_MDH       EQU (0xFFF80358) ;- (CAN0_MB10) MailBox Data High Register
AT91C_CAN0_MB10_MSR       EQU (0xFFF80350) ;- (CAN0_MB10) MailBox Status Register
// - ========== Register definition for CAN0_MB11 peripheral ========== 
AT91C_CAN0_MB11_MCR       EQU (0xFFF8037C) ;- (CAN0_MB11) MailBox Control Register
AT91C_CAN0_MB11_MFID      EQU (0xFFF8036C) ;- (CAN0_MB11) MailBox Family ID Register
AT91C_CAN0_MB11_MDH       EQU (0xFFF80378) ;- (CAN0_MB11) MailBox Data High Register
AT91C_CAN0_MB11_MAM       EQU (0xFFF80364) ;- (CAN0_MB11) MailBox Acceptance Mask Register
AT91C_CAN0_MB11_MID       EQU (0xFFF80368) ;- (CAN0_MB11) MailBox ID Register
AT91C_CAN0_MB11_MMR       EQU (0xFFF80360) ;- (CAN0_MB11) MailBox Mode Register
AT91C_CAN0_MB11_MSR       EQU (0xFFF80370) ;- (CAN0_MB11) MailBox Status Register
AT91C_CAN0_MB11_MDL       EQU (0xFFF80374) ;- (CAN0_MB11) MailBox Data Low Register
// - ========== Register definition for CAN0_MB12 peripheral ========== 
AT91C_CAN0_MB12_MCR       EQU (0xFFF8039C) ;- (CAN0_MB12) MailBox Control Register
AT91C_CAN0_MB12_MID       EQU (0xFFF80388) ;- (CAN0_MB12) MailBox ID Register
AT91C_CAN0_MB12_MDH       EQU (0xFFF80398) ;- (CAN0_MB12) MailBox Data High Register
AT91C_CAN0_MB12_MAM       EQU (0xFFF80384) ;- (CAN0_MB12) MailBox Acceptance Mask Register
AT91C_CAN0_MB12_MFID      EQU (0xFFF8038C) ;- (CAN0_MB12) MailBox Family ID Register
AT91C_CAN0_MB12_MDL       EQU (0xFFF80394) ;- (CAN0_MB12) MailBox Data Low Register
AT91C_CAN0_MB12_MMR       EQU (0xFFF80380) ;- (CAN0_MB12) MailBox Mode Register
AT91C_CAN0_MB12_MSR       EQU (0xFFF80390) ;- (CAN0_MB12) MailBox Status Register
// - ========== Register definition for CAN0_MB13 peripheral ========== 
AT91C_CAN0_MB13_MCR       EQU (0xFFF803BC) ;- (CAN0_MB13) MailBox Control Register
AT91C_CAN0_MB13_MDL       EQU (0xFFF803B4) ;- (CAN0_MB13) MailBox Data Low Register
AT91C_CAN0_MB13_MAM       EQU (0xFFF803A4) ;- (CAN0_MB13) MailBox Acceptance Mask Register
AT91C_CAN0_MB13_MFID      EQU (0xFFF803AC) ;- (CAN0_MB13) MailBox Family ID Register
AT91C_CAN0_MB13_MDH       EQU (0xFFF803B8) ;- (CAN0_MB13) MailBox Data High Register
AT91C_CAN0_MB13_MID       EQU (0xFFF803A8) ;- (CAN0_MB13) MailBox ID Register
AT91C_CAN0_MB13_MSR       EQU (0xFFF803B0) ;- (CAN0_MB13) MailBox Status Register
AT91C_CAN0_MB13_MMR       EQU (0xFFF803A0) ;- (CAN0_MB13) MailBox Mode Register
// - ========== Register definition for CAN0_MB14 peripheral ========== 
AT91C_CAN0_MB14_MSR       EQU (0xFFF803D0) ;- (CAN0_MB14) MailBox Status Register
AT91C_CAN0_MB14_MMR       EQU (0xFFF803C0) ;- (CAN0_MB14) MailBox Mode Register
AT91C_CAN0_MB14_MDL       EQU (0xFFF803D4) ;- (CAN0_MB14) MailBox Data Low Register
AT91C_CAN0_MB14_MDH       EQU (0xFFF803D8) ;- (CAN0_MB14) MailBox Data High Register
AT91C_CAN0_MB14_MID       EQU (0xFFF803C8) ;- (CAN0_MB14) MailBox ID Register
AT91C_CAN0_MB14_MCR       EQU (0xFFF803DC) ;- (CAN0_MB14) MailBox Control Register
AT91C_CAN0_MB14_MFID      EQU (0xFFF803CC) ;- (CAN0_MB14) MailBox Family ID Register
AT91C_CAN0_MB14_MAM       EQU (0xFFF803C4) ;- (CAN0_MB14) MailBox Acceptance Mask Register
// - ========== Register definition for CAN0_MB15 peripheral ========== 
AT91C_CAN0_MB15_MDH       EQU (0xFFF803F8) ;- (CAN0_MB15) MailBox Data High Register
AT91C_CAN0_MB15_MMR       EQU (0xFFF803E0) ;- (CAN0_MB15) MailBox Mode Register
AT91C_CAN0_MB15_MCR       EQU (0xFFF803FC) ;- (CAN0_MB15) MailBox Control Register
AT91C_CAN0_MB15_MAM       EQU (0xFFF803E4) ;- (CAN0_MB15) MailBox Acceptance Mask Register
