tsugli/stm32/common/rtos/portable/GCC/AT91SAM7A3/ioat91sam7a3.h
AT91C_CAN0_MB15_MID       EQU (0xFFF803E8) ;- (CAN0_MB15) MailBox ID Register
AT91C_CAN0_MB15_MFID      EQU (0xFFF803EC) ;- (CAN0_MB15) MailBox Family ID Register
AT91C_CAN0_MB15_MSR       EQU (0xFFF803F0) ;- (CAN0_MB15) MailBox Status Register
AT91C_CAN0_MB15_MDL       EQU (0xFFF803F4) ;- (CAN0_MB15) MailBox Data Low Register
// - ========== Register definition for CAN0 peripheral ========== 
AT91C_CAN0_BR             EQU (0xFFF80014) ;- (CAN0) Baudrate Register
AT91C_CAN0_TIMESTP        EQU (0xFFF8001C) ;- (CAN0) Time Stamp Register
AT91C_CAN0_IER            EQU (0xFFF80004) ;- (CAN0) Interrupt Enable Register
AT91C_CAN0_MR             EQU (0xFFF80000) ;- (CAN0) Mode Register
AT91C_CAN0_TCR            EQU (0xFFF80024) ;- (CAN0) Transfer Command Register
AT91C_CAN0_ACR            EQU (0xFFF80028) ;- (CAN0) Abort Command Register
AT91C_CAN0_IDR            EQU (0xFFF80008) ;- (CAN0) Interrupt Disable Register
AT91C_CAN0_IMR            EQU (0xFFF8000C) ;- (CAN0) Interrupt Mask Register
AT91C_CAN0_TIM            EQU (0xFFF80018) ;- (CAN0) Timer Register
AT91C_CAN0_VR             EQU (0xFFF800FC) ;- (CAN0) Version Register
AT91C_CAN0_ECR            EQU (0xFFF80020) ;- (CAN0) Error Counter Register
AT91C_CAN0_SR             EQU (0xFFF80010) ;- (CAN0) Status Register
// - ========== Register definition for CAN1_MB0 peripheral ========== 
AT91C_CAN1_MB0_MFID       EQU (0xFFF8420C) ;- (CAN1_MB0) MailBox Family ID Register
AT91C_CAN1_MB0_MDL        EQU (0xFFF84214) ;- (CAN1_MB0) MailBox Data Low Register
AT91C_CAN1_MB0_MID        EQU (0xFFF84208) ;- (CAN1_MB0) MailBox ID Register
AT91C_CAN1_MB0_MMR        EQU (0xFFF84200) ;- (CAN1_MB0) MailBox Mode Register
AT91C_CAN1_MB0_MAM        EQU (0xFFF84204) ;- (CAN1_MB0) MailBox Acceptance Mask Register
AT91C_CAN1_MB0_MSR        EQU (0xFFF84210) ;- (CAN1_MB0) MailBox Status Register
AT91C_CAN1_MB0_MDH        EQU (0xFFF84218) ;- (CAN1_MB0) MailBox Data High Register
AT91C_CAN1_MB0_MCR        EQU (0xFFF8421C) ;- (CAN1_MB0) MailBox Control Register
// - ========== Register definition for CAN1_MB1 peripheral ========== 
AT91C_CAN1_MB1_MFID       EQU (0xFFF8422C) ;- (CAN1_MB1) MailBox Family ID Register
AT91C_CAN1_MB1_MSR        EQU (0xFFF84230) ;- (CAN1_MB1) MailBox Status Register
AT91C_CAN1_MB1_MMR        EQU (0xFFF84220) ;- (CAN1_MB1) MailBox Mode Register
AT91C_CAN1_MB1_MDH        EQU (0xFFF84238) ;- (CAN1_MB1) MailBox Data High Register
AT91C_CAN1_MB1_MID        EQU (0xFFF84228) ;- (CAN1_MB1) MailBox ID Register
AT91C_CAN1_MB1_MDL        EQU (0xFFF84234) ;- (CAN1_MB1) MailBox Data Low Register
AT91C_CAN1_MB1_MCR        EQU (0xFFF8423C) ;- (CAN1_MB1) MailBox Control Register
AT91C_CAN1_MB1_MAM        EQU (0xFFF84224) ;- (CAN1_MB1) MailBox Acceptance Mask Register
// - ========== Register definition for CAN1_MB2 peripheral ========== 
AT91C_CAN1_MB2_MSR        EQU (0xFFF84250) ;- (CAN1_MB2) MailBox Status Register
AT91C_CAN1_MB2_MMR        EQU (0xFFF84240) ;- (CAN1_MB2) MailBox Mode Register
AT91C_CAN1_MB2_MAM        EQU (0xFFF84244) ;- (CAN1_MB2) MailBox Acceptance Mask Register
AT91C_CAN1_MB2_MID        EQU (0xFFF84248) ;- (CAN1_MB2) MailBox ID Register
AT91C_CAN1_MB2_MFID       EQU (0xFFF8424C) ;- (CAN1_MB2) MailBox Family ID Register
AT91C_CAN1_MB2_MDL        EQU (0xFFF84254) ;- (CAN1_MB2) MailBox Data Low Register
AT91C_CAN1_MB2_MDH        EQU (0xFFF84258) ;- (CAN1_MB2) MailBox Data High Register
AT91C_CAN1_MB2_MCR        EQU (0xFFF8425C) ;- (CAN1_MB2) MailBox Control Register
// - ========== Register definition for CAN1_MB3 peripheral ========== 
AT91C_CAN1_MB3_MCR        EQU (0xFFF8427C) ;- (CAN1_MB3) MailBox Control Register
AT91C_CAN1_MB3_MDH        EQU (0xFFF84278) ;- (CAN1_MB3) MailBox Data High Register
AT91C_CAN1_MB3_MAM        EQU (0xFFF84264) ;- (CAN1_MB3) MailBox Acceptance Mask Register
AT91C_CAN1_MB3_MDL        EQU (0xFFF84274) ;- (CAN1_MB3) MailBox Data Low Register
AT91C_CAN1_MB3_MMR        EQU (0xFFF84260) ;- (CAN1_MB3) MailBox Mode Register
AT91C_CAN1_MB3_MSR        EQU (0xFFF84270) ;- (CAN1_MB3) MailBox Status Register
AT91C_CAN1_MB3_MFID       EQU (0xFFF8426C) ;- (CAN1_MB3) MailBox Family ID Register
AT91C_CAN1_MB3_MID        EQU (0xFFF84268) ;- (CAN1_MB3) MailBox ID Register
// - ========== Register definition for CAN1_MB4 peripheral ========== 
AT91C_CAN1_MB4_MCR        EQU (0xFFF8429C) ;- (CAN1_MB4) MailBox Control Register
AT91C_CAN1_MB4_MDH        EQU (0xFFF84298) ;- (CAN1_MB4) MailBox Data High Register
AT91C_CAN1_MB4_MID        EQU (0xFFF84288) ;- (CAN1_MB4) MailBox ID Register
AT91C_CAN1_MB4_MDL        EQU (0xFFF84294) ;- (CAN1_MB4) MailBox Data Low Register
AT91C_CAN1_MB4_MFID       EQU (0xFFF8428C) ;- (CAN1_MB4) MailBox Family ID Register
AT91C_CAN1_MB4_MAM        EQU (0xFFF84284) ;- (CAN1_MB4) MailBox Acceptance Mask Register
AT91C_CAN1_MB4_MSR        EQU (0xFFF84290) ;- (CAN1_MB4) MailBox Status Register
AT91C_CAN1_MB4_MMR        EQU (0xFFF84280) ;- (CAN1_MB4) MailBox Mode Register
// - ========== Register definition for CAN1_MB5 peripheral ========== 
AT91C_CAN1_MB5_MCR        EQU (0xFFF842BC) ;- (CAN1_MB5) MailBox Control Register
AT91C_CAN1_MB5_MSR        EQU (0xFFF842B0) ;- (CAN1_MB5) MailBox Status Register
AT91C_CAN1_MB5_MMR        EQU (0xFFF842A0) ;- (CAN1_MB5) MailBox Mode Register
AT91C_CAN1_MB5_MDL        EQU (0xFFF842B4) ;- (CAN1_MB5) MailBox Data Low Register
AT91C_CAN1_MB5_MAM        EQU (0xFFF842A4) ;- (CAN1_MB5) MailBox Acceptance Mask Register
AT91C_CAN1_MB5_MID        EQU (0xFFF842A8) ;- (CAN1_MB5) MailBox ID Register
AT91C_CAN1_MB5_MDH        EQU (0xFFF842B8) ;- (CAN1_MB5) MailBox Data High Register
AT91C_CAN1_MB5_MFID       EQU (0xFFF842AC) ;- (CAN1_MB5) MailBox Family ID Register
// - ========== Register definition for CAN1_MB6 peripheral ========== 
AT91C_CAN1_MB6_MDH        EQU (0xFFF842D8) ;- (CAN1_MB6) MailBox Data High Register
AT91C_CAN1_MB6_MDL        EQU (0xFFF842D4) ;- (CAN1_MB6) MailBox Data Low Register
AT91C_CAN1_MB6_MAM        EQU (0xFFF842C4) ;- (CAN1_MB6) MailBox Acceptance Mask Register
AT91C_CAN1_MB6_MCR        EQU (0xFFF842DC) ;- (CAN1_MB6) MailBox Control Register
AT91C_CAN1_MB6_MMR        EQU (0xFFF842C0) ;- (CAN1_MB6) MailBox Mode Register
AT91C_CAN1_MB6_MID        EQU (0xFFF842C8) ;- (CAN1_MB6) MailBox ID Register
AT91C_CAN1_MB6_MSR        EQU (0xFFF842D0) ;- (CAN1_MB6) MailBox Status Register
AT91C_CAN1_MB6_MFID       EQU (0xFFF842CC) ;- (CAN1_MB6) MailBox Family ID Register
// - ========== Register definition for CAN1_MB7 peripheral ========== 
AT91C_CAN1_MB7_MDH        EQU (0xFFF842F8) ;- (CAN1_MB7) MailBox Data High Register
AT91C_CAN1_MB7_MDL        EQU (0xFFF842F4) ;- (CAN1_MB7) MailBox Data Low Register
AT91C_CAN1_MB7_MID        EQU (0xFFF842E8) ;- (CAN1_MB7) MailBox ID Register
AT91C_CAN1_MB7_MSR        EQU (0xFFF842F0) ;- (CAN1_MB7) MailBox Status Register
AT91C_CAN1_MB7_MFID       EQU (0xFFF842EC) ;- (CAN1_MB7) MailBox Family ID Register
AT91C_CAN1_MB7_MAM        EQU (0xFFF842E4) ;- (CAN1_MB7) MailBox Acceptance Mask Register
AT91C_CAN1_MB7_MMR        EQU (0xFFF842E0) ;- (CAN1_MB7) MailBox Mode Register
AT91C_CAN1_MB7_MCR        EQU (0xFFF842FC) ;- (CAN1_MB7) MailBox Control Register
// - ========== Register definition for CAN1_MB8 peripheral ========== 
AT91C_CAN1_MB8_MCR        EQU (0xFFF8431C) ;- (CAN1_MB8) MailBox Control Register
AT91C_CAN1_MB8_MFID       EQU (0xFFF8430C) ;- (CAN1_MB8) MailBox Family ID Register
AT91C_CAN1_MB8_MSR        EQU (0xFFF84310) ;- (CAN1_MB8) MailBox Status Register
AT91C_CAN1_MB8_MAM        EQU (0xFFF84304) ;- (CAN1_MB8) MailBox Acceptance Mask Register
AT91C_CAN1_MB8_MDL        EQU (0xFFF84314) ;- (CAN1_MB8) MailBox Data Low Register
AT91C_CAN1_MB8_MID        EQU (0xFFF84308) ;- (CAN1_MB8) MailBox ID Register
AT91C_CAN1_MB8_MDH        EQU (0xFFF84318) ;- (CAN1_MB8) MailBox Data High Register
AT91C_CAN1_MB8_MMR        EQU (0xFFF84300) ;- (CAN1_MB8) MailBox Mode Register
// - ========== Register definition for CAN1_MB9 peripheral ========== 
AT91C_CAN1_MB9_MDH        EQU (0xFFF84338) ;- (CAN1_MB9) MailBox Data High Register
AT91C_CAN1_MB9_MDL        EQU (0xFFF84334) ;- (CAN1_MB9) MailBox Data Low Register
AT91C_CAN1_MB9_MFID       EQU (0xFFF8432C) ;- (CAN1_MB9) MailBox Family ID Register
AT91C_CAN1_MB9_MMR        EQU (0xFFF84320) ;- (CAN1_MB9) MailBox Mode Register
AT91C_CAN1_MB9_MAM        EQU (0xFFF84324) ;- (CAN1_MB9) MailBox Acceptance Mask Register
AT91C_CAN1_MB9_MID        EQU (0xFFF84328) ;- (CAN1_MB9) MailBox ID Register
AT91C_CAN1_MB9_MCR        EQU (0xFFF8433C) ;- (CAN1_MB9) MailBox Control Register
AT91C_CAN1_MB9_MSR        EQU (0xFFF84330) ;- (CAN1_MB9) MailBox Status Register
// - ========== Register definition for CAN1_MB10 peripheral ========== 
AT91C_CAN1_MB10_MFID      EQU (0xFFF8434C) ;- (CAN1_MB10) MailBox Family ID Register
AT91C_CAN1_MB10_MSR       EQU (0xFFF84350) ;- (CAN1_MB10) MailBox Status Register
AT91C_CAN1_MB10_MDL       EQU (0xFFF84354) ;- (CAN1_MB10) MailBox Data Low Register
AT91C_CAN1_MB10_MMR       EQU (0xFFF84340) ;- (CAN1_MB10) MailBox Mode Register
AT91C_CAN1_MB10_MCR       EQU (0xFFF8435C) ;- (CAN1_MB10) MailBox Control Register
AT91C_CAN1_MB10_MAM       EQU (0xFFF84344) ;- (CAN1_MB10) MailBox Acceptance Mask Register
AT91C_CAN1_MB10_MID       EQU (0xFFF84348) ;- (CAN1_MB10) MailBox ID Register
AT91C_CAN1_MB10_MDH       EQU (0xFFF84358) ;- (CAN1_MB10) MailBox Data High Register
// - ========== Register definition for CAN1_MB11 peripheral ========== 
AT91C_CAN1_MB11_MMR       EQU (0xFFF84360) ;- (CAN1_MB11) MailBox Mode Register
AT91C_CAN1_MB11_MDL       EQU (0xFFF84374) ;- (CAN1_MB11) MailBox Data Low Register
AT91C_CAN1_MB11_MAM       EQU (0xFFF84364) ;- (CAN1_MB11) MailBox Acceptance Mask Register
AT91C_CAN1_MB11_MID       EQU (0xFFF84368) ;- (CAN1_MB11) MailBox ID Register
AT91C_CAN1_MB11_MCR       EQU (0xFFF8437C) ;- (CAN1_MB11) MailBox Control Register
AT91C_CAN1_MB11_MDH       EQU (0xFFF84378) ;- (CAN1_MB11) MailBox Data High Register
AT91C_CAN1_MB11_MSR       EQU (0xFFF84370) ;- (CAN1_MB11) MailBox Status Register
AT91C_CAN1_MB11_MFID      EQU (0xFFF8436C) ;- (CAN1_MB11) MailBox Family ID Register
// - ========== Register definition for CAN1_MB12 peripheral ========== 
AT91C_CAN1_MB12_MFID      EQU (0xFFF8438C) ;- (CAN1_MB12) MailBox Family ID Register
AT91C_CAN1_MB12_MAM       EQU (0xFFF84384) ;- (CAN1_MB12) MailBox Acceptance Mask Register
AT91C_CAN1_MB12_MDH       EQU (0xFFF84398) ;- (CAN1_MB12) MailBox Data High Register
AT91C_CAN1_MB12_MMR       EQU (0xFFF84380) ;- (CAN1_MB12) MailBox Mode Register
AT91C_CAN1_MB12_MID       EQU (0xFFF84388) ;- (CAN1_MB12) MailBox ID Register
AT91C_CAN1_MB12_MCR       EQU (0xFFF8439C) ;- (CAN1_MB12) MailBox Control Register
AT91C_CAN1_MB12_MDL       EQU (0xFFF84394) ;- (CAN1_MB12) MailBox Data Low Register
AT91C_CAN1_MB12_MSR       EQU (0xFFF84390) ;- (CAN1_MB12) MailBox Status Register
// - ========== Register definition for CAN1_MB13 peripheral ========== 
AT91C_CAN1_MB13_MDL       EQU (0xFFF843B4) ;- (CAN1_MB13) MailBox Data Low Register
AT91C_CAN1_MB13_MSR       EQU (0xFFF843B0) ;- (CAN1_MB13) MailBox Status Register
AT91C_CAN1_MB13_MFID      EQU (0xFFF843AC) ;- (CAN1_MB13) MailBox Family ID Register
AT91C_CAN1_MB13_MAM       EQU (0xFFF843A4) ;- (CAN1_MB13) MailBox Acceptance Mask Register
AT91C_CAN1_MB13_MMR       EQU (0xFFF843A0) ;- (CAN1_MB13) MailBox Mode Register
AT91C_CAN1_MB13_MCR       EQU (0xFFF843BC) ;- (CAN1_MB13) MailBox Control Register
AT91C_CAN1_MB13_MDH       EQU (0xFFF843B8) ;- (CAN1_MB13) MailBox Data High Register
AT91C_CAN1_MB13_MID       EQU (0xFFF843A8) ;- (CAN1_MB13) MailBox ID Register
// - ========== Register definition for CAN1_MB14 peripheral ========== 
AT91C_CAN1_MB14_MCR       EQU (0xFFF843DC) ;- (CAN1_MB14) MailBox Control Register
AT91C_CAN1_MB14_MID       EQU (0xFFF843C8) ;- (CAN1_MB14) MailBox ID Register
AT91C_CAN1_MB14_MMR       EQU (0xFFF843C0) ;- (CAN1_MB14) MailBox Mode Register
AT91C_CAN1_MB14_MDH       EQU (0xFFF843D8) ;- (CAN1_MB14) MailBox Data High Register
AT91C_CAN1_MB14_MSR       EQU (0xFFF843D0) ;- (CAN1_MB14) MailBox Status Register
AT91C_CAN1_MB14_MFID      EQU (0xFFF843CC) ;- (CAN1_MB14) MailBox Family ID Register
AT91C_CAN1_MB14_MDL       EQU (0xFFF843D4) ;- (CAN1_MB14) MailBox Data Low Register
AT91C_CAN1_MB14_MAM       EQU (0xFFF843C4) ;- (CAN1_MB14) MailBox Acceptance Mask Register
// - ========== Register definition for CAN1_MB15 peripheral ========== 
AT91C_CAN1_MB15_MSR       EQU (0xFFF843F0) ;- (CAN1_MB15) MailBox Status Register
AT91C_CAN1_MB15_MDL       EQU (0xFFF843F4) ;- (CAN1_MB15) MailBox Data Low Register
AT91C_CAN1_MB15_MDH       EQU (0xFFF843F8) ;- (CAN1_MB15) MailBox Data High Register
AT91C_CAN1_MB15_MMR       EQU (0xFFF843E0) ;- (CAN1_MB15) MailBox Mode Register
AT91C_CAN1_MB15_MAM       EQU (0xFFF843E4) ;- (CAN1_MB15) MailBox Acceptance Mask Register
AT91C_CAN1_MB15_MFID      EQU (0xFFF843EC) ;- (CAN1_MB15) MailBox Family ID Register
AT91C_CAN1_MB15_MCR       EQU (0xFFF843FC) ;- (CAN1_MB15) MailBox Control Register
AT91C_CAN1_MB15_MID       EQU (0xFFF843E8) ;- (CAN1_MB15) MailBox ID Register
// - ========== Register definition for CAN1 peripheral ========== 
AT91C_CAN1_ECR            EQU (0xFFF84020) ;- (CAN1) Error Counter Register
AT91C_CAN1_BR             EQU (0xFFF84014) ;- (CAN1) Baudrate Register
AT91C_CAN1_IDR            EQU (0xFFF84008) ;- (CAN1) Interrupt Disable Register
AT91C_CAN1_ACR            EQU (0xFFF84028) ;- (CAN1) Abort Command Register
AT91C_CAN1_IMR            EQU (0xFFF8400C) ;- (CAN1) Interrupt Mask Register
AT91C_CAN1_TCR            EQU (0xFFF84024) ;- (CAN1) Transfer Command Register
AT91C_CAN1_SR             EQU (0xFFF84010) ;- (CAN1) Status Register
AT91C_CAN1_TIM            EQU (0xFFF84018) ;- (CAN1) Timer Register
AT91C_CAN1_VR             EQU (0xFFF840FC) ;- (CAN1) Version Register
AT91C_CAN1_MR             EQU (0xFFF84000) ;- (CAN1) Mode Register
AT91C_CAN1_IER            EQU (0xFFF84004) ;- (CAN1) Interrupt Enable Register
AT91C_CAN1_TIMESTP        EQU (0xFFF8401C) ;- (CAN1) Time Stamp Register
// - ========== Register definition for TC0 peripheral ========== 
AT91C_TC0_SR              EQU (0xFFFA0020) ;- (TC0) Status Register
AT91C_TC0_RC              EQU (0xFFFA001C) ;- (TC0) Register C
AT91C_TC0_RB              EQU (0xFFFA0018) ;- (TC0) Register B
AT91C_TC0_CCR             EQU (0xFFFA0000) ;- (TC0) Channel Control Register
AT91C_TC0_CMR             EQU (0xFFFA0004) ;- (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC0_IER             EQU (0xFFFA0024) ;- (TC0) Interrupt Enable Register
AT91C_TC0_RA              EQU (0xFFFA0014) ;- (TC0) Register A
AT91C_TC0_IDR             EQU (0xFFFA0028) ;- (TC0) Interrupt Disable Register
AT91C_TC0_CV              EQU (0xFFFA0010) ;- (TC0) Counter Value
AT91C_TC0_IMR             EQU (0xFFFA002C) ;- (TC0) Interrupt Mask Register
// - ========== Register definition for TC1 peripheral ========== 
AT91C_TC1_RB              EQU (0xFFFA0058) ;- (TC1) Register B
AT91C_TC1_CCR             EQU (0xFFFA0040) ;- (TC1) Channel Control Register
AT91C_TC1_IER             EQU (0xFFFA0064) ;- (TC1) Interrupt Enable Register
AT91C_TC1_IDR             EQU (0xFFFA0068) ;- (TC1) Interrupt Disable Register
AT91C_TC1_SR              EQU (0xFFFA0060) ;- (TC1) Status Register
AT91C_TC1_CMR             EQU (0xFFFA0044) ;- (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC1_RA              EQU (0xFFFA0054) ;- (TC1) Register A
AT91C_TC1_RC              EQU (0xFFFA005C) ;- (TC1) Register C
AT91C_TC1_IMR             EQU (0xFFFA006C) ;- (TC1) Interrupt Mask Register
AT91C_TC1_CV              EQU (0xFFFA0050) ;- (TC1) Counter Value
// - ========== Register definition for TC2 peripheral ========== 
AT91C_TC2_CMR             EQU (0xFFFA0084) ;- (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC2_CCR             EQU (0xFFFA0080) ;- (TC2) Channel Control Register
AT91C_TC2_CV              EQU (0xFFFA0090) ;- (TC2) Counter Value
AT91C_TC2_RA              EQU (0xFFFA0094) ;- (TC2) Register A
AT91C_TC2_RB              EQU (0xFFFA0098) ;- (TC2) Register B
AT91C_TC2_IDR             EQU (0xFFFA00A8) ;- (TC2) Interrupt Disable Register
AT91C_TC2_IMR             EQU (0xFFFA00AC) ;- (TC2) Interrupt Mask Register
AT91C_TC2_RC              EQU (0xFFFA009C) ;- (TC2) Register C
AT91C_TC2_IER             EQU (0xFFFA00A4) ;- (TC2) Interrupt Enable Register
AT91C_TC2_SR              EQU (0xFFFA00A0) ;- (TC2) Status Register
// - ========== Register definition for TCB0 peripheral ========== 
AT91C_TCB0_BMR            EQU (0xFFFA00C4) ;- (TCB0) TC Block Mode Register
AT91C_TCB0_BCR            EQU (0xFFFA00C0) ;- (TCB0) TC Block Control Register
// - ========== Register definition for TC3 peripheral ========== 
AT91C_TC3_IMR             EQU (0xFFFA402C) ;- (TC3) Interrupt Mask Register
AT91C_TC3_CMR             EQU (0xFFFA4004) ;- (TC3) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC3_IDR             EQU (0xFFFA4028) ;- (TC3) Interrupt Disable Register
AT91C_TC3_CCR             EQU (0xFFFA4000) ;- (TC3) Channel Control Register
AT91C_TC3_RA              EQU (0xFFFA4014) ;- (TC3) Register A
AT91C_TC3_RB              EQU (0xFFFA4018) ;- (TC3) Register B
AT91C_TC3_CV              EQU (0xFFFA4010) ;- (TC3) Counter Value
AT91C_TC3_SR              EQU (0xFFFA4020) ;- (TC3) Status Register
AT91C_TC3_IER             EQU (0xFFFA4024) ;- (TC3) Interrupt Enable Register
AT91C_TC3_RC              EQU (0xFFFA401C) ;- (TC3) Register C
// - ========== Register definition for TC4 peripheral ========== 
AT91C_TC4_SR              EQU (0xFFFA4060) ;- (TC4) Status Register
AT91C_TC4_RA              EQU (0xFFFA4054) ;- (TC4) Register A
AT91C_TC4_CV              EQU (0xFFFA4050) ;- (TC4) Counter Value
AT91C_TC4_CMR             EQU (0xFFFA4044) ;- (TC4) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC4_RB              EQU (0xFFFA4058) ;- (TC4) Register B
AT91C_TC4_CCR             EQU (0xFFFA4040) ;- (TC4) Channel Control Register
AT91C_TC4_IER             EQU (0xFFFA4064) ;- (TC4) Interrupt Enable Register
AT91C_TC4_IMR             EQU (0xFFFA406C) ;- (TC4) Interrupt Mask Register
AT91C_TC4_RC              EQU (0xFFFA405C) ;- (TC4) Register C
AT91C_TC4_IDR             EQU (0xFFFA4068) ;- (TC4) Interrupt Disable Register
// - ========== Register definition for TC5 peripheral ========== 
AT91C_TC5_CMR             EQU (0xFFFA4084) ;- (TC5) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC5_IDR             EQU (0xFFFA40A8) ;- (TC5) Interrupt Disable Register
AT91C_TC5_CCR             EQU (0xFFFA4080) ;- (TC5) Channel Control Register
AT91C_TC5_RB              EQU (0xFFFA4098) ;- (TC5) Register B
AT91C_TC5_IMR             EQU (0xFFFA40AC) ;- (TC5) Interrupt Mask Register
AT91C_TC5_CV              EQU (0xFFFA4090) ;- (TC5) Counter Value
AT91C_TC5_RC              EQU (0xFFFA409C) ;- (TC5) Register C
AT91C_TC5_SR              EQU (0xFFFA40A0) ;- (TC5) Status Register
AT91C_TC5_IER             EQU (0xFFFA40A4) ;- (TC5) Interrupt Enable Register
AT91C_TC5_RA              EQU (0xFFFA4094) ;- (TC5) Register A
// - ========== Register definition for TCB1 peripheral ========== 
AT91C_TCB1_BMR            EQU (0xFFFA40C4) ;- (TCB1) TC Block Mode Register
AT91C_TCB1_BCR            EQU (0xFFFA40C0) ;- (TCB1) TC Block Control Register
// - ========== Register definition for TC6 peripheral ========== 
AT91C_TC6_IDR             EQU (0xFFFA8028) ;- (TC6) Interrupt Disable Register
AT91C_TC6_RA              EQU (0xFFFA8014) ;- (TC6) Register A
AT91C_TC6_IER             EQU (0xFFFA8024) ;- (TC6) Interrupt Enable Register
AT91C_TC6_RB              EQU (0xFFFA8018) ;- (TC6) Register B
AT91C_TC6_CMR             EQU (0xFFFA8004) ;- (TC6) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC6_CCR             EQU (0xFFFA8000) ;- (TC6) Channel Control Register
AT91C_TC6_CV              EQU (0xFFFA8010) ;- (TC6) Counter Value
AT91C_TC6_RC              EQU (0xFFFA801C) ;- (TC6) Register C
AT91C_TC6_IMR             EQU (0xFFFA802C) ;- (TC6) Interrupt Mask Register
AT91C_TC6_SR              EQU (0xFFFA8020) ;- (TC6) Status Register
// - ========== Register definition for TC7 peripheral ========== 
AT91C_TC7_IMR             EQU (0xFFFA806C) ;- (TC7) Interrupt Mask Register
AT91C_TC7_SR              EQU (0xFFFA8060) ;- (TC7) Status Register
AT91C_TC7_IDR             EQU (0xFFFA8068) ;- (TC7) Interrupt Disable Register
AT91C_TC7_CMR             EQU (0xFFFA8044) ;- (TC7) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC7_CV              EQU (0xFFFA8050) ;- (TC7) Counter Value
AT91C_TC7_RA              EQU (0xFFFA8054) ;- (TC7) Register A
AT91C_TC7_RB              EQU (0xFFFA8058) ;- (TC7) Register B
AT91C_TC7_RC              EQU (0xFFFA805C) ;- (TC7) Register C
AT91C_TC7_CCR             EQU (0xFFFA8040) ;- (TC7) Channel Control Register
AT91C_TC7_IER             EQU (0xFFFA8064) ;- (TC7) Interrupt Enable Register
// - ========== Register definition for TC8 peripheral ========== 
AT91C_TC8_RA              EQU (0xFFFA8094) ;- (TC8) Register A
AT91C_TC8_IDR             EQU (0xFFFA80A8) ;- (TC8) Interrupt Disable Register
AT91C_TC8_RC              EQU (0xFFFA809C) ;- (TC8) Register C
AT91C_TC8_CCR             EQU (0xFFFA8080) ;- (TC8) Channel Control Register
AT91C_TC8_SR              EQU (0xFFFA80A0) ;- (TC8) Status Register
AT91C_TC8_RB              EQU (0xFFFA8098) ;- (TC8) Register B
AT91C_TC8_IMR             EQU (0xFFFA80AC) ;- (TC8) Interrupt Mask Register
AT91C_TC8_CMR             EQU (0xFFFA8084) ;- (TC8) Channel Mode Register (Capture Mode / Waveform Mode)
AT91C_TC8_IER             EQU (0xFFFA80A4) ;- (TC8) Interrupt Enable Register
AT91C_TC8_CV              EQU (0xFFFA8090) ;- (TC8) Counter Value
// - ========== Register definition for TCB2 peripheral ========== 
AT91C_TCB2_BMR            EQU (0xFFFA80C4) ;- (TCB2) TC Block Mode Register
AT91C_TCB2_BCR            EQU (0xFFFA80C0) ;- (TCB2) TC Block Control Register
// - ========== Register definition for PDC_MCI peripheral ========== 
AT91C_MCI_PTSR            EQU (0xFFFAC124) ;- (PDC_MCI) PDC Transfer Status Register
AT91C_MCI_RPR             EQU (0xFFFAC100) ;- (PDC_MCI) Receive Pointer Register
AT91C_MCI_RNCR            EQU (0xFFFAC114) ;- (PDC_MCI) Receive Next Counter Register
AT91C_MCI_RCR             EQU (0xFFFAC104) ;- (PDC_MCI) Receive Counter Register
AT91C_MCI_PTCR            EQU (0xFFFAC120) ;- (PDC_MCI) PDC Transfer Control Register
AT91C_MCI_TPR             EQU (0xFFFAC108) ;- (PDC_MCI) Transmit Pointer Register
AT91C_MCI_RNPR            EQU (0xFFFAC110) ;- (PDC_MCI) Receive Next Pointer Register
AT91C_MCI_TNPR            EQU (0xFFFAC118) ;- (PDC_MCI) Transmit Next Pointer Register
AT91C_MCI_TCR             EQU (0xFFFAC10C) ;- (PDC_MCI) Transmit Counter Register
AT91C_MCI_TNCR            EQU (0xFFFAC11C) ;- (PDC_MCI) Transmit Next Counter Register
// - ========== Register definition for MCI peripheral ========== 
AT91C_MCI_TDR             EQU (0xFFFAC034) ;- (MCI) MCI Transmit Data Register
AT91C_MCI_IDR             EQU (0xFFFAC048) ;- (MCI) MCI Interrupt Disable Register
AT91C_MCI_SR              EQU (0xFFFAC040) ;- (MCI) MCI Status Register
AT91C_MCI_CMDR            EQU (0xFFFAC014) ;- (MCI) MCI Command Register
AT91C_MCI_DTOR            EQU (0xFFFAC008) ;- (MCI) MCI Data Timeout Register
AT91C_MCI_IER             EQU (0xFFFAC044) ;- (MCI) MCI Interrupt Enable Register
AT91C_MCI_ARGR            EQU (0xFFFAC010) ;- (MCI) MCI Argument Register
AT91C_MCI_SDCR            EQU (0xFFFAC00C) ;- (MCI) MCI SD Card Register
AT91C_MCI_RDR             EQU (0xFFFAC030) ;- (MCI) MCI Receive Data Register
AT91C_MCI_IMR             EQU (0xFFFAC04C) ;- (MCI) MCI Interrupt Mask Register
AT91C_MCI_MR              EQU (0xFFFAC004) ;- (MCI) MCI Mode Register
AT91C_MCI_RSPR            EQU (0xFFFAC020) ;- (MCI) MCI Response Register
AT91C_MCI_CR              EQU (0xFFFAC000) ;- (MCI) MCI Control Register
// - ========== Register definition for UDP peripheral ========== 
