tsugli/stm32/common/rtos/portable/GCC/AT91SAM7A3/ioat91sam7a3.h
AT91C_UDP_IMR             EQU (0xFFFB0018) ;- (UDP) Interrupt Mask Register
AT91C_UDP_FADDR           EQU (0xFFFB0008) ;- (UDP) Function Address Register
AT91C_UDP_NUM             EQU (0xFFFB0000) ;- (UDP) Frame Number Register
AT91C_UDP_FDR             EQU (0xFFFB0050) ;- (UDP) Endpoint FIFO Data Register
AT91C_UDP_ISR             EQU (0xFFFB001C) ;- (UDP) Interrupt Status Register
AT91C_UDP_CSR             EQU (0xFFFB0030) ;- (UDP) Endpoint Control and Status Register
AT91C_UDP_IDR             EQU (0xFFFB0014) ;- (UDP) Interrupt Disable Register
AT91C_UDP_ICR             EQU (0xFFFB0020) ;- (UDP) Interrupt Clear Register
AT91C_UDP_RSTEP           EQU (0xFFFB0028) ;- (UDP) Reset Endpoint Register
AT91C_UDP_TXVC            EQU (0xFFFB0074) ;- (UDP) Transceiver Control Register
AT91C_UDP_GLBSTATE        EQU (0xFFFB0004) ;- (UDP) Global State Register
AT91C_UDP_IER             EQU (0xFFFB0010) ;- (UDP) Interrupt Enable Register
// - ========== Register definition for TWI peripheral ========== 
AT91C_TWI_IER             EQU (0xFFFB8024) ;- (TWI) Interrupt Enable Register
AT91C_TWI_CR              EQU (0xFFFB8000) ;- (TWI) Control Register
AT91C_TWI_SR              EQU (0xFFFB8020) ;- (TWI) Status Register
AT91C_TWI_IMR             EQU (0xFFFB802C) ;- (TWI) Interrupt Mask Register
AT91C_TWI_THR             EQU (0xFFFB8034) ;- (TWI) Transmit Holding Register
AT91C_TWI_IDR             EQU (0xFFFB8028) ;- (TWI) Interrupt Disable Register
AT91C_TWI_IADR            EQU (0xFFFB800C) ;- (TWI) Internal Address Register
AT91C_TWI_MMR             EQU (0xFFFB8004) ;- (TWI) Master Mode Register
AT91C_TWI_CWGR            EQU (0xFFFB8010) ;- (TWI) Clock Waveform Generator Register
AT91C_TWI_RHR             EQU (0xFFFB8030) ;- (TWI) Receive Holding Register
// - ========== Register definition for PDC_US0 peripheral ========== 
AT91C_US0_TNPR            EQU (0xFFFC0118) ;- (PDC_US0) Transmit Next Pointer Register
AT91C_US0_RNPR            EQU (0xFFFC0110) ;- (PDC_US0) Receive Next Pointer Register
AT91C_US0_TCR             EQU (0xFFFC010C) ;- (PDC_US0) Transmit Counter Register
AT91C_US0_PTCR            EQU (0xFFFC0120) ;- (PDC_US0) PDC Transfer Control Register
AT91C_US0_PTSR            EQU (0xFFFC0124) ;- (PDC_US0) PDC Transfer Status Register
AT91C_US0_TNCR            EQU (0xFFFC011C) ;- (PDC_US0) Transmit Next Counter Register
AT91C_US0_TPR             EQU (0xFFFC0108) ;- (PDC_US0) Transmit Pointer Register
AT91C_US0_RCR             EQU (0xFFFC0104) ;- (PDC_US0) Receive Counter Register
AT91C_US0_RPR             EQU (0xFFFC0100) ;- (PDC_US0) Receive Pointer Register
AT91C_US0_RNCR            EQU (0xFFFC0114) ;- (PDC_US0) Receive Next Counter Register
// - ========== Register definition for US0 peripheral ========== 
AT91C_US0_BRGR            EQU (0xFFFC0020) ;- (US0) Baud Rate Generator Register
AT91C_US0_NER             EQU (0xFFFC0044) ;- (US0) Nb Errors Register
AT91C_US0_CR              EQU (0xFFFC0000) ;- (US0) Control Register
AT91C_US0_IMR             EQU (0xFFFC0010) ;- (US0) Interrupt Mask Register
AT91C_US0_FIDI            EQU (0xFFFC0040) ;- (US0) FI_DI_Ratio Register
AT91C_US0_TTGR            EQU (0xFFFC0028) ;- (US0) Transmitter Time-guard Register
AT91C_US0_MR              EQU (0xFFFC0004) ;- (US0) Mode Register
AT91C_US0_RTOR            EQU (0xFFFC0024) ;- (US0) Receiver Time-out Register
AT91C_US0_CSR             EQU (0xFFFC0014) ;- (US0) Channel Status Register
AT91C_US0_RHR             EQU (0xFFFC0018) ;- (US0) Receiver Holding Register
AT91C_US0_IDR             EQU (0xFFFC000C) ;- (US0) Interrupt Disable Register
AT91C_US0_THR             EQU (0xFFFC001C) ;- (US0) Transmitter Holding Register
AT91C_US0_IF              EQU (0xFFFC004C) ;- (US0) IRDA_FILTER Register
AT91C_US0_IER             EQU (0xFFFC0008) ;- (US0) Interrupt Enable Register
// - ========== Register definition for PDC_US1 peripheral ========== 
AT91C_US1_RNCR            EQU (0xFFFC4114) ;- (PDC_US1) Receive Next Counter Register
AT91C_US1_PTCR            EQU (0xFFFC4120) ;- (PDC_US1) PDC Transfer Control Register
AT91C_US1_TCR             EQU (0xFFFC410C) ;- (PDC_US1) Transmit Counter Register
AT91C_US1_PTSR            EQU (0xFFFC4124) ;- (PDC_US1) PDC Transfer Status Register
AT91C_US1_TNPR            EQU (0xFFFC4118) ;- (PDC_US1) Transmit Next Pointer Register
AT91C_US1_RCR             EQU (0xFFFC4104) ;- (PDC_US1) Receive Counter Register
AT91C_US1_RNPR            EQU (0xFFFC4110) ;- (PDC_US1) Receive Next Pointer Register
AT91C_US1_RPR             EQU (0xFFFC4100) ;- (PDC_US1) Receive Pointer Register
AT91C_US1_TNCR            EQU (0xFFFC411C) ;- (PDC_US1) Transmit Next Counter Register
AT91C_US1_TPR             EQU (0xFFFC4108) ;- (PDC_US1) Transmit Pointer Register
// - ========== Register definition for US1 peripheral ========== 
AT91C_US1_IF              EQU (0xFFFC404C) ;- (US1) IRDA_FILTER Register
AT91C_US1_NER             EQU (0xFFFC4044) ;- (US1) Nb Errors Register
AT91C_US1_RTOR            EQU (0xFFFC4024) ;- (US1) Receiver Time-out Register
AT91C_US1_CSR             EQU (0xFFFC4014) ;- (US1) Channel Status Register
AT91C_US1_IDR             EQU (0xFFFC400C) ;- (US1) Interrupt Disable Register
AT91C_US1_IER             EQU (0xFFFC4008) ;- (US1) Interrupt Enable Register
AT91C_US1_THR             EQU (0xFFFC401C) ;- (US1) Transmitter Holding Register
AT91C_US1_TTGR            EQU (0xFFFC4028) ;- (US1) Transmitter Time-guard Register
AT91C_US1_RHR             EQU (0xFFFC4018) ;- (US1) Receiver Holding Register
AT91C_US1_BRGR            EQU (0xFFFC4020) ;- (US1) Baud Rate Generator Register
AT91C_US1_IMR             EQU (0xFFFC4010) ;- (US1) Interrupt Mask Register
AT91C_US1_FIDI            EQU (0xFFFC4040) ;- (US1) FI_DI_Ratio Register
AT91C_US1_CR              EQU (0xFFFC4000) ;- (US1) Control Register
AT91C_US1_MR              EQU (0xFFFC4004) ;- (US1) Mode Register
// - ========== Register definition for PDC_US2 peripheral ========== 
AT91C_US2_PTCR            EQU (0xFFFC8120) ;- (PDC_US2) PDC Transfer Control Register
AT91C_US2_TCR             EQU (0xFFFC810C) ;- (PDC_US2) Transmit Counter Register
AT91C_US2_RPR             EQU (0xFFFC8100) ;- (PDC_US2) Receive Pointer Register
AT91C_US2_TPR             EQU (0xFFFC8108) ;- (PDC_US2) Transmit Pointer Register
AT91C_US2_PTSR            EQU (0xFFFC8124) ;- (PDC_US2) PDC Transfer Status Register
AT91C_US2_RNCR            EQU (0xFFFC8114) ;- (PDC_US2) Receive Next Counter Register
AT91C_US2_TNPR            EQU (0xFFFC8118) ;- (PDC_US2) Transmit Next Pointer Register
AT91C_US2_RCR             EQU (0xFFFC8104) ;- (PDC_US2) Receive Counter Register
AT91C_US2_RNPR            EQU (0xFFFC8110) ;- (PDC_US2) Receive Next Pointer Register
AT91C_US2_TNCR            EQU (0xFFFC811C) ;- (PDC_US2) Transmit Next Counter Register
// - ========== Register definition for US2 peripheral ========== 
AT91C_US2_RHR             EQU (0xFFFC8018) ;- (US2) Receiver Holding Register
AT91C_US2_BRGR            EQU (0xFFFC8020) ;- (US2) Baud Rate Generator Register
AT91C_US2_IF              EQU (0xFFFC804C) ;- (US2) IRDA_FILTER Register
AT91C_US2_IDR             EQU (0xFFFC800C) ;- (US2) Interrupt Disable Register
AT91C_US2_IMR             EQU (0xFFFC8010) ;- (US2) Interrupt Mask Register
AT91C_US2_CR              EQU (0xFFFC8000) ;- (US2) Control Register
AT91C_US2_IER             EQU (0xFFFC8008) ;- (US2) Interrupt Enable Register
AT91C_US2_NER             EQU (0xFFFC8044) ;- (US2) Nb Errors Register
AT91C_US2_RTOR            EQU (0xFFFC8024) ;- (US2) Receiver Time-out Register
AT91C_US2_TTGR            EQU (0xFFFC8028) ;- (US2) Transmitter Time-guard Register
AT91C_US2_MR              EQU (0xFFFC8004) ;- (US2) Mode Register
AT91C_US2_CSR             EQU (0xFFFC8014) ;- (US2) Channel Status Register
AT91C_US2_THR             EQU (0xFFFC801C) ;- (US2) Transmitter Holding Register
AT91C_US2_FIDI            EQU (0xFFFC8040) ;- (US2) FI_DI_Ratio Register
// - ========== Register definition for PWMC_CH0 peripheral ========== 
AT91C_PWMC_CH0_Reserved   EQU (0xFFFCC214) ;- (PWMC_CH0) Reserved
AT91C_PWMC_CH0_CPRDR      EQU (0xFFFCC208) ;- (PWMC_CH0) Channel Period Register
AT91C_PWMC_CH0_CDTYR      EQU (0xFFFCC204) ;- (PWMC_CH0) Channel Duty Cycle Register
AT91C_PWMC_CH0_CMR        EQU (0xFFFCC200) ;- (PWMC_CH0) Channel Mode Register
AT91C_PWMC_CH0_CUPDR      EQU (0xFFFCC210) ;- (PWMC_CH0) Channel Update Register
AT91C_PWMC_CH0_CCNTR      EQU (0xFFFCC20C) ;- (PWMC_CH0) Channel Counter Register
// - ========== Register definition for PWMC_CH1 peripheral ========== 
AT91C_PWMC_CH1_Reserved   EQU (0xFFFCC234) ;- (PWMC_CH1) Reserved
AT91C_PWMC_CH1_CUPDR      EQU (0xFFFCC230) ;- (PWMC_CH1) Channel Update Register
AT91C_PWMC_CH1_CPRDR      EQU (0xFFFCC228) ;- (PWMC_CH1) Channel Period Register
AT91C_PWMC_CH1_CCNTR      EQU (0xFFFCC22C) ;- (PWMC_CH1) Channel Counter Register
AT91C_PWMC_CH1_CDTYR      EQU (0xFFFCC224) ;- (PWMC_CH1) Channel Duty Cycle Register
AT91C_PWMC_CH1_CMR        EQU (0xFFFCC220) ;- (PWMC_CH1) Channel Mode Register
// - ========== Register definition for PWMC_CH2 peripheral ========== 
AT91C_PWMC_CH2_Reserved   EQU (0xFFFCC254) ;- (PWMC_CH2) Reserved
AT91C_PWMC_CH2_CMR        EQU (0xFFFCC240) ;- (PWMC_CH2) Channel Mode Register
AT91C_PWMC_CH2_CCNTR      EQU (0xFFFCC24C) ;- (PWMC_CH2) Channel Counter Register
AT91C_PWMC_CH2_CPRDR      EQU (0xFFFCC248) ;- (PWMC_CH2) Channel Period Register
AT91C_PWMC_CH2_CUPDR      EQU (0xFFFCC250) ;- (PWMC_CH2) Channel Update Register
AT91C_PWMC_CH2_CDTYR      EQU (0xFFFCC244) ;- (PWMC_CH2) Channel Duty Cycle Register
// - ========== Register definition for PWMC_CH3 peripheral ========== 
AT91C_PWMC_CH3_CUPDR      EQU (0xFFFCC270) ;- (PWMC_CH3) Channel Update Register
AT91C_PWMC_CH3_Reserved   EQU (0xFFFCC274) ;- (PWMC_CH3) Reserved
AT91C_PWMC_CH3_CPRDR      EQU (0xFFFCC268) ;- (PWMC_CH3) Channel Period Register
AT91C_PWMC_CH3_CDTYR      EQU (0xFFFCC264) ;- (PWMC_CH3) Channel Duty Cycle Register
AT91C_PWMC_CH3_CCNTR      EQU (0xFFFCC26C) ;- (PWMC_CH3) Channel Counter Register
AT91C_PWMC_CH3_CMR        EQU (0xFFFCC260) ;- (PWMC_CH3) Channel Mode Register
// - ========== Register definition for PWMC_CH4 peripheral ========== 
AT91C_PWMC_CH4_Reserved   EQU (0xFFFCC294) ;- (PWMC_CH4) Reserved
AT91C_PWMC_CH4_CDTYR      EQU (0xFFFCC284) ;- (PWMC_CH4) Channel Duty Cycle Register
AT91C_PWMC_CH4_CUPDR      EQU (0xFFFCC290) ;- (PWMC_CH4) Channel Update Register
AT91C_PWMC_CH4_CCNTR      EQU (0xFFFCC28C) ;- (PWMC_CH4) Channel Counter Register
AT91C_PWMC_CH4_CMR        EQU (0xFFFCC280) ;- (PWMC_CH4) Channel Mode Register
AT91C_PWMC_CH4_CPRDR      EQU (0xFFFCC288) ;- (PWMC_CH4) Channel Period Register
// - ========== Register definition for PWMC_CH5 peripheral ========== 
AT91C_PWMC_CH5_Reserved   EQU (0xFFFCC2B4) ;- (PWMC_CH5) Reserved
AT91C_PWMC_CH5_CCNTR      EQU (0xFFFCC2AC) ;- (PWMC_CH5) Channel Counter Register
AT91C_PWMC_CH5_CDTYR      EQU (0xFFFCC2A4) ;- (PWMC_CH5) Channel Duty Cycle Register
AT91C_PWMC_CH5_CPRDR      EQU (0xFFFCC2A8) ;- (PWMC_CH5) Channel Period Register
AT91C_PWMC_CH5_CMR        EQU (0xFFFCC2A0) ;- (PWMC_CH5) Channel Mode Register
AT91C_PWMC_CH5_CUPDR      EQU (0xFFFCC2B0) ;- (PWMC_CH5) Channel Update Register
// - ========== Register definition for PWMC_CH6 peripheral ========== 
AT91C_PWMC_CH6_CCNTR      EQU (0xFFFCC2CC) ;- (PWMC_CH6) Channel Counter Register
AT91C_PWMC_CH6_CMR        EQU (0xFFFCC2C0) ;- (PWMC_CH6) Channel Mode Register
AT91C_PWMC_CH6_CDTYR      EQU (0xFFFCC2C4) ;- (PWMC_CH6) Channel Duty Cycle Register
AT91C_PWMC_CH6_Reserved   EQU (0xFFFCC2D4) ;- (PWMC_CH6) Reserved
AT91C_PWMC_CH6_CPRDR      EQU (0xFFFCC2C8) ;- (PWMC_CH6) Channel Period Register
AT91C_PWMC_CH6_CUPDR      EQU (0xFFFCC2D0) ;- (PWMC_CH6) Channel Update Register
// - ========== Register definition for PWMC_CH7 peripheral ========== 
AT91C_PWMC_CH7_CCNTR      EQU (0xFFFCC2EC) ;- (PWMC_CH7) Channel Counter Register
AT91C_PWMC_CH7_CDTYR      EQU (0xFFFCC2E4) ;- (PWMC_CH7) Channel Duty Cycle Register
AT91C_PWMC_CH7_CPRDR      EQU (0xFFFCC2E8) ;- (PWMC_CH7) Channel Period Register
AT91C_PWMC_CH7_Reserved   EQU (0xFFFCC2F4) ;- (PWMC_CH7) Reserved
AT91C_PWMC_CH7_CUPDR      EQU (0xFFFCC2F0) ;- (PWMC_CH7) Channel Update Register
AT91C_PWMC_CH7_CMR        EQU (0xFFFCC2E0) ;- (PWMC_CH7) Channel Mode Register
// - ========== Register definition for PWMC peripheral ========== 
AT91C_PWMC_IDR            EQU (0xFFFCC014) ;- (PWMC) PWMC Interrupt Disable Register
AT91C_PWMC_DIS            EQU (0xFFFCC008) ;- (PWMC) PWMC Disable Register
AT91C_PWMC_IER            EQU (0xFFFCC010) ;- (PWMC) PWMC Interrupt Enable Register
AT91C_PWMC_VR             EQU (0xFFFCC0FC) ;- (PWMC) PWMC Version Register
AT91C_PWMC_ISR            EQU (0xFFFCC01C) ;- (PWMC) PWMC Interrupt Status Register
AT91C_PWMC_SR             EQU (0xFFFCC00C) ;- (PWMC) PWMC Status Register
AT91C_PWMC_IMR            EQU (0xFFFCC018) ;- (PWMC) PWMC Interrupt Mask Register
AT91C_PWMC_MR             EQU (0xFFFCC000) ;- (PWMC) PWMC Mode Register
AT91C_PWMC_ENA            EQU (0xFFFCC004) ;- (PWMC) PWMC Enable Register
// - ========== Register definition for PDC_SSC0 peripheral ========== 
AT91C_SSC0_RNPR           EQU (0xFFFD0110) ;- (PDC_SSC0) Receive Next Pointer Register
AT91C_SSC0_RNCR           EQU (0xFFFD0114) ;- (PDC_SSC0) Receive Next Counter Register
AT91C_SSC0_PTSR           EQU (0xFFFD0124) ;- (PDC_SSC0) PDC Transfer Status Register
AT91C_SSC0_PTCR           EQU (0xFFFD0120) ;- (PDC_SSC0) PDC Transfer Control Register
AT91C_SSC0_TCR            EQU (0xFFFD010C) ;- (PDC_SSC0) Transmit Counter Register
AT91C_SSC0_TNPR           EQU (0xFFFD0118) ;- (PDC_SSC0) Transmit Next Pointer Register
AT91C_SSC0_RCR            EQU (0xFFFD0104) ;- (PDC_SSC0) Receive Counter Register
AT91C_SSC0_TPR            EQU (0xFFFD0108) ;- (PDC_SSC0) Transmit Pointer Register
AT91C_SSC0_TNCR           EQU (0xFFFD011C) ;- (PDC_SSC0) Transmit Next Counter Register
AT91C_SSC0_RPR            EQU (0xFFFD0100) ;- (PDC_SSC0) Receive Pointer Register
// - ========== Register definition for SSC0 peripheral ========== 
AT91C_SSC0_IER            EQU (0xFFFD0044) ;- (SSC0) Interrupt Enable Register
AT91C_SSC0_THR            EQU (0xFFFD0024) ;- (SSC0) Transmit Holding Register
AT91C_SSC0_IDR            EQU (0xFFFD0048) ;- (SSC0) Interrupt Disable Register
AT91C_SSC0_CMR            EQU (0xFFFD0004) ;- (SSC0) Clock Mode Register
AT91C_SSC0_SR             EQU (0xFFFD0040) ;- (SSC0) Status Register
AT91C_SSC0_RHR            EQU (0xFFFD0020) ;- (SSC0) Receive Holding Register
AT91C_SSC0_TFMR           EQU (0xFFFD001C) ;- (SSC0) Transmit Frame Mode Register
AT91C_SSC0_CR             EQU (0xFFFD0000) ;- (SSC0) Control Register
AT91C_SSC0_IMR            EQU (0xFFFD004C) ;- (SSC0) Interrupt Mask Register
AT91C_SSC0_TCMR           EQU (0xFFFD0018) ;- (SSC0) Transmit Clock Mode Register
AT91C_SSC0_RCMR           EQU (0xFFFD0010) ;- (SSC0) Receive Clock ModeRegister
AT91C_SSC0_RSHR           EQU (0xFFFD0030) ;- (SSC0) Receive Sync Holding Register
AT91C_SSC0_TSHR           EQU (0xFFFD0034) ;- (SSC0) Transmit Sync Holding Register
AT91C_SSC0_RFMR           EQU (0xFFFD0014) ;- (SSC0) Receive Frame Mode Register
// - ========== Register definition for PDC_SSC1 peripheral ========== 
AT91C_SSC1_TNCR           EQU (0xFFFD411C) ;- (PDC_SSC1) Transmit Next Counter Register
AT91C_SSC1_RPR            EQU (0xFFFD4100) ;- (PDC_SSC1) Receive Pointer Register
AT91C_SSC1_RNCR           EQU (0xFFFD4114) ;- (PDC_SSC1) Receive Next Counter Register
AT91C_SSC1_TPR            EQU (0xFFFD4108) ;- (PDC_SSC1) Transmit Pointer Register
AT91C_SSC1_PTCR           EQU (0xFFFD4120) ;- (PDC_SSC1) PDC Transfer Control Register
AT91C_SSC1_TCR            EQU (0xFFFD410C) ;- (PDC_SSC1) Transmit Counter Register
AT91C_SSC1_RCR            EQU (0xFFFD4104) ;- (PDC_SSC1) Receive Counter Register
AT91C_SSC1_RNPR           EQU (0xFFFD4110) ;- (PDC_SSC1) Receive Next Pointer Register
AT91C_SSC1_TNPR           EQU (0xFFFD4118) ;- (PDC_SSC1) Transmit Next Pointer Register
AT91C_SSC1_PTSR           EQU (0xFFFD4124) ;- (PDC_SSC1) PDC Transfer Status Register
// - ========== Register definition for SSC1 peripheral ========== 
AT91C_SSC1_RHR            EQU (0xFFFD4020) ;- (SSC1) Receive Holding Register
AT91C_SSC1_RSHR           EQU (0xFFFD4030) ;- (SSC1) Receive Sync Holding Register
AT91C_SSC1_TFMR           EQU (0xFFFD401C) ;- (SSC1) Transmit Frame Mode Register
AT91C_SSC1_IDR            EQU (0xFFFD4048) ;- (SSC1) Interrupt Disable Register
AT91C_SSC1_THR            EQU (0xFFFD4024) ;- (SSC1) Transmit Holding Register
AT91C_SSC1_RCMR           EQU (0xFFFD4010) ;- (SSC1) Receive Clock ModeRegister
AT91C_SSC1_IER            EQU (0xFFFD4044) ;- (SSC1) Interrupt Enable Register
AT91C_SSC1_TSHR           EQU (0xFFFD4034) ;- (SSC1) Transmit Sync Holding Register
AT91C_SSC1_SR             EQU (0xFFFD4040) ;- (SSC1) Status Register
AT91C_SSC1_CMR            EQU (0xFFFD4004) ;- (SSC1) Clock Mode Register
AT91C_SSC1_TCMR           EQU (0xFFFD4018) ;- (SSC1) Transmit Clock Mode Register
AT91C_SSC1_CR             EQU (0xFFFD4000) ;- (SSC1) Control Register
AT91C_SSC1_IMR            EQU (0xFFFD404C) ;- (SSC1) Interrupt Mask Register
AT91C_SSC1_RFMR           EQU (0xFFFD4014) ;- (SSC1) Receive Frame Mode Register
// - ========== Register definition for PDC_ADC0 peripheral ========== 
AT91C_ADC0_PTSR           EQU (0xFFFD8124) ;- (PDC_ADC0) PDC Transfer Status Register
AT91C_ADC0_PTCR           EQU (0xFFFD8120) ;- (PDC_ADC0) PDC Transfer Control Register
AT91C_ADC0_TNPR           EQU (0xFFFD8118) ;- (PDC_ADC0) Transmit Next Pointer Register
AT91C_ADC0_TNCR           EQU (0xFFFD811C) ;- (PDC_ADC0) Transmit Next Counter Register
AT91C_ADC0_RNPR           EQU (0xFFFD8110) ;- (PDC_ADC0) Receive Next Pointer Register
AT91C_ADC0_RNCR           EQU (0xFFFD8114) ;- (PDC_ADC0) Receive Next Counter Register
AT91C_ADC0_RPR            EQU (0xFFFD8100) ;- (PDC_ADC0) Receive Pointer Register
AT91C_ADC0_TCR            EQU (0xFFFD810C) ;- (PDC_ADC0) Transmit Counter Register
AT91C_ADC0_TPR            EQU (0xFFFD8108) ;- (PDC_ADC0) Transmit Pointer Register
AT91C_ADC0_RCR            EQU (0xFFFD8104) ;- (PDC_ADC0) Receive Counter Register
// - ========== Register definition for ADC0 peripheral ========== 
AT91C_ADC0_CDR2           EQU (0xFFFD8038) ;- (ADC0) ADC Channel Data Register 2
AT91C_ADC0_CDR3           EQU (0xFFFD803C) ;- (ADC0) ADC Channel Data Register 3
AT91C_ADC0_CDR0           EQU (0xFFFD8030) ;- (ADC0) ADC Channel Data Register 0
AT91C_ADC0_CDR5           EQU (0xFFFD8044) ;- (ADC0) ADC Channel Data Register 5
AT91C_ADC0_CHDR           EQU (0xFFFD8014) ;- (ADC0) ADC Channel Disable Register
AT91C_ADC0_SR             EQU (0xFFFD801C) ;- (ADC0) ADC Status Register
AT91C_ADC0_CDR4           EQU (0xFFFD8040) ;- (ADC0) ADC Channel Data Register 4
AT91C_ADC0_CDR1           EQU (0xFFFD8034) ;- (ADC0) ADC Channel Data Register 1
AT91C_ADC0_LCDR           EQU (0xFFFD8020) ;- (ADC0) ADC Last Converted Data Register
AT91C_ADC0_IDR            EQU (0xFFFD8028) ;- (ADC0) ADC Interrupt Disable Register
AT91C_ADC0_CR             EQU (0xFFFD8000) ;- (ADC0) ADC Control Register
AT91C_ADC0_CDR7           EQU (0xFFFD804C) ;- (ADC0) ADC Channel Data Register 7
AT91C_ADC0_CDR6           EQU (0xFFFD8048) ;- (ADC0) ADC Channel Data Register 6
AT91C_ADC0_IER            EQU (0xFFFD8024) ;- (ADC0) ADC Interrupt Enable Register
AT91C_ADC0_CHER           EQU (0xFFFD8010) ;- (ADC0) ADC Channel Enable Register
AT91C_ADC0_CHSR           EQU (0xFFFD8018) ;- (ADC0) ADC Channel Status Register
AT91C_ADC0_MR             EQU (0xFFFD8004) ;- (ADC0) ADC Mode Register
AT91C_ADC0_IMR            EQU (0xFFFD802C) ;- (ADC0) ADC Interrupt Mask Register
// - ========== Register definition for PDC_ADC1 peripheral ========== 
AT91C_ADC1_RCR            EQU (0xFFFDC104) ;- (PDC_ADC1) Receive Counter Register
AT91C_ADC1_TPR            EQU (0xFFFDC108) ;- (PDC_ADC1) Transmit Pointer Register
AT91C_ADC1_TNPR           EQU (0xFFFDC118) ;- (PDC_ADC1) Transmit Next Pointer Register
AT91C_ADC1_RNCR           EQU (0xFFFDC114) ;- (PDC_ADC1) Receive Next Counter Register
AT91C_ADC1_PTSR           EQU (0xFFFDC124) ;- (PDC_ADC1) PDC Transfer Status Register
AT91C_ADC1_PTCR           EQU (0xFFFDC120) ;- (PDC_ADC1) PDC Transfer Control Register
AT91C_ADC1_RNPR           EQU (0xFFFDC110) ;- (PDC_ADC1) Receive Next Pointer Register
AT91C_ADC1_TNCR           EQU (0xFFFDC11C) ;- (PDC_ADC1) Transmit Next Counter Register
AT91C_ADC1_TCR            EQU (0xFFFDC10C) ;- (PDC_ADC1) Transmit Counter Register
AT91C_ADC1_RPR            EQU (0xFFFDC100) ;- (PDC_ADC1) Receive Pointer Register
// - ========== Register definition for ADC1 peripheral ========== 
AT91C_ADC1_IER            EQU (0xFFFDC024) ;- (ADC1) ADC Interrupt Enable Register
AT91C_ADC1_CHSR           EQU (0xFFFDC018) ;- (ADC1) ADC Channel Status Register
AT91C_ADC1_MR             EQU (0xFFFDC004) ;- (ADC1) ADC Mode Register
AT91C_ADC1_CR             EQU (0xFFFDC000) ;- (ADC1) ADC Control Register
AT91C_ADC1_LCDR           EQU (0xFFFDC020) ;- (ADC1) ADC Last Converted Data Register
AT91C_ADC1_CHER           EQU (0xFFFDC010) ;- (ADC1) ADC Channel Enable Register
AT91C_ADC1_CHDR           EQU (0xFFFDC014) ;- (ADC1) ADC Channel Disable Register
AT91C_ADC1_IMR            EQU (0xFFFDC02C) ;- (ADC1) ADC Interrupt Mask Register
AT91C_ADC1_CDR1           EQU (0xFFFDC034) ;- (ADC1) ADC Channel Data Register 1
AT91C_ADC1_CDR4           EQU (0xFFFDC040) ;- (ADC1) ADC Channel Data Register 4
AT91C_ADC1_CDR0           EQU (0xFFFDC030) ;- (ADC1) ADC Channel Data Register 0
AT91C_ADC1_CDR5           EQU (0xFFFDC044) ;- (ADC1) ADC Channel Data Register 5
AT91C_ADC1_CDR3           EQU (0xFFFDC03C) ;- (ADC1) ADC Channel Data Register 3
AT91C_ADC1_CDR6           EQU (0xFFFDC048) ;- (ADC1) ADC Channel Data Register 6
AT91C_ADC1_SR             EQU (0xFFFDC01C) ;- (ADC1) ADC Status Register
AT91C_ADC1_CDR2           EQU (0xFFFDC038) ;- (ADC1) ADC Channel Data Register 2
AT91C_ADC1_CDR7           EQU (0xFFFDC04C) ;- (ADC1) ADC Channel Data Register 7
AT91C_ADC1_IDR            EQU (0xFFFDC028) ;- (ADC1) ADC Interrupt Disable Register
// - ========== Register definition for PDC_SPI0 peripheral ========== 
AT91C_SPI0_PTCR           EQU (0xFFFE0120) ;- (PDC_SPI0) PDC Transfer Control Register
AT91C_SPI0_TPR            EQU (0xFFFE0108) ;- (PDC_SPI0) Transmit Pointer Register
AT91C_SPI0_TCR            EQU (0xFFFE010C) ;- (PDC_SPI0) Transmit Counter Register
AT91C_SPI0_RCR            EQU (0xFFFE0104) ;- (PDC_SPI0) Receive Counter Register
AT91C_SPI0_PTSR           EQU (0xFFFE0124) ;- (PDC_SPI0) PDC Transfer Status Register
AT91C_SPI0_RNPR           EQU (0xFFFE0110) ;- (PDC_SPI0) Receive Next Pointer Register
AT91C_SPI0_RPR            EQU (0xFFFE0100) ;- (PDC_SPI0) Receive Pointer Register
AT91C_SPI0_TNCR           EQU (0xFFFE011C) ;- (PDC_SPI0) Transmit Next Counter Register
AT91C_SPI0_RNCR           EQU (0xFFFE0114) ;- (PDC_SPI0) Receive Next Counter Register
AT91C_SPI0_TNPR           EQU (0xFFFE0118) ;- (PDC_SPI0) Transmit Next Pointer Register
// - ========== Register definition for SPI0 peripheral ========== 
AT91C_SPI0_IER            EQU (0xFFFE0014) ;- (SPI0) Interrupt Enable Register
AT91C_SPI0_SR             EQU (0xFFFE0010) ;- (SPI0) Status Register
AT91C_SPI0_IDR            EQU (0xFFFE0018) ;- (SPI0) Interrupt Disable Register
AT91C_SPI0_CR             EQU (0xFFFE0000) ;- (SPI0) Control Register
AT91C_SPI0_MR             EQU (0xFFFE0004) ;- (SPI0) Mode Register
AT91C_SPI0_IMR            EQU (0xFFFE001C) ;- (SPI0) Interrupt Mask Register
AT91C_SPI0_TDR            EQU (0xFFFE000C) ;- (SPI0) Transmit Data Register
AT91C_SPI0_RDR            EQU (0xFFFE0008) ;- (SPI0) Receive Data Register
AT91C_SPI0_CSR            EQU (0xFFFE0030) ;- (SPI0) Chip Select Register
// - ========== Register definition for PDC_SPI1 peripheral ========== 
AT91C_SPI1_PTCR           EQU (0xFFFE4120) ;- (PDC_SPI1) PDC Transfer Control Register
AT91C_SPI1_RPR            EQU (0xFFFE4100) ;- (PDC_SPI1) Receive Pointer Register
