tsugli/stm32/common/rtos/portable/GCC/AT91SAM7A3/ioat91sam7a3.h
AT91C_SPI1_TNCR           EQU (0xFFFE411C) ;- (PDC_SPI1) Transmit Next Counter Register
AT91C_SPI1_TPR            EQU (0xFFFE4108) ;- (PDC_SPI1) Transmit Pointer Register
AT91C_SPI1_TNPR           EQU (0xFFFE4118) ;- (PDC_SPI1) Transmit Next Pointer Register
AT91C_SPI1_TCR            EQU (0xFFFE410C) ;- (PDC_SPI1) Transmit Counter Register
AT91C_SPI1_RCR            EQU (0xFFFE4104) ;- (PDC_SPI1) Receive Counter Register
AT91C_SPI1_RNPR           EQU (0xFFFE4110) ;- (PDC_SPI1) Receive Next Pointer Register
AT91C_SPI1_RNCR           EQU (0xFFFE4114) ;- (PDC_SPI1) Receive Next Counter Register
AT91C_SPI1_PTSR           EQU (0xFFFE4124) ;- (PDC_SPI1) PDC Transfer Status Register
// - ========== Register definition for SPI1 peripheral ========== 
AT91C_SPI1_IMR            EQU (0xFFFE401C) ;- (SPI1) Interrupt Mask Register
AT91C_SPI1_IER            EQU (0xFFFE4014) ;- (SPI1) Interrupt Enable Register
AT91C_SPI1_MR             EQU (0xFFFE4004) ;- (SPI1) Mode Register
AT91C_SPI1_RDR            EQU (0xFFFE4008) ;- (SPI1) Receive Data Register
AT91C_SPI1_IDR            EQU (0xFFFE4018) ;- (SPI1) Interrupt Disable Register
AT91C_SPI1_SR             EQU (0xFFFE4010) ;- (SPI1) Status Register
AT91C_SPI1_TDR            EQU (0xFFFE400C) ;- (SPI1) Transmit Data Register
AT91C_SPI1_CR             EQU (0xFFFE4000) ;- (SPI1) Control Register
AT91C_SPI1_CSR            EQU (0xFFFE4030) ;- (SPI1) Chip Select Register

// - *****************************************************************************
// -               PIO DEFINITIONS FOR AT91SAM7A3
// - *****************************************************************************
AT91C_PIO_PA0             EQU (1 <<  0) ;- Pin Controlled by PA0
AT91C_PA0_TWD             EQU (AT91C_PIO_PA0) ;-  TWI Two-wire Serial Data
AT91C_PA0_ADTRG0          EQU (AT91C_PIO_PA0) ;-  ADC0 External Trigger
AT91C_PIO_PA1             EQU (1 <<  1) ;- Pin Controlled by PA1
AT91C_PA1_TWCK            EQU (AT91C_PIO_PA1) ;-  TWI Two-wire Serial Clock
AT91C_PA1_ADTRG1          EQU (AT91C_PIO_PA1) ;-  ADC1 External Trigger
AT91C_PIO_PA10            EQU (1 << 10) ;- Pin Controlled by PA10
AT91C_PA10_TXD2           EQU (AT91C_PIO_PA10) ;-  USART 2 Transmit Data
AT91C_PA10_SPCK1          EQU (AT91C_PIO_PA10) ;-  SPI1 Serial Clock
AT91C_PIO_PA11            EQU (1 << 11) ;- Pin Controlled by PA11
AT91C_PA11_NPCS00         EQU (AT91C_PIO_PA11) ;-  SPI0 Peripheral Chip Select 0
AT91C_PIO_PA12            EQU (1 << 12) ;- Pin Controlled by PA12
AT91C_PA12_NPCS01         EQU (AT91C_PIO_PA12) ;-  SPI0 Peripheral Chip Select 1
AT91C_PA12_MCDA1          EQU (AT91C_PIO_PA12) ;-  Multimedia Card A Data 1
AT91C_PIO_PA13            EQU (1 << 13) ;- Pin Controlled by PA13
AT91C_PA13_NPCS02         EQU (AT91C_PIO_PA13) ;-  SPI0 Peripheral Chip Select 2
AT91C_PA13_MCDA2          EQU (AT91C_PIO_PA13) ;-  Multimedia Card A Data 2
AT91C_PIO_PA14            EQU (1 << 14) ;- Pin Controlled by PA14
AT91C_PA14_NPCS03         EQU (AT91C_PIO_PA14) ;-  SPI0 Peripheral Chip Select 3
AT91C_PA14_MCDA3          EQU (AT91C_PIO_PA14) ;-  Multimedia Card A Data 3
AT91C_PIO_PA15            EQU (1 << 15) ;- Pin Controlled by PA15
AT91C_PA15_MISO0          EQU (AT91C_PIO_PA15) ;-  SPI0 Master In Slave
AT91C_PA15_MCDA0          EQU (AT91C_PIO_PA15) ;-  Multimedia Card A Data 0
AT91C_PIO_PA16            EQU (1 << 16) ;- Pin Controlled by PA16
AT91C_PA16_MOSI0          EQU (AT91C_PIO_PA16) ;-  SPI0 Master Out Slave
AT91C_PA16_MCCDA          EQU (AT91C_PIO_PA16) ;-  Multimedia Card A Command
AT91C_PIO_PA17            EQU (1 << 17) ;- Pin Controlled by PA17
AT91C_PA17_SPCK0          EQU (AT91C_PIO_PA17) ;-  SPI0 Serial Clock
AT91C_PA17_MCCK           EQU (AT91C_PIO_PA17) ;-  Multimedia Card Clock
AT91C_PIO_PA18            EQU (1 << 18) ;- Pin Controlled by PA18
AT91C_PA18_PWM0           EQU (AT91C_PIO_PA18) ;-  PWMC Channel 0
AT91C_PA18_PCK0           EQU (AT91C_PIO_PA18) ;-  PMC Programmable Clock Output 0
AT91C_PIO_PA19            EQU (1 << 19) ;- Pin Controlled by PA19
AT91C_PA19_PWM1           EQU (AT91C_PIO_PA19) ;-  PWMC Channel 1
AT91C_PA19_PCK1           EQU (AT91C_PIO_PA19) ;-  PMC Programmable Clock Output 1
AT91C_PIO_PA2             EQU (1 <<  2) ;- Pin Controlled by PA2
AT91C_PA2_RXD0            EQU (AT91C_PIO_PA2) ;-  USART 0 Receive Data
AT91C_PIO_PA20            EQU (1 << 20) ;- Pin Controlled by PA20
AT91C_PA20_PWM2           EQU (AT91C_PIO_PA20) ;-  PWMC Channel 2
AT91C_PA20_PCK2           EQU (AT91C_PIO_PA20) ;-  PMC Programmable Clock Output 2
AT91C_PIO_PA21            EQU (1 << 21) ;- Pin Controlled by PA21
AT91C_PA21_PWM3           EQU (AT91C_PIO_PA21) ;-  PWMC Channel 3
AT91C_PA21_PCK3           EQU (AT91C_PIO_PA21) ;-  PMC Programmable Clock Output 3
AT91C_PIO_PA22            EQU (1 << 22) ;- Pin Controlled by PA22
AT91C_PA22_PWM4           EQU (AT91C_PIO_PA22) ;-  PWMC Channel 4
AT91C_PA22_IRQ0           EQU (AT91C_PIO_PA22) ;-  Interrupt input 0
AT91C_PIO_PA23            EQU (1 << 23) ;- Pin Controlled by PA23
AT91C_PA23_PWM5           EQU (AT91C_PIO_PA23) ;-  PWMC Channel 5
AT91C_PA23_IRQ1           EQU (AT91C_PIO_PA23) ;-  Interrupt input 1
AT91C_PIO_PA24            EQU (1 << 24) ;- Pin Controlled by PA24
AT91C_PA24_PWM6           EQU (AT91C_PIO_PA24) ;-  PWMC Channel 6
AT91C_PA24_TCLK4          EQU (AT91C_PIO_PA24) ;-  Timer Counter 4 external Clock Input
AT91C_PIO_PA25            EQU (1 << 25) ;- Pin Controlled by PA25
AT91C_PA25_PWM7           EQU (AT91C_PIO_PA25) ;-  PWMC Channel 7
AT91C_PA25_TCLK5          EQU (AT91C_PIO_PA25) ;-  Timer Counter 5 external Clock Input
AT91C_PIO_PA26            EQU (1 << 26) ;- Pin Controlled by PA26
AT91C_PA26_CANRX0         EQU (AT91C_PIO_PA26) ;-  CAN Receive 0
AT91C_PIO_PA27            EQU (1 << 27) ;- Pin Controlled by PA27
AT91C_PA27_CANTX0         EQU (AT91C_PIO_PA27) ;-  CAN Transmit 0
AT91C_PIO_PA28            EQU (1 << 28) ;- Pin Controlled by PA28
AT91C_PA28_CANRX1         EQU (AT91C_PIO_PA28) ;-  CAN Receive 1
AT91C_PA28_TCLK3          EQU (AT91C_PIO_PA28) ;-  Timer Counter 3 external Clock Input
AT91C_PIO_PA29            EQU (1 << 29) ;- Pin Controlled by PA29
AT91C_PA29_CANTX1         EQU (AT91C_PIO_PA29) ;-  CAN Transmit 1
AT91C_PA29_TCLK6          EQU (AT91C_PIO_PA29) ;-  Timer Counter 6 external clock input
AT91C_PIO_PA3             EQU (1 <<  3) ;- Pin Controlled by PA3
AT91C_PA3_TXD0            EQU (AT91C_PIO_PA3) ;-  USART 0 Transmit Data
AT91C_PIO_PA30            EQU (1 << 30) ;- Pin Controlled by PA30
AT91C_PA30_DRXD           EQU (AT91C_PIO_PA30) ;-  DBGU Debug Receive Data
AT91C_PA30_TCLK7          EQU (AT91C_PIO_PA30) ;-  Timer Counter 7 external clock input
AT91C_PIO_PA31            EQU (1 << 31) ;- Pin Controlled by PA31
AT91C_PA31_DTXD           EQU (AT91C_PIO_PA31) ;-  DBGU Debug Transmit Data
AT91C_PA31_TCLK8          EQU (AT91C_PIO_PA31) ;-  Timer Counter 8 external clock input
AT91C_PIO_PA4             EQU (1 <<  4) ;- Pin Controlled by PA4
AT91C_PA4_SCK0            EQU (AT91C_PIO_PA4) ;-  USART 0 Serial Clock
AT91C_PA4_NPCS10          EQU (AT91C_PIO_PA4) ;-  SPI1 Peripheral Chip Select 0
AT91C_PIO_PA5             EQU (1 <<  5) ;- Pin Controlled by PA5
AT91C_PA5_RTS0            EQU (AT91C_PIO_PA5) ;-  USART 0 Ready To Send
AT91C_PA5_NPCS11          EQU (AT91C_PIO_PA5) ;-  SPI1 Peripheral Chip Select 1
AT91C_PIO_PA6             EQU (1 <<  6) ;- Pin Controlled by PA6
AT91C_PA6_CTS0            EQU (AT91C_PIO_PA6) ;-  USART 0 Clear To Send
AT91C_PA6_NPCS12          EQU (AT91C_PIO_PA6) ;-  SPI1 Peripheral Chip Select 2
AT91C_PIO_PA7             EQU (1 <<  7) ;- Pin Controlled by PA7
AT91C_PA7_RXD1            EQU (AT91C_PIO_PA7) ;-  USART 1 Receive Data
AT91C_PA7_NPCS13          EQU (AT91C_PIO_PA7) ;-  SPI1 Peripheral Chip Select 3
AT91C_PIO_PA8             EQU (1 <<  8) ;- Pin Controlled by PA8
AT91C_PA8_TXD1            EQU (AT91C_PIO_PA8) ;-  USART 1 Transmit Data
AT91C_PA8_MISO1           EQU (AT91C_PIO_PA8) ;-  SPI1 Master In Slave
AT91C_PIO_PA9             EQU (1 <<  9) ;- Pin Controlled by PA9
AT91C_PA9_RXD2            EQU (AT91C_PIO_PA9) ;-  USART 2 Receive Data
AT91C_PA9_MOSI1           EQU (AT91C_PIO_PA9) ;-  SPI1 Master Out Slave
AT91C_PIO_PB0             EQU (1 <<  0) ;- Pin Controlled by PB0
AT91C_PB0_IRQ2            EQU (AT91C_PIO_PB0) ;-  Interrupt input 2
AT91C_PB0_PWM5            EQU (AT91C_PIO_PB0) ;-  PWMC Channel 5
AT91C_PIO_PB1             EQU (1 <<  1) ;- Pin Controlled by PB1
AT91C_PB1_IRQ3            EQU (AT91C_PIO_PB1) ;-  Interrupt input 3
AT91C_PB1_PWM6            EQU (AT91C_PIO_PB1) ;-  PWMC Channel 6
AT91C_PIO_PB10            EQU (1 << 10) ;- Pin Controlled by PB10
AT91C_PB10_TCLK1          EQU (AT91C_PIO_PB10) ;-  Timer Counter 1 external clock input
AT91C_PB10_RK1            EQU (AT91C_PIO_PB10) ;-  SSC Receive Clock 1
AT91C_PIO_PB11            EQU (1 << 11) ;- Pin Controlled by PB11
AT91C_PB11_TCLK2          EQU (AT91C_PIO_PB11) ;-  Timer Counter 2 external clock input
AT91C_PB11_RF1            EQU (AT91C_PIO_PB11) ;-  SSC Receive Frame Sync 1
AT91C_PIO_PB12            EQU (1 << 12) ;- Pin Controlled by PB12
AT91C_PB12_TIOA0          EQU (AT91C_PIO_PB12) ;-  Timer Counter 0 Multipurpose Timer I/O Pin A
AT91C_PB12_TD1            EQU (AT91C_PIO_PB12) ;-  SSC Transmit Data 1
AT91C_PIO_PB13            EQU (1 << 13) ;- Pin Controlled by PB13
AT91C_PB13_TIOB0          EQU (AT91C_PIO_PB13) ;-  Timer Counter 0 Multipurpose Timer I/O Pin B
AT91C_PB13_RD1            EQU (AT91C_PIO_PB13) ;-  SSC Receive Data 1
AT91C_PIO_PB14            EQU (1 << 14) ;- Pin Controlled by PB14
AT91C_PB14_TIOA1          EQU (AT91C_PIO_PB14) ;-  Timer Counter 1 Multipurpose Timer I/O Pin A
AT91C_PB14_PWM0           EQU (AT91C_PIO_PB14) ;-  PWMC Channel 0
AT91C_PIO_PB15            EQU (1 << 15) ;- Pin Controlled by PB15
AT91C_PB15_TIOB1          EQU (AT91C_PIO_PB15) ;-  Timer Counter 1 Multipurpose Timer I/O Pin B
AT91C_PB15_PWM1           EQU (AT91C_PIO_PB15) ;-  PWMC Channel 1
AT91C_PIO_PB16            EQU (1 << 16) ;- Pin Controlled by PB16
AT91C_PB16_TIOA2          EQU (AT91C_PIO_PB16) ;-  Timer Counter 2 Multipurpose Timer I/O Pin A
AT91C_PB16_PWM2           EQU (AT91C_PIO_PB16) ;-  PWMC Channel 2
AT91C_PIO_PB17            EQU (1 << 17) ;- Pin Controlled by PB17
AT91C_PB17_TIOB2          EQU (AT91C_PIO_PB17) ;-  Timer Counter 2 Multipurpose Timer I/O Pin B
AT91C_PB17_PWM3           EQU (AT91C_PIO_PB17) ;-  PWMC Channel 3
AT91C_PIO_PB18            EQU (1 << 18) ;- Pin Controlled by PB18
AT91C_PB18_TIOA3          EQU (AT91C_PIO_PB18) ;-  Timer Counter 3 Multipurpose Timer I/O Pin A
AT91C_PB18_PWM4           EQU (AT91C_PIO_PB18) ;-  PWMC Channel 4
AT91C_PIO_PB19            EQU (1 << 19) ;- Pin Controlled by PB19
AT91C_PB19_TIOB3          EQU (AT91C_PIO_PB19) ;-  Timer Counter 3 Multipurpose Timer I/O Pin B
AT91C_PB19_NPCS11         EQU (AT91C_PIO_PB19) ;-  SPI1 Peripheral Chip Select 1
AT91C_PIO_PB2             EQU (1 <<  2) ;- Pin Controlled by PB2
AT91C_PB2_TF0             EQU (AT91C_PIO_PB2) ;-  SSC Transmit Frame Sync 0
AT91C_PB2_PWM7            EQU (AT91C_PIO_PB2) ;-  PWMC Channel 7
AT91C_PIO_PB20            EQU (1 << 20) ;- Pin Controlled by PB20
AT91C_PB20_TIOA4          EQU (AT91C_PIO_PB20) ;-  Timer Counter 4 Multipurpose Timer I/O Pin A
AT91C_PB20_NPCS12         EQU (AT91C_PIO_PB20) ;-  SPI1 Peripheral Chip Select 2
AT91C_PIO_PB21            EQU (1 << 21) ;- Pin Controlled by PB21
AT91C_PB21_TIOB4          EQU (AT91C_PIO_PB21) ;-  Timer Counter 4 Multipurpose Timer I/O Pin B
AT91C_PB21_NPCS13         EQU (AT91C_PIO_PB21) ;-  SPI1 Peripheral Chip Select 3
AT91C_PIO_PB22            EQU (1 << 22) ;- Pin Controlled by PB22
AT91C_PB22_TIOA5          EQU (AT91C_PIO_PB22) ;-  Timer Counter 5 Multipurpose Timer I/O Pin A
AT91C_PIO_PB23            EQU (1 << 23) ;- Pin Controlled by PB23
AT91C_PB23_TIOB5          EQU (AT91C_PIO_PB23) ;-  Timer Counter 5 Multipurpose Timer I/O Pin B
AT91C_PIO_PB24            EQU (1 << 24) ;- Pin Controlled by PB24
AT91C_PB24_TIOA6          EQU (AT91C_PIO_PB24) ;-  Timer Counter 6 Multipurpose Timer I/O Pin A
AT91C_PB24_RTS1           EQU (AT91C_PIO_PB24) ;-  USART 1 Ready To Send
AT91C_PIO_PB25            EQU (1 << 25) ;- Pin Controlled by PB25
AT91C_PB25_TIOB6          EQU (AT91C_PIO_PB25) ;-  Timer Counter 6 Multipurpose Timer I/O Pin B
AT91C_PB25_CTS1           EQU (AT91C_PIO_PB25) ;-  USART 1 Clear To Send
AT91C_PIO_PB26            EQU (1 << 26) ;- Pin Controlled by PB26
AT91C_PB26_TIOA7          EQU (AT91C_PIO_PB26) ;-  Timer Counter 7 Multipurpose Timer I/O Pin A
AT91C_PB26_SCK1           EQU (AT91C_PIO_PB26) ;-  USART 1 Serial Clock
AT91C_PIO_PB27            EQU (1 << 27) ;- Pin Controlled by PB27
AT91C_PB27_TIOB7          EQU (AT91C_PIO_PB27) ;-  Timer Counter 7 Multipurpose Timer I/O Pin B
AT91C_PB27_RTS2           EQU (AT91C_PIO_PB27) ;-  USART 2 Ready To Send
AT91C_PIO_PB28            EQU (1 << 28) ;- Pin Controlled by PB28
AT91C_PB28_TIOA8          EQU (AT91C_PIO_PB28) ;-  Timer Counter 8 Multipurpose Timer I/O Pin A
AT91C_PB28_CTS2           EQU (AT91C_PIO_PB28) ;-  USART 2 Clear To Send
AT91C_PIO_PB29            EQU (1 << 29) ;- Pin Controlled by PB29
AT91C_PB29_TIOB8          EQU (AT91C_PIO_PB29) ;-  Timer Counter 8 Multipurpose Timer I/O Pin B
AT91C_PB29_SCK2           EQU (AT91C_PIO_PB29) ;-  USART 2 Serial Clock
AT91C_PIO_PB3             EQU (1 <<  3) ;- Pin Controlled by PB3
AT91C_PB3_TK0             EQU (AT91C_PIO_PB3) ;-  SSC Transmit Clock 0
AT91C_PB3_PCK0            EQU (AT91C_PIO_PB3) ;-  PMC Programmable Clock Output 0
AT91C_PIO_PB4             EQU (1 <<  4) ;- Pin Controlled by PB4
AT91C_PB4_TD0             EQU (AT91C_PIO_PB4) ;-  SSC Transmit data
AT91C_PB4_PCK1            EQU (AT91C_PIO_PB4) ;-  PMC Programmable Clock Output 1
AT91C_PIO_PB5             EQU (1 <<  5) ;- Pin Controlled by PB5
AT91C_PB5_RD0             EQU (AT91C_PIO_PB5) ;-  SSC Receive Data
AT91C_PB5_PCK2            EQU (AT91C_PIO_PB5) ;-  PMC Programmable Clock Output 2
AT91C_PIO_PB6             EQU (1 <<  6) ;- Pin Controlled by PB6
AT91C_PB6_RK0             EQU (AT91C_PIO_PB6) ;-  SSC Receive Clock
AT91C_PB6_PCK3            EQU (AT91C_PIO_PB6) ;-  PMC Programmable Clock Output 3
AT91C_PIO_PB7             EQU (1 <<  7) ;- Pin Controlled by PB7
AT91C_PB7_RF0             EQU (AT91C_PIO_PB7) ;-  SSC Receive Frame Sync 0
AT91C_PB7_CANTX1          EQU (AT91C_PIO_PB7) ;-  CAN Transmit 1
AT91C_PIO_PB8             EQU (1 <<  8) ;- Pin Controlled by PB8
AT91C_PB8_FIQ             EQU (AT91C_PIO_PB8) ;-  AIC Fast Interrupt Input
AT91C_PB8_TF1             EQU (AT91C_PIO_PB8) ;-  SSC Transmit Frame Sync 1
AT91C_PIO_PB9             EQU (1 <<  9) ;- Pin Controlled by PB9
AT91C_PB9_TCLK0           EQU (AT91C_PIO_PB9) ;-  Timer Counter 0 external clock input
AT91C_PB9_TK1             EQU (AT91C_PIO_PB9) ;-  SSC Transmit Clock 1

// - *****************************************************************************
// -               PERIPHERAL ID DEFINITIONS FOR AT91SAM7A3
// - *****************************************************************************
AT91C_ID_FIQ              EQU ( 0) ;- Advanced Interrupt Controller (FIQ)
AT91C_ID_SYS              EQU ( 1) ;- System Peripheral
AT91C_ID_PIOA             EQU ( 2) ;- Parallel IO Controller A 
AT91C_ID_PIOB             EQU ( 3) ;- Parallel IO Controller B
AT91C_ID_CAN0             EQU ( 4) ;- Control Area Network Controller 0
AT91C_ID_CAN1             EQU ( 5) ;- Control Area Network Controller 1
AT91C_ID_US0              EQU ( 6) ;- USART 0
AT91C_ID_US1              EQU ( 7) ;- USART 1
AT91C_ID_US2              EQU ( 8) ;- USART 2
AT91C_ID_MCI              EQU ( 9) ;- Multimedia Card Interface
AT91C_ID_TWI              EQU (10) ;- Two-Wire Interface
AT91C_ID_SPI0             EQU (11) ;- Serial Peripheral Interface 0
AT91C_ID_SPI1             EQU (12) ;- Serial Peripheral Interface 1
AT91C_ID_SSC0             EQU (13) ;- Serial Synchronous Controller 0
AT91C_ID_SSC1             EQU (14) ;- Serial Synchronous Controller 1
AT91C_ID_TC0              EQU (15) ;- Timer Counter 0
AT91C_ID_TC1              EQU (16) ;- Timer Counter 1
AT91C_ID_TC2              EQU (17) ;- Timer Counter 2
AT91C_ID_TC3              EQU (18) ;- Timer Counter 3
AT91C_ID_TC4              EQU (19) ;- Timer Counter 4
AT91C_ID_TC5              EQU (20) ;- Timer Counter 5
AT91C_ID_TC6              EQU (21) ;- Timer Counter 6
AT91C_ID_TC7              EQU (22) ;- Timer Counter 7
AT91C_ID_TC8              EQU (23) ;- Timer Counter 8
AT91C_ID_ADC0             EQU (24) ;- Analog To Digital Converter 0
AT91C_ID_ADC1             EQU (25) ;- Analog To Digital Converter 1
AT91C_ID_PWMC             EQU (26) ;- Pulse Width Modulation Controller
AT91C_ID_UDP              EQU (27) ;- USB Device Port
AT91C_ID_IRQ0             EQU (28) ;- Advanced Interrupt Controller (IRQ0)
AT91C_ID_IRQ1             EQU (29) ;- Advanced Interrupt Controller (IRQ1)
AT91C_ID_IRQ2             EQU (30) ;- Advanced Interrupt Controller (IRQ2)
AT91C_ID_IRQ3             EQU (31) ;- Advanced Interrupt Controller (IRQ3)

// - *****************************************************************************
// -               BASE ADDRESS DEFINITIONS FOR AT91SAM7A3
// - *****************************************************************************
AT91C_BASE_SYS            EQU (0xFFFFF000) ;- (SYS) Base Address
AT91C_BASE_AIC            EQU (0xFFFFF000) ;- (AIC) Base Address
AT91C_BASE_PDC_DBGU       EQU (0xFFFFF300) ;- (PDC_DBGU) Base Address
AT91C_BASE_DBGU           EQU (0xFFFFF200) ;- (DBGU) Base Address
AT91C_BASE_PIOA           EQU (0xFFFFF400) ;- (PIOA) Base Address
AT91C_BASE_PIOB           EQU (0xFFFFF600) ;- (PIOB) Base Address
AT91C_BASE_CKGR           EQU (0xFFFFFC20) ;- (CKGR) Base Address
AT91C_BASE_PMC            EQU (0xFFFFFC00) ;- (PMC) Base Address
AT91C_BASE_RSTC           EQU (0xFFFFFD00) ;- (RSTC) Base Address
AT91C_BASE_SHDWC          EQU (0xFFFFFD10) ;- (SHDWC) Base Address
AT91C_BASE_RTTC           EQU (0xFFFFFD20) ;- (RTTC) Base Address
AT91C_BASE_PITC           EQU (0xFFFFFD30) ;- (PITC) Base Address
AT91C_BASE_WDTC           EQU (0xFFFFFD40) ;- (WDTC) Base Address
AT91C_BASE_MC             EQU (0xFFFFFF00) ;- (MC) Base Address
AT91C_BASE_CAN0_MB0       EQU (0xFFF80200) ;- (CAN0_MB0) Base Address
AT91C_BASE_CAN0_MB1       EQU (0xFFF80220) ;- (CAN0_MB1) Base Address
AT91C_BASE_CAN0_MB2       EQU (0xFFF80240) ;- (CAN0_MB2) Base Address
AT91C_BASE_CAN0_MB3       EQU (0xFFF80260) ;- (CAN0_MB3) Base Address
AT91C_BASE_CAN0_MB4       EQU (0xFFF80280) ;- (CAN0_MB4) Base Address
AT91C_BASE_CAN0_MB5       EQU (0xFFF802A0) ;- (CAN0_MB5) Base Address
AT91C_BASE_CAN0_MB6       EQU (0xFFF802C0) ;- (CAN0_MB6) Base Address
AT91C_BASE_CAN0_MB7       EQU (0xFFF802E0) ;- (CAN0_MB7) Base Address
AT91C_BASE_CAN0_MB8       EQU (0xFFF80300) ;- (CAN0_MB8) Base Address
AT91C_BASE_CAN0_MB9       EQU (0xFFF80320) ;- (CAN0_MB9) Base Address
AT91C_BASE_CAN0_MB10      EQU (0xFFF80340) ;- (CAN0_MB10) Base Address
AT91C_BASE_CAN0_MB11      EQU (0xFFF80360) ;- (CAN0_MB11) Base Address
AT91C_BASE_CAN0_MB12      EQU (0xFFF80380) ;- (CAN0_MB12) Base Address
AT91C_BASE_CAN0_MB13      EQU (0xFFF803A0) ;- (CAN0_MB13) Base Address
AT91C_BASE_CAN0_MB14      EQU (0xFFF803C0) ;- (CAN0_MB14) Base Address
AT91C_BASE_CAN0_MB15      EQU (0xFFF803E0) ;- (CAN0_MB15) Base Address
AT91C_BASE_CAN0           EQU (0xFFF80000) ;- (CAN0) Base Address
AT91C_BASE_CAN1_MB0       EQU (0xFFF84200) ;- (CAN1_MB0) Base Address
AT91C_BASE_CAN1_MB1       EQU (0xFFF84220) ;- (CAN1_MB1) Base Address
AT91C_BASE_CAN1_MB2       EQU (0xFFF84240) ;- (CAN1_MB2) Base Address
AT91C_BASE_CAN1_MB3       EQU (0xFFF84260) ;- (CAN1_MB3) Base Address
AT91C_BASE_CAN1_MB4       EQU (0xFFF84280) ;- (CAN1_MB4) Base Address
AT91C_BASE_CAN1_MB5       EQU (0xFFF842A0) ;- (CAN1_MB5) Base Address
AT91C_BASE_CAN1_MB6       EQU (0xFFF842C0) ;- (CAN1_MB6) Base Address
AT91C_BASE_CAN1_MB7       EQU (0xFFF842E0) ;- (CAN1_MB7) Base Address
AT91C_BASE_CAN1_MB8       EQU (0xFFF84300) ;- (CAN1_MB8) Base Address
AT91C_BASE_CAN1_MB9       EQU (0xFFF84320) ;- (CAN1_MB9) Base Address
AT91C_BASE_CAN1_MB10      EQU (0xFFF84340) ;- (CAN1_MB10) Base Address
AT91C_BASE_CAN1_MB11      EQU (0xFFF84360) ;- (CAN1_MB11) Base Address
AT91C_BASE_CAN1_MB12      EQU (0xFFF84380) ;- (CAN1_MB12) Base Address
AT91C_BASE_CAN1_MB13      EQU (0xFFF843A0) ;- (CAN1_MB13) Base Address
AT91C_BASE_CAN1_MB14      EQU (0xFFF843C0) ;- (CAN1_MB14) Base Address
AT91C_BASE_CAN1_MB15      EQU (0xFFF843E0) ;- (CAN1_MB15) Base Address
AT91C_BASE_CAN1           EQU (0xFFF84000) ;- (CAN1) Base Address
AT91C_BASE_TC0            EQU (0xFFFA0000) ;- (TC0) Base Address
AT91C_BASE_TC1            EQU (0xFFFA0040) ;- (TC1) Base Address
AT91C_BASE_TC2            EQU (0xFFFA0080) ;- (TC2) Base Address
AT91C_BASE_TCB0           EQU (0xFFFA0000) ;- (TCB0) Base Address
AT91C_BASE_TC3            EQU (0xFFFA4000) ;- (TC3) Base Address
AT91C_BASE_TC4            EQU (0xFFFA4040) ;- (TC4) Base Address
AT91C_BASE_TC5            EQU (0xFFFA4080) ;- (TC5) Base Address
AT91C_BASE_TCB1           EQU (0xFFFA4000) ;- (TCB1) Base Address
AT91C_BASE_TC6            EQU (0xFFFA8000) ;- (TC6) Base Address
AT91C_BASE_TC7            EQU (0xFFFA8040) ;- (TC7) Base Address
AT91C_BASE_TC8            EQU (0xFFFA8080) ;- (TC8) Base Address
AT91C_BASE_TCB2           EQU (0xFFFA8000) ;- (TCB2) Base Address
AT91C_BASE_PDC_MCI        EQU (0xFFFAC100) ;- (PDC_MCI) Base Address
AT91C_BASE_MCI            EQU (0xFFFAC000) ;- (MCI) Base Address
AT91C_BASE_UDP            EQU (0xFFFB0000) ;- (UDP) Base Address
AT91C_BASE_TWI            EQU (0xFFFB8000) ;- (TWI) Base Address
AT91C_BASE_PDC_US0        EQU (0xFFFC0100) ;- (PDC_US0) Base Address
AT91C_BASE_US0            EQU (0xFFFC0000) ;- (US0) Base Address
AT91C_BASE_PDC_US1        EQU (0xFFFC4100) ;- (PDC_US1) Base Address
AT91C_BASE_US1            EQU (0xFFFC4000) ;- (US1) Base Address
AT91C_BASE_PDC_US2        EQU (0xFFFC8100) ;- (PDC_US2) Base Address
AT91C_BASE_US2            EQU (0xFFFC8000) ;- (US2) Base Address
AT91C_BASE_PWMC_CH0       EQU (0xFFFCC200) ;- (PWMC_CH0) Base Address
AT91C_BASE_PWMC_CH1       EQU (0xFFFCC220) ;- (PWMC_CH1) Base Address
AT91C_BASE_PWMC_CH2       EQU (0xFFFCC240) ;- (PWMC_CH2) Base Address
AT91C_BASE_PWMC_CH3       EQU (0xFFFCC260) ;- (PWMC_CH3) Base Address
AT91C_BASE_PWMC_CH4       EQU (0xFFFCC280) ;- (PWMC_CH4) Base Address
AT91C_BASE_PWMC_CH5       EQU (0xFFFCC2A0) ;- (PWMC_CH5) Base Address
AT91C_BASE_PWMC_CH6       EQU (0xFFFCC2C0) ;- (PWMC_CH6) Base Address
AT91C_BASE_PWMC_CH7       EQU (0xFFFCC2E0) ;- (PWMC_CH7) Base Address
AT91C_BASE_PWMC           EQU (0xFFFCC000) ;- (PWMC) Base Address
AT91C_BASE_PDC_SSC0       EQU (0xFFFD0100) ;- (PDC_SSC0) Base Address
AT91C_BASE_SSC0           EQU (0xFFFD0000) ;- (SSC0) Base Address
AT91C_BASE_PDC_SSC1       EQU (0xFFFD4100) ;- (PDC_SSC1) Base Address
AT91C_BASE_SSC1           EQU (0xFFFD4000) ;- (SSC1) Base Address
AT91C_BASE_PDC_ADC0       EQU (0xFFFD8100) ;- (PDC_ADC0) Base Address
AT91C_BASE_ADC0           EQU (0xFFFD8000) ;- (ADC0) Base Address
AT91C_BASE_PDC_ADC1       EQU (0xFFFDC100) ;- (PDC_ADC1) Base Address
AT91C_BASE_ADC1           EQU (0xFFFDC000) ;- (ADC1) Base Address
AT91C_BASE_PDC_SPI0       EQU (0xFFFE0100) ;- (PDC_SPI0) Base Address
AT91C_BASE_SPI0           EQU (0xFFFE0000) ;- (SPI0) Base Address
AT91C_BASE_PDC_SPI1       EQU (0xFFFE4100) ;- (PDC_SPI1) Base Address
AT91C_BASE_SPI1           EQU (0xFFFE4000) ;- (SPI1) Base Address

// - *****************************************************************************
// -               MEMORY MAPPING DEFINITIONS FOR AT91SAM7A3
// - *****************************************************************************
AT91C_ISRAM               EQU (0x00200000) ;- Internal SRAM base address
AT91C_ISRAM_SIZE          EQU (0x00008000) ;- Internal SRAM size in byte (32 Kbyte)
AT91C_IFLASH              EQU (0x00100000) ;- Internal Flash base address
AT91C_IFLASH_SIZE         EQU (0x00040000) ;- Internal Flash size in byte (256 Kbyte)

#endif /* AT91SAM7A3_H */
